{"search_id":"search_e42eb3f720284a8e85ecc4217b4ca4dc","results":[{"url":"https://yukidata.com/blog/snowflake-finops-guide/","title":"Snowflake FinOps: Complete Guide to Automated Cost Optimization | Yuki","publish_date":"2025-09-19","excerpts":["Section Title: Snowflake FinOps: Complete Guide to Automated Cost Optimization\nContent:\nBy Perry Tapiero\nSeptember 19, 2025 | 5 min read\nYour Snowflake bill increased 40% last quarter, but query performance actually got worse.\nSound familiar?\nAll FinOps organizations eventually run into this wall when they outgrow Snowflake’s basic auto-suspend and resource monitors. While Snowflake’s per-second billing offers flexibility, it also means a single efficient query can eat through hundreds of dollars – which is why manual warehouse management can’t keep pace with enterprise-sized workloads.\nThe bright side: modern Snowflake FinOps fixes this with automated systems that allow you to optimize spend and performance in real time.\nHow do you get to that point? Read on. We’ll share all of our FinOps best practices,e automation strategies, and real-world tactics that have helped enterprises cut monthly Snowflake costs by 30% or more.\n ... \nSection Title: ... > : Automated Chargeback and Showback Models\nContent:\n**The problem:** No clear cost attribution means that teams often treat Snowflake as if it were “free,” leading to wasteful usage and budget overruns.\n**The solution:** Automated cost attribution that gets you accountability without expensive administration overhead:\n**Tag-based attribution** that automatically assigns costs to projects and business units\n**Usage-based chargeback** for shared warehouses using per-query\n**Predictive showback** forecasting team spend based on current trends\n**ROI tracking** connecting data platform costs to business outcomes\nManual tagging doesn’t scale. You need systems that automatically attribute costs based on your usage patterns, user roles, and business context.\n ... \nSection Title: ... > Maintaining Fraud Detection & Risk Scoring at Scale\nContent:\nFinancial service teams need millisecond response times for fraud detection. Downtime is simply not an option. Status provisioning either wastes compute or fails under spikes.\n**The solution:** Invest in a third-party tool that detects anomalies in query volume and dynamically scales compute to meet SLAs, then scales back when that load reduces.\n ... \nSection Title: Snowflake FinOps: Complete Guide to Automated Cost Optimization > ... > AI-Native Cost Optimization\nContent:\nIt shouldn’t surprise you to see AI on this list. Next-generation systems will be using machine learning for everything. Not just analysis, but optimization, too:\n**Predictive configurations** for new workloads based on historical patterns\n[**Automated query tuning**](https://yukidata.com/blog/snowflake-query-optimization/) using reinforcement learning\n**Intelligent data placement** that minimizes storage and compute costs at the same time\nAI-native approaches take you another step further from reactive optimization to [predictive cost management](https://yukidata.com/blog/snowflake-cost-optimization-guide/) . It means you can prevent inefficiencies before they even occur."]},{"url":"https://www.snowflake.com/en/developers/guides/ml-forecasting-ad/","title":"Getting Started with Snowflake ML Functions: Anomaly Detection & Forecasting","excerpts":["Section Title: Getting Started with Snowflake ML Functions: Anomaly Detection & Forecasting > Overview\nContent:\nOne of the most critical activities that a Data/Business Analyst has to perform is to produce recommendations to their business stakeholders based upon the insights they have gleaned from their data. In practice, this means that they are often required to build models to: make forecasts, identify long running trends, and identify abnormalities within their data. However, Analysts are often impeded from creating the best models possible due to the depth of statistical and machine learning knowledge required to implement them in practice. Further, python or other programming frameworks may be unfamiliar to Analysts who write SQL, and the nuances of fine-tuning a model may require expert knowledge that may be out of reach.\nSection Title: Getting Started with Snowflake ML Functions: Anomaly Detection & Forecasting > Overview\nContent:\nFor these use cases, Snowflake has developed a set of SQL based ML Functions, that implement machine learning models on the user's behalf. As of December 2023, three ML Functions are available for time-series based data:\nForecasting: which enables users to forecast a metric based on past values. Common use-cases for forecasting including predicting future sales, demand for particular sku's of an item, or volume of traffic into a website over a period of time.\nAnomaly Detection: which flags anomalous values using both unsupervised and supervised learning methods. This may be useful in use-cases where you want to identify spikes in your cloud spend, identifying abnormal data points in logs, and more.\nContribution Explorer: which enables users to perform root cause analysis to determine the most significant drivers to a particular metric of interest.\n ... \nSection Title: ... > Step 2: Creating our First Forecasting Model: Lobster Mac & Cheese\nContent:\nWe can use SQL to directly call the forecasting ML function. Under the hood, the forecasting ML function automatically takes care of many of the data science best practices that are required to build good models. This includes performing hyper-parameter tuning, adjusting for missing data, and creating new features. We will build our first forecasting model below, for only the Lobster Mac & Cheese menu item.\n-- Create view for lobster sales\nCREATE OR REPLACE VIEW lobster_sales AS (\nSELECT\ntimestamp,\ntotal_sold\nFROM\nvancouver_sales\nWHERE\nmenu_item_name LIKE 'Lobster Mac & Cheese'\n);\n-- Build Forecasting model; this could take ~15-25 secs; please be patient\nCREATE OR REPLACE forecast lobstermac_forecast (\nINPUT_DATA => SYSTEM$REFERENCE('VIEW', 'lobster_sales'),\nTIMESTAMP_COLNAME => 'TIMESTAMP',\nTARGET_COLNAME => 'TOTAL_SOLD'\n);\n-- Show models to confirm training has completed\nSHOW forecast;\n```\n\nCopy\n```"]},{"url":"https://www.snowflake.com/en/developers/guides/well-architected-framework-cost-optimization-and-finops/","title":"Cost Optimization","excerpts":["Section Title: Cost Optimization > Visibility > Overview > Investigate anomalous consumption activity\nContent:\nCost Anomaly Detection is a critical component of visibility that\nleverages machine learning to continuously monitor credit consumption\nagainst historical spending patterns, automatically flagging significant\ndeviations from the established baseline. This proactive monitoring is\nessential for preventing budget overruns and identifying inefficiencies,\nshifting the organization from a reactive to a proactive cost management\nposture to mitigate financial risk. As a best practice, you should\ninitially review anomaly detection on the entire account to gain a broad\nview, then dive deeper into a more granular review for individual\nhigh-spend warehouses. [This approach](https://docs.snowflake.com/en/user-guide/cost-anomalies) allows for more targeted analysis and assigns clear ownership for\ninvestigating any flagged anomalies. There are several methods for\nanomaly detection supported by Snowflake:\n ... \nSection Title: Cost Optimization > Visibility > Overview > Investigate anomalous consumption activity\nContent:\nTo\nfoster a culture of cost awareness and accountability, it is a best\npractice to ensure there is an owner for an anomaly detected in the\naccount and set up a [notification (via email)](https://docs.snowflake.com/en/user-guide/cost-anomalies-ui) in the UI itself to ensure that cost anomalies are quickly and\naccurately investigated.\nSection Title: Cost Optimization > Visibility > Overview > Investigate anomalous consumption activity\nContent:\n**Programmatic Cost Anomaly Detection**\nFor deeper integration and automation, organizations can review [anomalies programmatically](https://docs.snowflake.com/en/user-guide/cost-anomalies-class) using the SQL functions and views available within the SNOWFLAKE.LOCAL\nschema. This approach is important for enabling automation and\nscalability, allowing cost governance to be embedded directly into\noperational workflows, such as feeding anomaly data into third-party\nobservability tools or triggering automated incident response playbooks.\nA key best practice is to utilize this programmatic access to build\ncustom reports and dashboards that align with specific financial\nreporting needs and to create advanced, automated alerting mechanisms\nthat pipe anomaly data into established operational channels, such as\nSlack or PagerDuty.\n**Custom Anomaly Detection & Notification**\nSection Title: Cost Optimization > Visibility > Overview > Investigate anomalous consumption activity\nContent:\nAlthough anomalies are detected at the account and organization level,\nif you desire to detect anomalies at lower levels (e.g. warehouse or\ntable), it is recommended to leverage Snowflake’s [Anomaly Detection](https://docs.snowflake.com/en/user-guide/ml-functions/anomaly-detection) ML class and pair it with a Snowflake [alert](https://docs.snowflake.com/en/user-guide/ml-functions/anomaly-detection) to notify owners of more granular anomalies that occur within the\necosystem. This ensures all levels of Snowflake cost can be monitored in\na proactive and effective way."]},{"url":"https://ternary.app/blog/top-snowflake-cost-management-tools/","title":"Top 4 Snowflake Cost Management & Optimization Tools | Ternary","publish_date":"2025-12-11","excerpts":["Platform\nKey Features\n[earthquake Anomaly detection](https://ternary.app/platform/anomaly-detection/)\n[pie_chart Cost allocation](https://ternary.app/platform/cloud-cost-allocation/)\n[finance_mode Cost optimization](https://ternary.app/platform/cloud-cost-optimization/)\n[area_chart Forecasting](https://ternary.app/platform/cloud-cost-forecasting/)\n[empty_dashboard Reporting engine](https://ternary.app/platform/finops-reporting-engine/)\nIntegrations\nSolutions\nBy Industry\n[credit_card Financial Services](https://ternary.app/solutions/financial-services/)\n[earthquake Healthcare & Life Sciences](https://ternary.app/solutions/healthcare-life-sciences/)\n[account_balance Public Sector (SLED)](https://ternary.app/solutions/finops-for-public-sector/)\n[shopping_bag Retail & Consumer Goods](https://ternary.app/solutions/retail/)\nBy Use Case\n[cognition_2 AI cost management](https://ternary.app/solutions/ai-cost-management/)\nResources\nCompany\nLog in\n[laptop_mac US log\n ... \nSection Title: Top 4 Snowflake cost management tools > Can I just use Snowflake native cost tools?\nContent:\n**Full cost visibility and attribution** across teams and workloads\n**Intelligent forecasting** that predicts spend before it spikes\n**Automated alerts and anomaly detection** that highlight issues in real time\nIn short, Snowflake shows you what you spent. A third-party Snowflake management tool explains why it happened and how to reduce it.\n ... \nSection Title: Top 4 Snowflake cost management tools > ... > 1. Ternary\nContent:\nThe platform provides industry-leading capabilities across anomaly detection, budget management, cost allocation, and forecasting, making it a great tool for organizations that require cost management and optimization across their entire infrastructure.\nSection Title: Top 4 Snowflake cost management tools > ... > 2. Select.dev\nContent:\n[ [Source](https://select.dev/) ]\nSelect.dev is a dedicated Snowflake cost management platform. Its two main functions are Snowflake observability and optimization. Like Ternary, it also gives you a detailed visibility into credits down to individual queries, workloads, users, and teams.\nIn addition to providing visibility, it also continuously analyzes your account to inform you about optimization opportunities.\nThere’s also support for automatic warehouse adjustments. For example, it can scale virtual warehouses up or down based on actual usage patterns with zero intervention from you.\nYou can also allocate costs to specific teams or projects, then set budget thresholds for them so they feel accountable for their spending.\nSelect.dev has built-in [anomaly detection](https://ternary.app/platform/anomaly-detection/) too, which informs you about spikes through channels like Slack and email.\n ... \nSection Title: Top 4 Snowflake cost management tools > Related articles\nContent:\n[Overview](https://ternary.app/platform/overview/)\n[Why Ternary](https://ternary.app/platform/why-ternary/)\n[Anomaly detection](https://ternary.app/platform/anomaly-detection/)\n[Cost allocation](https://ternary.app/platform/cloud-cost-allocation/)\n[Cloud cost optimization](https://ternary.app/platform/cloud-cost-optimization/)\n[Forecasting](https://ternary.app/platform/cloud-cost-forecasting/)\n[Reporting Engine](https://ternary.app/platform/finops-reporting-engine/)\nIntegrations"]},{"url":"https://www.snowflake.com/en/blog/cost-management-interface-generally-available/","title":"Better Control Your Snowflake Spend with the Cost Management Interface","publish_date":"2024-08-19","excerpts":["Section Title: ... > Public preview of Organization Overview experience\nContent:\nWe’re introducing the Organization Overview experience to give you a holistic view of spend across multiple accounts. With this intuitive interface, you can quickly access vital information, including: * **Spend summary** : Instant access to essential spend KPIs, such as total spend in USD, remaining balance, average monthly cost and total number of accounts.\n**Contract overview** : Detailed insights into contract consumption and forecast, including accumulated actual spend vs. forecasted spend, contract progress details and contract length.\n**Account spend summary** : A breakdown of top accounts by spend, with statistics on accumulated spend for the time period, current month spend, last month spend and monthly average.\nSection Title: ... > General availability of Account Overview experience\nContent:\nWe're thrilled to announce the general availability (GA) of the Account Overview experience, providing comprehensive insights into account-level spending. With new key features, users can now: * **Monitor account spend** : Get an overview of your account spend and track it against set budgets.\n**Forecast spend** : Predict future expenditures against budget allocations, ensuring financial plans remain on track.\n**Identify top areas by spend** : Pinpoint top areas of expenditure, including warehouses, queries and databases by storage.\n**Optimize spend** : Use Cost Insights (GA soon) to identify opportunities for cost optimization, maximizing every dollar spent.\n ... \nSection Title: ... > Take cost controls with Budgets\nContent:\nWe are excited to also announce the Budgets feature in GA. As part of our public preview of Budgets, we received tremendous feedback, excitement and participation from customers. To recap, the Budgets feature is a cost control that monitors Snowflake compute credits across warehouses and serverless features (auto-clustering, replication, search optimization, etc.) within a Snowflake account. You can set up a budget for the entire account, which will monitor all of the compute resources within the account for the month against the spending limit set for that account, as seen below.\nOr, you can create a budget for a group of resources (Snowflake objects) within your account, representing either a business unit, department or application, and track its spend against the spending limit allocated for that month.\n ... \nSection Title: ... > Take cost controls with Budgets\nContent:\nImproved email notifications that detail the accounts that sent the notification, with the ability to log in to that account.\nWe are excited to see how customers use the new cost management features and look forward to bringing new capabilities to manage, control and optimize Snowflake spend for our customers. To get started, watch this demo on [Snowflake’s cost management and spend visibility](https://www.youtube.com/watch?v=6fAEc6Cx2hk) , or dive into this video on how to [understand, control and optimize spend in Snowflake more effectively](https://www.youtube.com/watch?v=Dwf11NxNqbw) . For general best practices, check out the [Definitive Guide to Managing Spend in Snowflake](https://www.snowflake.com/en/resources/white-paper/definitive-guide-to-managing-spend-in-snowflake/) for a detailed overview of how to use the platform efficiently, consume sustainably and deliver maximum business value."]},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/container-cost-governance","title":"Costs associated with apps with containers | Snowflake Documentation","excerpts":["considerations](/en/developer-guide/streamlit/object-management/billing \"Billing considerations\")\n[Security considerations](/en/developer-guide/streamlit/object-management/security \"Security considerations\")\n[Privilege requirements](/en/developer-guide/streamlit/object-management/privileges \"Privilege requirements\")\n[Understanding owner's rights](/en/developer-guide/streamlit/object-management/owners-rights \"Understanding owner's rights\")\n[PrivateLink](/en/developer-guide/streamlit/object-management/privatelink \"PrivateLink\")\n[Logging and tracing](/en/developer-guide/streamlit/object-management/logging-tracing \"Logging and tracing\")\nApp development\n[Runtime environments](/en/developer-guide/streamlit/app-development/runtime-environments \"Runtime environments\")\n[Dependency management](/en/developer-guide/streamlit/app-development/dependency-management \"Dependency management\")\n[File organization](/en/developer-guide/streamlit/app-development/file-organization \"File"]},{"url":"https://docs.snowflake.com/en/user-guide/cost-understanding-overall","title":"Understanding overall cost | Snowflake Documentation","excerpts":["Section Title: ... > How are costs incurred? [¶]( \"Link to this heading\")\nContent:\n**Virtual Warehouse Compute** : [Virtual warehouses](warehouses) are user-managed compute resources that consume\ncredits when loading data, executing queries, and performing other DML operations. Because Snowflake utilizes per-second billing (with a\n60-second minimum each time the warehouse starts), warehouses are billed only for the credits they actually consume when they are\nactively working. **Serverless Compute** : There are Snowflake features such as Search Optimization and Snowpipe that use Snowflake-managed compute\nresources rather than virtual warehouses. To minimize cost, these serverless compute resources are automatically resized and scaled\nup or down by Snowflake as required for each workload. **Cloud Services Compute** : The cloud services layer of the Snowflake architecture consumes credits as it performs behind-the-scenes\ntasks such as authentication, metadata management, and access control."]},{"url":"https://www.snowflake.com/webinars/thought-leadership/finops-best-practices-for-snowflake-2025-07-17/scott-redding/","title":"FinOps Best Practices for Snowflake - Snowflake","publish_date":"2025-07-19","excerpts":["[Skip to content]()\n[](https://www.snowflake.com/)\nSection Title: FinOps Best Practices for Snowflake\nContent:\nOn-Demand\nLearn how to have better visibility, control and optimization of Snowflake cost and performance through tested and proven FinOps best practices.\nLearn more about considerations for consumption models such as Snowflake’s\nGet tips and tricks for managing and optimizing Snowflake spend from real customer engagements\nGain a deeper look at some of the newest capabilities like Cost-Based Anomaly Detection, Query Insights\nWatch hands-on demos from Professional Services experts\nSection Title: FinOps Best Practices for Snowflake > Speakers > Scott Redding\nContent:\nConsulting Manager\nSnowflake"]}],"usage":[{"name":"sku_search","count":1}]}
