{
  "extract_id": "extract_386bda634c814b619abf0f20f8d10347",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/user-guide/budgets",
      "title": "Monitor credit usage with budgets | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Guides Cost & Billing Control Budgets\n\n# Monitor credit usage with budgets ¶\n\nA budget defines a monthly spending limit on the compute costs for\na Snowflake account or a custom group of Snowflake objects. When the spending limit is projected to be exceeded, a notification is\nsent. You can configure the budget to send this notification to a list of email addresses, a queue provided by a cloud service\n(Amazon SNS, Azure Event Grid, or Google Cloud PubSub), or a webhook for a third-party system (for example, Slack, Microsoft\nTeams, or PagerDuty).\n\n## Account budget and custom budgets ¶\n\nThe _account budget_ monitors spending for all credit usage in the account.\n\nYou can also create a _custom budget_ to monitor the spending limits for a specific group of supported objects .\n\nFor both types of budgets, you must set up the spending limit and specify how you want to receive notifications.\n\nTo start using budgets in Snowflake, activate the account budget .\n\n## Spending limit and time interval ¶\n\nThe spending limit is expressed in Snowflake credits and is used for alerting and notifications purposes only. The spending limit\nis set for the time interval of one calendar month.\n\nThe time interval starts at 12:00AM UTC on the first day of the month and ends at 11:59PM UTC on the last day of the month. If a budget\nis created after the first day of the month, the first monitoring interval is the period until the last day of the current month, then\nis reset on the first of the following month.\n\nIf you activate your _account budget_ after the first day of the month, data starting from the beginning of the month is backfilled\nand used to determine if you are going to exceed your spending limit for the month.\n\nIf you create a _custom budget_ after the first day of the month, historical data for the month is only backfilled for resources that were\nadded to the budget using a tag. Data from resources added individually are not backfilled.\n\nNote\n\nIf you create a custom budget and individually add resources to the budget instead of using a tag, consider the following:\n\n* Forecasting for future spend by those resources is based on the credit usage only for the days after the budget is enabled.\n* You might exceed your budget for the first month. Because the data for the resources is not backfilled, the forecasting might be\n  incorrect. Subsequent months will correctly forecast credit usage based on spending history.\n\n## Adjusting the budget refresh interval ¶\n\nA budget cannot calculate whether consumption has reached a spending limit until the budget is refreshed with the most current consumption\ndata. The time period between consumption and the budget’s receipt of information about that consumption is called the\nbudget refresh interval.\n\nBy default, the budget refresh interval is up to 6.5 hours. You can reduce the budget refresh interval to one hour, which can be helpful\nwhen you need to watch spending more carefully. A budget with a one-hour refresh interval is known as a _low latency budget_ . You can\ntemporarily reduce the budget refresh interval to closely monitor consumption, and then set it back to the default to save on costs.\n\nSetting the refresh interval to one hour increases the compute cost of the budget by a factor of 12. For example, if a budget consumes one\ncredit per month when the refresh interval is 6.5 hours, then the budget consumes 12 credits per month when the refresh period is one hour.\nTo determine the current compute cost of your budgets, see Exploring compute costs .\n\n* To adjust the budget refresh interval, call the SET\\_REFRESH\\_TIER method.\n  You can also use Snowsight to adjust the interval for a custom budget by selecting or deselecting the Enable low latency budget field.\n* To retrieve the current refresh interval, call the GET\\_REFRESH\\_TIER method.\n\n## Supported services ¶\n\nBudgets monitor credit usage for the following services. Use the table to determine whether custom budgets support the service and which\nobject is associated with the service.\n\nNote\n\nAccount budget support for serverless features depends on the availability of\nservice types in the Account Usage METERING\\_HISTORY view view.\n\n|Service |Account budget |Custom budget |Object |\n| --- | --- | --- | --- |\n|AI\\_SERVICES |✔ | | |\n|AUTO\\_CLUSTERING |✔ |✔ |Table |\n|COPY\\_FILES |✔ |✔ |Database |\n|DATA\\_QUALITY\\_MONITORING |✔ |✔ |Table |\n|HYBRID\\_TABLE\\_REQUESTS |✔ | | |\n|MATERIALIZED\\_VIEW |✔ |✔ |Materialized view |\n|PIPE |✔ |✔ |Pipe |\n|QUERY\\_ACCELERATION |✔ |✔ |Warehouse |\n|REPLICATION |✔ |✔ |Database, Replication group |\n|SEARCH\\_OPTIMIZATION |✔ |✔ |Table |\n|SERVERLESS\\_ALERTS |✔ |✔ |Alert |\n|SERVERLESS\\_TASK |✔ |✔ |Task |\n|SNOWPARK\\_CONTAINER\\_SERVICES |✔ |✔ |Compute pool |\n|SNOWPIPE\\_STREAMING |✔ |✔ |Table |\n|WAREHOUSE\\_METERING |✔ |✔ |Warehouse |\n\n## Budgets notifications ¶\n\nA budget sends a daily alert notification when current spending is on track to exceed the spending limit based on time-series\nforecasting.\n\nTo receive automatic alert notifications, you must do the following as part of activating the account budget or creating a custom budget:\n\n* Set a spending limit for the budget.\n* Specify how you want to receive notifications about the budget.\n\nFor more information, see Notifications for budgets .\n\n## Budgets roles and privileges ¶\n\nTo enable a custom role in your account to work with budgets, you can grant the following roles and privileges.\n\nNote\n\nSnowflake provides application roles and database roles that control access to all cost-related features, including budgets. For\ninformation about granting these roles to a custom role rather than working with budget-specific roles and privileges, see Access control for cost management .\n\n### Application roles to manage the account budget ¶\n\nYou can grant the following application roles to a custom role in your account to monitor or manage the account budget:\n\n|Application Role |Description |\n| --- | --- |\n|BUDGET\\_VIEWER |Enables a role to view budget usage data and list the resources in the budget. |\n|BUDGET\\_ADMIN |Enables a role to activate or deactivate the account budget and modify the properties of a budget including spending limit,\nthe notification integrations to use, the list of email addresses to receive notifications, and the mute notifications\nsetting. |\n\nIn addition to the application role, there are other required privileges that must be granted to enable a custom role to monitor or manage\nthe account budget. For more information, see Required roles and privileges .\n\n### Instance roles to manage custom budgets ¶\n\nEach custom budget has instance roles that you can grant to other roles to view or modify the budget:\n\n|Instance Role |Description |\n| --- | --- |\n|VIEWER |Enables a role to view budget usage data. |\n|ADMIN |Enables a role to modify the properties of a budget including spending limit, the notification integrations to use, the\nlist of email addresses to receive notifications, the mute notifications setting, and the objects in the group. |\n\nIn addition to the instance role, there are other required privileges that must be granted to enable a custom role to create, monitor, or\nmodify a custom budget. For more information, see Required roles and privileges .\n\n### Required roles and privileges ¶\n\nIn addition to the application or instance roles, the following privileges must be granted to a custom role to monitor or manage budgets:\n\n|Privilege or role |Budget type |Create |Manage |Monitor |Notes |\n| --- | --- | --- | --- | --- | --- |\n|USAGE\\_VIEWER |Both |✔ |✔ |✔ |Grant the Snowflake database role USAGE\\_VIEWER to the custom role. |\n|USAGE |Custom |✔ |✔ |✔ |Grant the USAGE privilege on the database or schema that contains the custom budget. |\n|SNOWFLAKE.BUDGET\\_CREATOR |Custom |✔ | | |Grant this database role to the custom role to enable it to create custom budgets. |\n|CREATE SNOWFLAKE.CORE.BUDGET |Custom |✔ | | |Grant this privilege on the schema that will contain the custom budget. |\n|APPLYBUDGET |Custom | |✔ | |Must be granted on each object to be added or removed from a custom budget. |\n|USAGE |Custom | |✔ | |To add or remove schema objects from a custom budget, this privilege must be granted on the database and schema that contains\nthe object. |\n\nFor more information and examples, see the following sections:\n\n* Create a custom role to manage the account budget\n* Create a custom role to monitor the account budget\n* Create a custom role to monitor a custom budget\n* Create a custom role to manage a custom budget\n* Create a custom role to create budgets\n\n## Limitations ¶\n\nThe following are limitations for Budgets:\n\n* Instances of the BUDGET class can’t be replicated to target accounts.\n* An account can contain a maximum of 100 custom budgets.\n* Currently, Budgets does not support monitoring costs for Hybrid tables .\n* The following account-level parameters must be unset or set to the default value:\n  \n    + AUTOCOMMIT must be unset or set to TRUE.\n        \n        If this parameter is set to FALSE, activating a budget might fail, or usage might not be tracked correctly.\n    + TIMESTAMP\\_INPUT\\_FORMAT and DATE\\_INPUT\\_FORMAT must be unset or set to AUTO.\n        \n        If these parameters aren’t set to AUTO, usage might not be tracked correctly.\n  \n  Before you activate budgets, check the values of these parameters by executing the SHOW PARAMETERS command:\n  \n  ```\n  SHOW PARAMETERS LIKE 'AUTOCOMMIT' IN ACCOUNT ;\n  ```\n  \n  Copy\n  \n  ```\n  SHOW PARAMETERS LIKE 'TIMESTAMP_INPUT_FORMAT' IN ACCOUNT ;\n  ```\n  \n  Copy\n  \n  ```\n  SHOW PARAMETERS LIKE 'DATE_INPUT_FORMAT' IN ACCOUNT ;\n  ```\n  \n  Copy\n  \n  Note\n  \n  You must set these parameters at the account level. Setting the parameters at a lower level (for example, at the session\n  level) doesn’t have an effect on activating budgets or tracking usage.\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)"
      ],
      "full_content": null
    },
    {
      "url": "https://docs.snowflake.com/en/user-guide/cost-controlling",
      "title": "Controlling cost | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Guides Cost & Billing Control\n\n# Controlling cost ¶\n\nYou can use budgets to control credit usage for compute costs, including those incurred by serverless features. If you are only concerned\nwith controlling the costs of warehouses, you can also use resource monitors to monitor and suspend warehouses. In addition, Snowflake\nprovides cost controls you can configure to help avoid unexpected costs.\n\n## Use budgets to control credit usage ¶\n\nA _budget_ allows you to set a monthly spending limit and monitor the credit usage of all supported objects and serverless features in your account. In addition to your account budget,\nyou can create custom budgets to monitor credit usage of groups of specified objects and the serverless features used by those objects.\nFor example, you can create a custom budget for each department in your organization. Each budget sends a notification if the\ncredit usage is expected to exceed its spending limit for the month. You can configure the budget to send this notification to a\nlist of email addresses, a queue provided by a cloud service (Amazon SNS, Azure Event Grid, or Google Cloud PubSub), or a webhook\nfor a third-party system (for example, Slack, Microsoft Teams, or PagerDuty).\n\nFor information about budgets, see Monitor credit usage with budgets .\n\n## Use resource monitors to control credit usage ¶\n\nA _resource monitor_ lets you monitor credit usage by user-managed virtual warehouses. You can set a spending limit that resets on a\nmonthly basis or on a custom schedule. A resource monitor can\nsend an email notification when your credit usage reaches a percentage (threshold) of the spending limit. You can customize up to five\nnotification thresholds. To help avoid unexpected credit usage, you can optionally suspend a warehouse when its credit usage reaches\na threshold.\n\nFor background information about how virtual warehouses incur costs, see Understanding compute cost .\n\nFor information about resource monitors, see Working with resource monitors .\n\n## Cost controls for warehouses ¶\n\nFor a set of best practices that act as cost controls for virtual warehouses, see Cost controls for warehouses .\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Use budgets to control credit usage\n2. Use resource monitors to control credit usage\n3. Cost controls for warehouses\n\nRelated content\n\n1. Managing cost in Snowflake"
      ],
      "full_content": null
    },
    {
      "url": "https://docs.snowflake.com/en/user-guide/budgets/account-budget",
      "title": "Work with the account budget | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Guides Cost & Billing Control Budgets Account budgets\n\n# Work with the account budget ¶\n\nThe account budget monitors spending for all credit usage in the account.\n\n## Activating the account budget ¶\n\nTo start using budgets to monitor credit usage for your account, activate the account budget. After you activate the account\nbudget, you can set the spending limit for the account and configure how notifications are sent when credit usage is\nexpected to exceed the spending limit. Notifications begin when projected spending is more than 10% above the spending limit.\n\nYou can activate the account budget by using Snowsight or by executing SQL statements.\n\nThe next sections explain how to activate the account budget:\n\n* Create a custom role to manage the account budget\n* Use Snowsight to activate the account budget\n* Use SQL commands to activate the account budget\n\n### Create a custom role to manage the account budget ¶\n\nYou can create a custom role to activate and modify the account budget. A user who is granted this role can administer the budget by taking\nthe following actions on the account budget:\n\n* Activate and deactivate the account budget.\n* Set the spending limit.\n* Edit notification settings.\n* Monitor credit usage for the account.\n\nFor a full list of roles and privileges required for the budget administrator role, see Budgets roles and privileges .\n\nThe following example creates a role named `account_budget_admin` and grants the role the ability to monitor and manage the\naccount budget:\n\n```\nUSE ROLE ACCOUNTADMIN ; \n\n CREATE ROLE account_budget_admin ; \n\n GRANT APPLICATION ROLE SNOWFLAKE.BUDGET_ADMIN TO ROLE account_budget_admin ; \n\n GRANT IMPORTED PRIVILEGES ON DATABASE SNOWFLAKE TO ROLE account_budget_admin ;\n```\n\nCopy\n\n### Use Snowsight to activate the account budget ¶\n\nNote\n\nOnly a user with the ACCOUNTADMIN role or a role granted account budget admin privileges can activate and set up the account budget for a regular\naccount.\n\nIf you are activating the account budget for the organization account , use the GLOBALORGADMIN\nrole instead of the ACCOUNTADMIN role.\n\n2. In the navigation menu, select Admin » Cost management .\n3. Select Budgets .\n4. If prompted, select a warehouse.\n5. In the dashboard, select Set up Account Budget .\n6. Enter the target spending limit for the account.\n7. Enter the email addresses to receive notification emails.\n   \n   Note\n   \n   Each email address added for budget notifications must be verified . The\n   notification email setup fails if any email address in the list is _not_ verified.\n8. Select Finish Setup .\n\n### Use SQL commands to activate the account budget ¶\n\nNote\n\nOnly a user with the ACCOUNTADMIN role or a role granted account budget admin privileges can activate and set up the account budget in a regular\naccount.\n\nIf you are activating the account budget for the organization account , use the GLOBALORGADMIN\nrole instead of the ACCOUNTADMIN role.\n\n1. Activate the account budget by calling the account\\_root\\_budget!ACTIVATE method on the\n   SNOWFLAKE.LOCAL.ACCOUNT\\_ROOT\\_BUDGET object:\n   \n   ```\n   CALL SNOWFLAKE.LOCAL.ACCOUNT_ROOT_BUDGET ! ACTIVATE ();\n   ```\n   \n   Copy\n2. Set the spending limit calling the <budget\\_name>!SET\\_SPENDING\\_LIMIT method:\n   \n   ```\n   CALL SNOWFLAKE.LOCAL.ACCOUNT_ROOT_BUDGET ! SET_SPENDING_LIMIT ( 1000 );\n   ```\n   \n   Copy\n3. Set up notifications for the budget so that you receive notifications when your credit usage is expected to exceed your\n   spending limits.\n   \n   See Notifications for budgets .\n\n## Deactivating the account budget ¶\n\nYou can deactivate the account budget using Snowsight or SQL.\n\nDeactivating the account budget resets the account budget to its state before activation:\n\n* All historical account budget data is deleted.\n* The background measurement task for the account budget is suspended.\n* The account budget settings for spending limit and email notifications are reset.\n\nAccount budget deactivation does not affect custom budgets. To remove a custom budget from your account, use\nthe DROP BUDGET command.\n\nNote\n\nIf the account budget is deactivated, you can’t create new custom budgets using Snowsight.\nHowever, you can continue to create custom budgets using SQL .\n\n### Use Snowsight to deactivate the account budget ¶\n\nYou can deactivate the account budget using the Budgets page:\n\n2. In the navigation menu, select Admin » Cost management .\n3. Select Budgets .\n4. Select the  more menu.\n5. Select Deactivate account budget .\n\n### Use SQL commands to deactivate the account budget ¶\n\nYou can use the account\\_root\\_budget!DEACTIVATE method to deactivate the account budget:\n\n```\nCALL SNOWFLAKE.LOCAL.ACCOUNT_ROOT_BUDGET ! DEACTIVATE ();\n```\n\nCopy\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Activating the account budget\n2. Create a custom role to manage the account budget\n3. Use Snowsight to activate the account budget\n4. Use SQL commands to activate the account budget\n5. Deactivating the account budget\n6. Use Snowsight to deactivate the account budget\n7. Use SQL commands to deactivate the account budget\n\nRelated content\n\n1. Monitor credit usage with budgets"
      ],
      "full_content": null
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor",
      "title": "CREATE RESOURCE MONITOR | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Reference SQL command reference Virtual warehouses & resource monitors CREATE RESOURCE MONITOR\n\n# CREATE RESOURCE MONITOR ¶\n\nCreates a new resource monitor . This command can only be executed by account administrators.\n\nSee also:\n    ALTER RESOURCE MONITOR , DROP RESOURCE MONITOR , SHOW RESOURCE MONITORS , ALTER WAREHOUSE , ALTER ACCOUNT\n\n## Syntax ¶\n\n```\nCREATE [ OR REPLACE ] RESOURCE MONITOR [ IF NOT EXISTS ] <name> WITH \n                      [ CREDIT_QUOTA = <number> ] \n                      [ FREQUENCY = { MONTHLY | DAILY | WEEKLY | YEARLY | NEVER } ] \n                      [ START_TIMESTAMP = { <timestamp> | IMMEDIATELY } ] \n                      [ END_TIMESTAMP = <timestamp> ] \n                      [ NOTIFY_USERS = ( <user_name> [ , <user_name> , ... ] ) ] \n                      [ TRIGGERS triggerDefinition [ triggerDefinition ... ] ]\n```\n\nCopy\n\nWhere:\n\n> ```\n> triggerDefinition ::= \n>     ON <threshold> PERCENT DO { SUSPEND | SUSPEND_IMMEDIATE | NOTIFY }\n> ```\n> \n> Copy\n> \n>\n\n## Required parameters ¶\n\n`_name_`\n    Identifier for the resource monitor; must be unique for your account.\n\nThe identifier must start with an alphabetic character and cannot contain spaces or special characters unless the entire identifier string\nis enclosed in double quotes (e.g. `\"My object\"` ). Identifiers enclosed in double quotes are also case-sensitive.\n\nFor more details, see Identifier requirements .\n\n## Optional parameters ¶\n\n`CREDIT_QUOTA = _num_`\n    The number of credits allocated to the resource monitor per frequency interval. When total usage for all warehouses assigned to the\nmonitor reaches this number for the current frequency interval, the resource monitor is considered to be at 100% of quota.\n\nIf a value is not specified for a resource monitor, the monitor has no quota and will never reach 100% usage within the specified interval.\n\nDefault: No value (i.e. no credit quota) `FREQUENCY = MONTHLY | DAILY | WEEKLY | YEARLY | NEVER`\n    The frequency interval at which the credit usage resets to `0` .\n\nIf you set a frequency for a resource monitor, you must also set `START_TIMESTAMP` .\n\nIf you specify `NEVER` for the frequency, the credit usage for the warehouse does not reset.\n\nDefault: No value (i.e. legacy behavior, whereby the credit quota resets at the beginning of each calendar month) `START_TIMESTAMP = _timestamp_ | IMMEDIATELY`\n    The date and time when the resource monitor starts monitoring credit usage for the assigned warehouses.\n\nIf you set a timestamp for a resource monitor, you must also set `FREQUENCY` .\n\nIf you specify `IMMEDIATELY` for the start timestamp, the current timestamp is used.\n\nIf you specify a date without a time, the current time is used.\n\nIf you set a time without specifying a time zone, UTC is used as the default time zone.\n\nDefault: No value (i.e. legacy behavior, whereby the resource monitor starts monitoring warehouses immediately) `END_TIMESTAMP = _timestamp_`\n    The date and time when the resource monitor suspends the assigned warehouses.\n\nDefault: No value (i.e. no warehouse suspension date) `NOTIFY_USERS = ( _user_name_ [ , _user_name_ , ... ] )`\n    Specifies the list of users to receive email notifications on resource monitors. If a user identifier includes spaces or special\ncharacters or is case-sensitive, then the identifier must be enclosed in double quotes (e.g. “Mary Smith”). See Identifier requirements for details.\n\nThe user identifier, `_user_name_` , is the value of the `name` column from the output of SHOW USERS .\n\nEach user listed must have a verified email address. For instructions on verifying email addresses in the web interface, see Verify your email address .\n\nEmail notifications for non-administrator users do not supersede email notifications for administrators. Any account administrators that\nhave enabled email notifications will continue to receive email notifications.\n\nNote\n\n* The following limitations apply for non-administrator users:\n  \n    + Non-administrator users can only receive notifications for warehouse monitors .\n    + Non-administrator users are notified by email but can’t see notifications in Snowsight.\n    + Non-administrator users can’t create resource monitors.\n    + Non-administrator users can’t assign other users to be notified. `TRIGGERS ...` (aka _actions_ )\n    Specifies one or more triggers for the resource monitor. Each trigger definition consists of the following:\n\n> `ON _threshold_ PERCENT`\n>     A numeric value specified as a percentage of the credit quota for the resource monitor; values larger than `100` are supported.\n> Once usage reaches this threshold for the current frequency interval, the trigger fires. `DO SUSPEND | SUSPEND_IMMEDIATE | NOTIFY`\n>     Specifies the action performed by the trigger when the threshold is reached:\n> \n> * `SUSPEND` : Suspend all assigned warehouses while allowing currently running queries to complete. No new queries can be executed\n>   by the warehouses until the credit quota for the resource monitor is increased. In addition, this action sends a notification to all\n>   users who have enabled notifications for themselves.\n> * `SUSPEND_IMMEDIATE` : Suspend all assigned warehouses immediately and cancel any currently running queries or statements using\n>   the warehouses. In addition, this action sends a notification to all users who have enabled notifications for themselves.\n> * `NOTIFY` : Send a notification (to all account administrators with notifications enabled), but do not take any other action.\n> \n> \n\nDefault: No value (i.e. resource monitor performs no actions)\n\n## Usage notes ¶\n\n* Triggers are optional; however, at least one trigger must be added to a resource monitor before it can perform any actions.\n* Each resource monitor supports up to a maximum of 5 `NOTIFY` action triggers.\n* After a resource monitor is created, it must be assigned to a warehouse or account before it can perform any monitoring actions:\n  \n    + To assign a warehouse to a resource monitor, use ALTER WAREHOUSE (or CREATE WAREHOUSE if you are creating the warehouse).\n    + To assign a resource monitor at the account level, use ALTER ACCOUNT . The NOTIFY\\_USERS parameter must be null.\n* To view all resource monitors created in your account and their assignment, use the SHOW RESOURCE MONITORS command. The command\n  output displays `NULL` in the `level` column for resource monitors that are not assigned to the account or any warehouses\n  and, therefore, are not monitoring any credit usage.\n* If `frequency` and `start_timestamp` parameters are set on a resource monitor, the day for the credit usage reset is\n  calculated based on those parameters. The time the credit usage resets to `0` is 12:00 AM UTC regardless of the time specified in `start_timestamp` .\n* If you specify an `end_timestamp` , monitoring ends at that specified date and time and all assigned warehouses are suspended\n  at that date and time even if the credit quota has not been reached.\n  \n  When this occurs, a notification is sent that states the resource monitor has reached a percentage of its quota and has triggered a\n  suspend immediate action. The percentage of the quota reflects the number of credits used in the current interval up to the end date\n  and might not be a threshold you specified.\n* If there are non-administrator users in the notification list, the following notes apply:\n  \n    + If any user in the notification list does not have a verified email ,\n        the SQL statement fails.\n    + If any user in the notification list changes their email address and does not verify the new email address, the\n        notification silently fails.\n    + The notification list is limited to a maximum number of 5 non-administrator users.\n    + Account administrators can view the notification list of non-administrator users in the output of SHOW RESOURCE MONITORS in the `notify_user` column.\n* Regarding metadata:\n  \n  Attention\n  \n  Customers should ensure that no personal data (other than for a User object), sensitive data, export-controlled data, or other regulated data is entered as metadata when using the Snowflake service. For more information, see Metadata fields in Snowflake .\n\n* The OR REPLACE and IF NOT EXISTS clauses are mutually exclusive. They can’t both be used in the same statement.\n* CREATE OR REPLACE _<object>_ statements are atomic. That is, when an object is replaced, the old object is deleted and the new object is created in a single transaction.\n\nImportant\n\nTo receive notifications generated by resource monitors, account administrators and non-administrator users in the notification\nlist must explicitly enable notifications in their preferences. In addition, to receive email notifications, users must have a\nverified email in their preferences. Preferences can only\nbe set in the Snowflake web interface. For more information, see Enabling receipt of notifications .\n\n## Examples ¶\n\nCreate a resource monitor named `limiter` with 3 triggers:\n\n> ```\n> CREATE OR REPLACE RESOURCE MONITOR limiter \n>   WITH CREDIT_QUOTA = 5000 \n>   TRIGGERS ON 75 PERCENT DO NOTIFY \n>            ON 100 PERCENT DO SUSPEND \n>            ON 110 PERCENT DO SUSPEND_IMMEDIATE ;\n> ```\n> \n> Copy\n> \n> \n\nCreate a resource monitor to send notifications to three users when 75% of the credit quota is reached. In this example, the `_user_name_` for two of the users includes a space and must be enclosed in double quotes:\n\n> ```\n> CREATE OR REPLACE RESOURCE MONITOR limiter \n>   WITH CREDIT_QUOTA = 5000 \n>        NOTIFY_USERS = ( JDOE , \"Jane Smith\" , \"John Doe\" ) \n>   TRIGGERS ON 75 PERCENT DO NOTIFY \n>            ON 100 PERCENT DO SUSPEND \n>            ON 110 PERCENT DO SUSPEND_IMMEDIATE ;\n> ```\n> \n> Copy\n> \n>\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Syntax\n2. Required parameters\n3. Optional parameters\n4. Usage notes\n5. Examples\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nReject All Allow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"
      ],
      "full_content": null
    },
    {
      "url": "https://www.flexera.com/blog/finops/snowflake-resource-monitors/",
      "title": "Snowflake resource monitors 101: A comprehensive guide (2026)",
      "publish_date": "2026-01-27",
      "excerpts": [
        "Flexera Open Primary Navigation\n\n* Solutions\n  \n  Spend management by vendor\n  \n  [Flexera is a Leader in 2025 cloud financial management tools](https://info.flexera.com/CM-REPORT-Gartner-Magic-Quadrant-Cloud-Financial-Management-Tools)\n  \n  Discover recognized CFM vendors to watch in the 2025 Gartner® Magic Quadrant™\n  \n  [View report](https://info.flexera.com/CM-REPORT-Gartner-Magic-Quadrant-Cloud-Financial-Management-Tools)\n* Products\n  \n  Flexera One\n  \n    + IT Visibility\n    + ITAM\n    + Snow Atlas\n    + Cloud License Management\n    + SaaS Management\n  \n    + FinOps\n    + Cloud Cost Optimization\n    + Cloud Commitment Management\n    + Container Optimization\n    + Virtual Machine Optimization\n    + Data Cloud Optimization\n  \n    + Application Readiness\n    + Security\n    + Integrations\n    + Technology Intelligence Platform\n    + All Products\n  \n  [Introducing Flexera One SaaS Management](https://www.flexera.com/products/flexera-one/saas-management)\n  \n  Discover comprehensive SaaS visibility for taming SaaS sprawl, wasted spend and compliance risks.\n  \n  [Book your personalized demo](https://www.flexera.com/products/flexera-one/saas-management)\n* Success\n  \n  Customer Success\n  \n  Services & Training\n  \n    + Services\n    + Training\n  \n  Support\n  \n    + [Flexera support portal](https://community.flexera.com/s/support-hub)\n    + [Flexera product documentation](https://docs.flexera.com)\n    + [Snow product documentation](https://docs.snowsoftware.io/)\n  \n    + Technology Intelligence Awards\n    + [Flexera community](https://community.flexera.com/s/)\n  \n  [2025 Technology Intelligence Awards](https://info.flexera.com/ITAM-REPORT-State-of-IT-Asset-Management)\n  \n  The results are in—see how our 2025 winners and honorable mentions are shaping the future of Technology Intelligence.\n  \n  [See the winners](https://www.flexera.com/customer-success/awards)\n* Resources\n  \n  Resources\n  \n    + Webinars\n    + Videos\n    + Datasheets\n    + Whitepapers & reports\n  \n    + Blog\n    + Case studies\n    + Events\n    + Analyst research\n    + Glossary\n    + Demos & trials\n    + Business value calculator\n  \n  [Flexera 2026 IT Priorities Report](https://www.flexera.com/resources/reports/ITV-REPORT-IT-Priorities)\n  \n  AI ROI, sustainability, cost and risk: Discover the latest IT trends shaping tomorrow’s IT landscape in Flexera’s 2026 IT Priorities Report.\n  \n  [View report](https://www.flexera.com/resources/reports/ITV-REPORT-IT-Priorities)\n* About\n  \n  Company\n  \n    + About\n    + Careers\n    + Contact us\n    + Leadership\n  \n  Partners\n  \n    + Partner program\n    + Partner locator\n  \n  Press center\n  \n    + Press releases\n    + Articles\n    + Awards\n  \n  Social responsibility\n  \n    + ESG\n    + Belonging and inclusion\n  \n  [The Flexera 2025 State of the Cloud Report](https://info.flexera.com/CM-REPORT-State-of-the-Cloud)\n  \n  How are GenAI rising cloud costs, security and sustainability shaping your cloud strategies in 2025?\n  \n  [View report](https://info.flexera.com/CM-REPORT-State-of-the-Cloud)\n\nCustomers Open External Links\n\n* [Community](https://community.flexera.com/)\n* [Product login](https://app.flexera.com/login)\n* [Spot login](https://console.spotinst.com/auth/signIn)\n* [Partner Portal](https://partnerhub.flexera.com/)\n\nSearch\n\nBook a demo\n\n1. Home\n2. Blog\n3. [FinOps](https://www.flexera.com/blog/finops/)\n4. Snowflake resource monitors 101: A comprehensive guide (2026)\n\n### [FinOps](https://www.flexera.com/blog/finops/)\n\nSubscribe\n\nTopics\n\nSaaS Management FinOps IT Visibility IT Asset Management Product News Application Readiness Security Perspectives\n\n[FinOps](https://www.flexera.com/blog/finops/)\n\n# Snowflake resource monitors 101: A comprehensive guide (2026)\n\n[](https://www.flexera.com/blog/author/pramit/ \"Pramit Marattha\")\n\n[Pramit Marattha](https://www.flexera.com/blog/author/pramit/ \"Pramit Marattha\")\n\n[](https://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.flexera.com%2Fblog%2Ffinops%2Fsnowflake-resource-monitors%2F&title=Snowflake%20resource%20monitors%20101%3A%20A%20comprehensive%20guide%20%282026%29&source=https%3A%2F%2Fwww.flexera.com%2Fblog%2Ffinops%2Fsnowflake-resource-monitors%2F) [](https://twitter.com/intent/tweet?source=https%3A%2F%2Fwww.flexera.com%2Fblog%2Ffinops%2Fsnowflake-resource-monitors%2F&text=Snowflake%20resource%20monitors%20101%3A%20A%20comprehensive%20guide%20%282026%29%20https%3A%2F%2Fwww.flexera.com%2Fblog%2Ffinops%2Fsnowflake-resource-monitors%2F) \n\nThis post originally appeared on the chaosgenius.io blog. Chaos Genius has been [acquired by Flexera](https://www.flexera.com/more/ProsperOps-Chaos-Genius) .\n\nSnowflake Resource Monitors is a powerful feature that helps in Snowflake monitoring and avoid unexpected credit usage . It’s the only official monitoring tool from Snowflake that lets you monitor your credit consumption and control your warehouses, making it essential for Snowflake users.\n\nIn this article, we’ll explain how the Snowflake Resource Monitors work, how to set it up, how to customize notifications and define actions—and much more!!\n\n## What is Snowflake Resource Monitors?\n\nSnowflake Resource Monitors is a feature in Snowflake that helps you manage and control Snowflake costs. It allows you to monitor and set limits on your compute resources, so you can avoid overspending and potentially going over your budget. By setting up Resource Monitors, you can define actions to be taken when usage thresholds are exceeded, such as sending alerts or suspending warehouses. This gives you more control over your Snowflake data warehouse and helps you stay within your budget.\n\n## What Features Do Snowflake Resource Monitors Offer?\n\nSnowflake Resource Monitors is a great feature for anyone using Snowflake. It offers a wealth of features that can help you better monitor and manage your Snowflake workloads and resources, giving you more control over your Snowflake environment.\n\nSome of the important features of the Snowflake Resource Monitors are:\n\n**1) Credit usage monitoring**\n\nSnowflake Resource Monitors allows you to monitor your credit usage in real-time, so you can stay updated on your account’s resource consumption.\n\n**2) Multiple levels of control**\n\nSnowflake Resource Monitors can be set at the account level or warehouse level, giving users high flexibility and control over their resources.\n\n**3) Credit quota management**\n\nSnowflake Resource Monitors allows you to set credit quotas for specific warehouses and even for the entire account to help you stay within your budget and avoid unexpected Snowflake costs.\n\n**4) Custom notification + alerting**\n\nResource Monitors can be customized to send notifications and alerts to users when credit usage reaches specific thresholds.\n\n**5) Custom Actions**\n\nResource Monitors allows you to configure custom actions that can be triggered when credit usage is exceeded (such as by suspending a warehouse or sending an alert).\n\n## How to setup Snowflake Resource Monitors using Snowflake Web UI?\n\nSetting up Snowflake Resource Monitors is a straightforward process. To make one in Snowflake, follow the steps outlined below:\n\nSnowflake login page\n\n### **Step 2** : Navigate to the Snowflake Resource Monitors page\n\nOnce you have logged in to Snowflake Web UI, navigate to the Resource Monitors page. You can find this page under the “ **Admin** ” tab.\n\nAdmin section and Usage dropdown\n\n### Step 3: Click on the “ **\\+Resource Monitors** ” button\n\nUnder “Admin”, select “ **Resource Monitors** ” and then click “ **\\+Resource Monitors** “.\n\nResource Monitor dashboard\n\nYou will now see a “ **New Resource Monitor** ” window. In this window, you can set the Resource Monitor’s name, the Resource Monitor’s frequency( **credit quota** ), the credit usage threshold and the actions to be taken when the credit usage threshold is exceeded.\n\nNew Resource Monitor configuration\n\n### Step 4: Configure the **Credit Quota** property\n\nInside the “ **New Resource Monitor** ” popup window, configure the Credit Quota property. This is the number of credits that are allowed to be consumed in a given interval of time during which the Resource Monitor takes action.\n\nCredit Quota\n\n### Step 5: Configure the **Monitor Type** property\n\nNext, let’s configure the Monitor Type property. The Snowflake Resource Monitor can monitor credit usage at the **Account** and **Warehouse** levels. If you have selected the **Account** level, the Resource Monitors will monitor the credit usage for your entire account (i.e., all warehouses in the account) and if you select the **Monitor** **Type** as **Warehouse** level, you need to individually select the warehouses to monitor.\n\n#### **Account level**\n\nAccount level monitor\n\n**Warehouse level**\n\nWarehouse level monitor\n\n### Step 6: Configure the **Schedule** property\n\nNow that you have configured the **Monitor Type** property, let’s configure the **Schedule** property. By default, the scheduling of the Resource Monitor is set to begin monitoring immediately and reset back the credit usage to 0 at the beginning of each calendar month. However, you can customize the scheduling of the Resource Monitor to your needs.\n\n* **Time Zone** : You have two options to set the schedule’s time zone: Local and UTC.\n* **Starts:** You can start the Resource Monitor immediately or later. If you choose Later, you should enter the date and time for the Resource Monitor to start.\n* **Resets:** You can choose the frequency interval at which the credit usage resets. The supported values are Daily, Weekly, Monthly, Yearly and Never.\n* **Ends:** You can run the Resource Monitor continuously by selecting the “never” reset option, or you can set it to stop at a certain date and time.\n\nCustomize Resource Monitor schedule\n\n### Step 7: Configure the **Actions** property\n\nNow that you have set up the basic properties of your Resource Monitor, it’s time to define the **Actions** property that will be taken when the credit usage threshold gets exceeded. As you can see in the screenshot below, In the Actions property, there are three types of actions that Resource Monitors provide by default:\n\nResource Monitors actions configuration\n\nResource Monitors actions configuration\n\n* **Suspend Immediately** : This action suspends all the assigned warehouses immediately, which cancels any query statements being executed by the warehouses at that time.\n* **Suspend and notify** : This action suspends all the assigned warehouses after all statements being executed by the warehouse(s) have been completed and then sends an alert notification to the users.\n* **Notify** : This action sends an alert notification to all users with notifications enabled.\n\n> **Note** : You can define up to three actions for a Resource Monitor, which include one **Suspend and Notify** action, one **Suspend Immediately** action and up to five custom **Notify** actions. Resource Monitor must have at least one action defined. If no actions have been defined, you won’t be able to create your Resource Monitor.\n> \n> \n\n### Step 8: Create the **Resource Monitor**\n\nAs you can see in the screenshot below, we have successfully configured the Resource Monitor. So, once you’ve configured it, click the “ **Create Resource Monitor** ” button to create it. As you can see, we created a Snowflake Resource Monitor with the name “ **ResourceMonitor\\_DEMO** ,” a Credit Quota of “ **200** ” at the warehouse level, one warehouse configured with the default schedule, Suspend Immediately and Notify action set to trigger at 80% of credit usage, Suspend and Notify action set to trigger at **75%** of credit usage and Finally Notify action set to trigger at **50%** & **60%** of credit usage.\n\nResource Monitors configuration Resource Monitor dashboard\n\n## How to create a Snowflake Resource Monitors using SQL query?\n\nCreating Snowflake Resource Monitors using SQL query is straightforward, so to do that, Snowflake provides the following DDL commands for creating and using/managing Resource Monitors: [CREATE Resource Monitors](https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor.html) , [ALTER Resource Monitors](https://docs.snowflake.com/en/sql-reference/sql/alter-resource-monitor.html) , [SHOW Resource MonitorsS](https://docs.snowflake.com/en/sql-reference/sql/show-resource-monitors.html) and [DROP Resource Monitors](https://docs.snowflake.com/en/sql-reference/sql/drop-resource-monitor.html) . However, for this article’s purpose, we will be focusing on creating only.\n\n```\nCREATE Resource Monitors \"ResourceMonitor_DEMO2\" WITH CREDIT_QUOTA = 300\nTRIGGERS\n ON 80 PERCENT DO SUSPEND\n ON 75 PERCENT DO SUSPEND_IMMEDIATE\n ON 60 PERCENT DO NOTIFY\n ON 50 PERCENT DO NOTIFY;\n```\n\nThis query creates a Resource Monitor named “ **ResourceMonitor\\_DEMO2** ” with a credit quota of **300** and sets triggers for suspend and suspend immediate actions at **80** and **75** percent usage, respectively. The monitor also includes a trigger for a notify action at **60 and 50** percent of usage respectively.\n\nCreate Resource Monitor\n\nOnce the query has been executed, navigate back to the Resource Monitors page. There, should see the newly created Resource Monitor, which will be in an active state.\n\nResource Monitor dashboard\n\n**How to Assign Warehouses to Resource Monitors?**\n\nOnce you have successfully created Snowflake Resource Monitors using SQL, warehouses can be easily assigned by using the following SQL query\n\n```\nALTER WAREHOUSE \"COMPUTE_WH\" SET RESOURCE_MONITOR =\"ResourceMonitor_DEMO2\";\n```\n\nAssign warehouse to Resource Monitors\n\nYou can even configure and set your Resource Monitors to **Account** level; for that, execute the following SQL query.\n\n```\nALTER ACCOUNT SET RESOURCE_MONITOR = ResourceMonitor_DEMO2;\n```\n\n### **How to enable Notification Alerts for Account admin?**\n\nAccount administrators can receive notifications via the web interface or via email. Notifications are not enabled by default. It must be enabled manually, so follow the steps outlined below.\n\n* Use the **ACCOUNTADMIN** role. If you are not already in this role, you can switch to it by clicking on the drop-down menu next to your name in the upper-right corner, selecting “ **Switch role** ” and then selecting “ **ACCOUNTADMIN** ” from the list.\n\nUser profile role\n\n* In the same drop-down menu, select **Profile** > Toggle **Notifications** .\n\nToggle notifications\n\n**How to enable Notification Alerts for Non-Admin Accounts?**\n\nEnabling email notifications for non-admin users can only be done through SQL statements(It’s not possible via the web interface). Use the SQL command shown below to trigger a notification for Non-admin accounts:\n\n```\nCREATE Resource Monitors \"ResourceMonitor_ALERT\" WITH CREDIT_QUOTA = 300\n NOTIFY_USERS = ('USER_NAME')\n TRIGGERS\n ON 80 PERCENT DO SUSPEND\n ON 75 PERCENT DO SUSPEND_IMMEDIATE\n ON 60 PERCENT DO NOTIFY\n ON 50 PERCENT DO NOTIFY;\n```\n\nTo view the list of users with access to email alerts for Resource Monitors, use the following SQL command.\n\n```\nSHOW Resource Monitors\n```\n\nEnable notifications alert for Non-admin\n\n## Conclusion\n\nSnowflake Resource Monitors is an invaluable feature for any Snowflake user who wants to gain better control over their costs. The setup process is straightforward; this article explains how to create a Resource Monitor, what it does and how to set up notifications and trigger actions. With the Snowflake Resource Monitors in place, you don’t have to worry about unexpected Snowflake costs. Get started on your Snowflake Monitoring journey today!\n\nIn this article, we have covered:\n\n* What is Snowflake Resource Monitor?\n* Features of Snowflake Resource Monitors\n* Step-by-step Guide to Setup Snowflake Resource Monitors using Snowflake Web UI\n* Step-by-step Guide to Setup Snowflake Resource Monitors using SQL Query\n\n… and so much more!\n\n## FAQs\n\n**How does Snowflake Resource Monitors help control Snowflake costs?**\n\nSnowflake Resource Monitors helps you manage and control Snowflake costs. It allows you to monitor and set limits on your compute resources, so you can avoid overspending and potentially going over your budget.\n\n**How to setup resource monitor in Snowflake using Snowflake Web UI?**\n\nTo set up Snowflake Resource Monitors using Snowflake Web UI, log in, navigate to the Resource Monitors page under the Admin tab and click on the “+Resource Monitors” button.\n\n**What are the steps to configure a Resource Monitor’s credit quota and schedule?**\n\nTo configure a Resource Monitor’s credit quota and schedule, specify the desired values in the New Resource Monitor window, including credit quota, monitor type (account or warehouse level) and schedule properties.\n\n**Can I define custom actions for Snowflake Resource Monitors?**\n\nYes, Snowflake Resource Monitors allow you to define custom actions to be taken when credit usage thresholds are exceeded, such as suspending warehouses or sending alerts.\n\n**Can I create Snowflake Resource Monitors using SQL queries?**\n\nYes, Snowflake Resource Monitors can be created using SQL queries, using this simple query:\n\n```\nCREATE Resource Monitors \"ResourceMonitor_DEMO\" WITH CREDIT_QUOTA = 300\nTRIGGERS\n ON 80 PERCENT DO SUSPEND\n ON 75 PERCENT DO SUSPEND_IMMEDIATE\n ON 60 PERCENT DO NOTIFY\n ON 50 PERCENT DO NOTIFY;\n```\n\n**Can Resource Monitors be set at both the account and warehouse levels?**\n\nYes, Resource Monitors can be set at both the account and warehouse levels, providing flexibility and control over resource management.\n\n**Which schema has the resource monitor view in Snowflake?**\n\nThis Account Usage view displays the resource monitors that have been created in the reader accounts managed by the account. This view is only available in the READER\\_ACCOUNT\\_USAGE schema.\n\nRelated posts:\n\n* [Optimize cloud costs: Using automation to avoid waste](https://www.flexera.com/blog/finops/optimize-cloud-costs-using-automation-to-avoid-waste/ \"Optimize cloud costs: Using automation to avoid waste\")\n* [Understanding End of Life (EOL) and End of Support (EOS): A comprehensive guide](https://www.flexera.com/blog/it-visibility/understanding-end-of-life-eol-and-end-of-support-eos-a-comprehensive-guide/ \"Understanding End of Life (EOL) and End of Support (EOS): A comprehensive guide\")\n* [AWS cost optimization tools and tips: Ultimate guide [2025]](https://www.flexera.com/blog/finops/aws-cost-optimization-8-tools-and-tips-to-reduce-your-cloud-costs/ \"AWS cost optimization tools and tips: Ultimate guide [2025]\")\n\n### Want to know more?\n\nTechnology is evolving rapidly—and it's important to stay on top of the latest trends and critical insights. Check out the latest blogs related to FinOps below.\n\nFinOps\n\n## [2025 State of the Cloud](https://info.flexera.com/CM-REPORT-State-of-the-Cloud?lead_source=Website%20Visitor&id=Blog-Resources \"2025 State of the Cloud\")\n\nMarch 12, 2024\n\nFinOps\n\n## [Cloud Cost Optimization demo](https://info.flexera.com/CM-DEMO-Cloud-Cost-Optimization-Request \"Cloud Cost Optimization demo\")\n\nFebruary 22, 2023\n\nFinOps\n\n## [Practical Guide for a Successful Cloud Journey](https://info.flexera.com/CM-GUIDE-Successful-Cloud-Journey?lead_source=Website%20Visitor&id=Blog-Resources \"Practical Guide for a Successful Cloud Journey\")\n\nFebruary 9, 2022\n\nFinOps\n\n## [Cloud Migration and Modernization Datasheet](https://www.flexera.com/sites/default/files/datasheet-foundation-cloudscape.pdf \"Cloud Migration and Modernization Datasheet\")\n\nFinOps\n\n## [Agentic FinOps for AI: autonomous optimization for Snowflake, Databricks and AI cloud costs](https://www.flexera.com/blog/finops/agentic-finops-for-ai-autonomous-optimization-for-snowflake-databricks-and-ai-cloud-costs/ \"Agentic FinOps for AI: autonomous optimization for Snowflake, Databricks and AI cloud costs\")\n\nFebruary 12, 2026\n\nFinOps\n\n## [Snowflake BUILD 2025: Quick recap of new features](https://www.flexera.com/blog/finops/snowflake-build-2025/ \"Snowflake BUILD 2025: Quick recap of new features\")\n\nJanuary 28, 2026\n\n×\n\nGet updates delivered to your inbox\n\nSubscribe\n\n## How can we help?\n\nSales Team\n\n[Community](https://community.flexera.com/s/)\n\nSubscribe\n\nFlexera\n\n* [](https://www.linkedin.com/company/flexera?elqTrackId=62e00a6465d449b0824c83c70706dff9&elq=00000000000000000000000000000000&elqaid=6833&elqat=2&elqCampaignId=&elqcst=272&elqcsid=143 \"LinkedIn\")\n* [](https://twitter.com/flexera?elqTrackId=ab8f06bd7aea498e807592d19ac2ab00&elq=00000000000000000000000000000000&elqaid=6833&elqat=2&elqCampaignId=&elqcst=272&elqcsid=143 \"Twitter\")\n* [](https://www.instagram.com/weareflexera?elqTrackId=fcfa0064605a42baaebfabe8fedd5c50&elq=00000000000000000000000000000000&elqaid=6833&elqat=2&elqCampaignId=&elqcst=272&elqcsid=143 \"Instagram\")\n* [](https://www.youtube.com/user/FlexeraSoftware?elqTrackId=c6e9107020754655a13aca3ac7aa3cd4&elq=00000000000000000000000000000000&elqaid=6833&elqat=2&elqCampaignId=&elqcst=272&elqcsid=143 \"YouTube\")\n\n* Privacy policy\n* Terms and conditions\n* Site map"
      ],
      "full_content": null
    },
    {
      "url": "https://docs.snowflake.com/en/user-guide/resource-monitors",
      "title": "Working with resource monitors | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "[DOCUMENTATION](https://docs.snowflake.com)\n\n/\n\nGet started\n\nGuides\n\nDeveloper\n\nReference\n\nRelease notes\n\nTutorials\n\n[Status](https://status.snowflake.com)\n\nGuides Cost & Billing Control Resource monitors\n\n# Working with resource monitors ¶\n\nA _resource monitor_ can help control costs and avoid unexpected credit usage caused by running warehouses. A virtual warehouse consumes Snowflake credits while it runs. You can use a resource monitor\nto monitor credit usage by virtual warehouses and the cloud services needed to support those warehouses. You can also set up a resource\nmonitor to suspend a user-managed virtual warehouse when it reaches a credit limit.\n\nImportant\n\nResource monitors work for warehouses only. You can’t use a resource monitor to track spending associated with serverless\nfeatures and AI services. To monitor credit consumption by these features, use a budget instead.\n\nThe number of credits consumed depends on the size of the warehouse and how long it runs. For more information on warehouse credit usage,\nsee Virtual warehouse credit usage .\n\nCredit usage limits can be set for a specified interval or date range. When a limit is reached and/or reaches a specified threshold,\nthe resource monitor can trigger various actions, such as sending alert notifications and/or suspending user-managed warehouses.\n\nOnly users with the ACCOUNTADMIN role can create a resource monitor, but an account administrator can grant privileges to other roles\nto allow other users to view and modify resource monitors.\n\n## Resource monitor properties ¶\n\nA resource monitor is a first-class object in Snowflake, consisting of the following properties:\n\n### Credit quota ¶\n\nCredit quota specifies the number of Snowflake credits allocated to the monitor for the specified frequency interval. Any number can be specified.\n\nIn addition, Snowflake tracks the _used credits/quota_ within the specified frequency interval by all warehouses assigned to the monitor.\nAt the specified interval, this number resets to `0` .\n\nCredit quota accounts for credits consumed by both user-managed virtual warehouses and virtual warehouses used by cloud services.\n\nFor example, your resource monitor limit is set at 1000 credits. If your warehouse consumes 700 credits, and cloud services consume 300\ncredits within a specified interval or date range, an alert will be triggered.\n\nNote\n\nResource monitor limits do not take into account the daily 10% adjustment for cloud services. Snowflake uses all credit consumption by\nthe cloud services layer to calculate whether a limit has been reached, even if that consumption is never billed. For more information\nabout how cloud services credits and adjustments are calculated, see Understanding billing for cloud services usage .\n\nFor instructions on how to view your cloud services credit usage, see Exploring compute cost .\n\n### Monitor type ¶\n\nThis property specifies whether the resource monitor is used to monitor your account or a specific set of individual warehouses:\n\n* An _account monitor_ monitors the credit usage of all the warehouses in the account. An account can only have one account monitor.\n* A _warehouse monitor_ monitors the credit usage of the warehouses assigned to the resource monitor. An account can have multiple\n  warehouse monitors.\n  \n  A warehouse monitor can have one or more warehouses assigned to it, but each warehouse can only be assigned to one resource monitor.\n\nIf this property is not set, the resource monitor doesn’t monitor any credit usage. It simply remains dormant.\n\nFor more information, see Assignment of resource monitors .\n\n### Schedule ¶\n\nThe default schedule for a resource monitor specifies that it starts monitoring credit usage immediately and the used credits reset to `0` at the beginning of each calendar month (i.e. the start of the standard Snowflake billing cycle).\n\nHowever, you can optionally customize the schedule for a resource monitor using the following properties:\n\nFrequency :\n    The interval at which the used credits reset relative to the specified start date.\n\nSupported values:\n\n* Daily\n* Weekly\n* Monthly\n* Yearly\n* Never (used credits never reset; assigned warehouses continue using credits until the credit quota is reached)\n\nStart :\n    Date and time (i.e. timestamp) when the resource monitor starts monitoring the assigned warehouses.\n\nSupported values:\n\n* Immediately (i.e. current timestamp)\n* Later (i.e. any future timestamp)\n\nIn addition, Snowflake uses this date to determine when to reset the used credits, based on the specified frequency. Note, however, that\nregardless of the time specified in the start date and time, resource monitors reset at 12:00 AM UTC. For example, if the start is\n15-July-2019 (Monday) at 8:00 AM:\n\n* Frequency = Monthly: Used credits reset at 12:00 AM UTC on the 15th of each following month.\n* Frequency = Weekly: Used credits reset at 12:00 AM UTC on each following Monday.\n\nNote that, if you specify the last day of a month as the start date, Snowflake resets the used credits on the last day of all following\nmonths, regardless of the number of days in the month. For example, if you set the start date to January 31, Snowflake subsequently resets\nthe used credits for the resource monitor on February 28 (or February 29 in a leap year), March 31, April 30, and so on.\nEnd :\n    Date and time (i.e. timestamp) when Snowflake suspends the warehouses associated with the resource monitor, regardless of whether the\nused credits reached any of the thresholds defined for the resource monitor’s actions (see the next section in this topic).\n\nSupported values: Any future timestamp.\n\nNote that this property is not commonly used.\n\nImportant\n\nIf you choose to customize the schedule for a resource monitor, the frequency is relative to the specified start date, which is\ndifferent than the default schedule.\n\nAlso, if you specify a frequency, you must also specify a start date and time, and vice versa (i.e. you cannot set one without setting the\nother).\n\n### Actions ¶\n\nAlso referred to as _triggers_ , each action specifies a threshold, as a percentage of the credit quota for the resource monitor, and the\naction to perform when the threshold is reached within the specified interval. Note that actions support thresholds greater than `100` .\n\nResource monitors support the following actions:\n\nNotify & Suspend :\n    Send a notification and suspend all assigned warehouses after all statements being executed by the warehouse(s) have completed.\nNotify & Suspend Immediately :\n    Send a notification and suspend all assigned warehouses immediately, which cancels any statements being executed by the warehouses\nat the time.\nNotify :\n    Perform no action on warehouses, but send a notification.\n\nNotifications are sent to all account administrators with notifications enabled. Email notifications for resource monitors that monitor\nwarehouses are also sent to any non-administrator user that is enabled to receive those notifications.\n\nNote\n\nNon-administrator users can only receive email notifications for _warehouse_ monitors.\n\nEach resource monitor can have the following actions:\n\n* One **Suspend** action.\n* One **Suspend Immediate** action.\n* Up to five **Notify** actions.\n\nNote\n\nA resource monitor must have at least one action defined; if no actions have been defined, nothing happens when the used credits reach\nthe threshold.\n\n## Assignment of resource monitors ¶\n\nA single monitor can be set at the account level to control credit usage for all warehouses in your account.\n\nIn addition, a one or more warehouses can be assigned to a resource monitor, thereby controlling the credit usage for each assigned\nwarehouse. Note, however, that a warehouse can be assigned to only a single resource monitor below the account level.\n\nThe following diagram illustrates a scenario in which one resource monitor is set at the account level and individual warehouses are\nassigned to two other resource monitors:\n\nBased on this diagram:\n\n* The credit quota for the entire account is 5000 for the interval (month, week, etc.), as controlled by Resource Monitor 1; if this quota\n  is reached within the interval, the actions defined for the resource monitor ( **Suspend** , **Suspend Immediate** , etc.) are enforced for\n  all five warehouses.\n* Warehouse 3 can consume a maximum of 1000 credits within the interval.\n* Warehouse 4 and 5 can consume a maximum combined total of 2500 credits within the interval.\n\nNote that the actual credits consumed by Warehouses 3, 4, and 5 may be less than their quotas if the quota for the account is reached first.\n\nImportant\n\n* An account-level resource monitor does not override resource monitor assignment for individual warehouses. If either the account\n  resource monitor or the warehouse resource monitor reaches its defined threshold and a suspend action has been defined, the warehouse is\n  suspended.\n* An account-level resource monitor does not control credit usage by the Snowflake-provided compute resources for serverless features (for\n  example, Snowpipe, automatic reclustering, and materialized views).\n\n## Warehouse suspension and resumption ¶\n\nThe used credits for a resource monitor reflect the sum of credits consumed by all assigned warehouses within the specified interval,\nalong with the cloud services used to support those warehouses during the same interval. If a monitor has a **Suspend** or **Suspend Immediately** action defined and its used credits reach the threshold for the action, any warehouses assigned to the monitor are suspended\nand cannot be resumed until one of the following conditions is met:\n\n* The next interval, if any, starts, as dictated by the start date for the monitor.\n* The credit quota for the monitor is increased.\n* The credit threshold for the suspend action is increased.\n* The warehouses are no longer assigned to the monitor.\n* The monitor is dropped.\n\nA warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. After a virtual warehouse is\nsuspended, subsequent queries run against that warehouse can still result in additional cloud services costs. For more information\nabout credit usage for cloud services, see Cloud service credit usage .\n\nTip\n\nResource monitors are not intended for strictly controlling consumption on an hourly basis; they are intended for tracking and\ncontrolling credit consumption per interval (day, week, month, etc.). Also, they are not intended for setting precise limits on credit\nusage (i.e. down to the level of individual credits). For example, when credit quota thresholds are reached for a resource monitor, the\nassigned warehouses may take some time to suspend, even when the action is **Suspend Immediate** , thereby consuming additional credits.\n\nIf you wish to strictly enforce your quotas, we recommend the following:\n\n* Utilize buffers in the quota thresholds for actions (e.g. set a threshold to 90% instead of 100%).\n  \n  This will help ensure that your credit usage doesn’t exceed the quota.\n* To more strictly control credit usage for individual warehouses, assign only a single warehouse to each resource monitor.\n  \n  When multiple warehouses are assigned to the same resource monitor, they share the same quota thresholds, which may result in credit\n  usage for one warehouse impacting the other assigned warehouses.\n\n## Resource monitor notifications ¶\n\nWhen a resource monitor reaches the threshold for an action , it generates a notification\nsimilar to the following notification:\n\n```\nResource Monitor MY_ACCOUNT_MONITOR has reached 50% of its MONTHLY \n quota of 500 credits which has triggered a <action> action.\n```\n\nThe `<action>` is one of the following actions:\n\n* NOTIFY\n* SUSPEND\n* SUSPEND\\_IMMEDIATE\n\nNotification behavior depends on the type of resource monitor and whether or not notifications\nare enabled for an individual user. Notifications are sent as follows:\n\n* For _warehouse_ monitors, a notification is sent to the following users:\n  \n    + All account administrators who have enabled resource monitor notifications.\n    + Non-administrator users in the notification list for the resource monitor.\n* For _account_ monitors, a notification is sent to the following users:\n  \n    + The account administrator with the OWNERSHIP privilege on the resource monitor if they have enabled notifications.\n    + All account administrators who have enabled notifications using Snowsight.\n  \n  Note\n  \n  A non-administrator user can’t be added to the notification list for an _account_ monitor.\n\nImportant\n\nResource monitor notifications can be sent by email or in Snowsight, but are disabled by default. You must set up\nnotifications before they are sent. Users that do not have the ACCOUNTADMIN role can only be sent email notifications.\n\nTo enable notifications, see Enabling receipt of notifications .\n\n## DDL for resource monitors ¶\n\nSnowflake provides the following DDL commands for creating and using/managing resource monitors:\n\n* CREATE RESOURCE MONITOR\n* ALTER RESOURCE MONITOR\n* SHOW RESOURCE MONITORS\n* DROP RESOURCE MONITOR\n\nIn addition, the following DDL commands can be used to assign a resource monitor to a warehouse and determine whether a warehouse is assigned to\na monitor:\n\n* CREATE WAREHOUSE or ALTER WAREHOUSE\n* SHOW WAREHOUSES\n\n## Access control privileges for resource monitors ¶\n\nBy default, resource monitors can only be created by account administrators and, therefore, can only be viewed and maintained by them.\n\nHowever, roles that have been granted the following privileges on specific resource monitors can view and modify the resource monitor as\nneeded using SQL:\n\n* MONITOR\n* MODIFY\n\nFor more information, see Access control privileges and GRANT <privileges> … TO ROLE .\n\nNote that only account administrators can view and manage resource monitors via the Snowsight.\n\n## Enabling receipt of notifications ¶\n\nBefore you can receive any notifications from resource monitors, you must enable notifications in the web interface and verify your email.\n\nSnowsight :\n    To enable notifications, follow these steps:\n\n1. Verify your email address if you haven’t already done so. For instructions on how to verify your email address, see Verify your email address .\n2. Select your username, then select Profile\n3. For Notifications , select Enable notifications from resource monitors .\n   \n   Note\n   \n    + If you haven’t verified your email address, the Notifications option isn’t available until you verify your email.\n    + In Notifications , the Enable notifications from resource monitors option is only available to users with\n         the ACCOUNTADMIN role in the following cases:\n         \n        - If there is a resource monitor assigned to the account and the account administrator has the OWNERSHIP privilege\n                   on the account monitor.\n        - If there are warehouse monitors in the account. All account administrators can receive notifications for warehouse monitors.\n\n## Creating resource monitors ¶\n\nResource monitors can be created through either the web interface or SQL; however, only account administrators (i.e. users with the\nACCOUNTADMIN role) can create resource monitors.\n\nA resource monitor can’t be assigned more than 500 warehouses.\n\nImportant\n\nYou must assign at least one warehouse to a resource monitor or set the monitor at the account level for it to begin\nmonitoring/tracking credit usage:\n\n* In the web interface, you are required to do this at creation time.\n* In SQL, you must create the resource monitor first, then assign one or more warehouses to it by executing ALTER WAREHOUSE as a separate,\n  additional step.\n\nAlso, to receive notifications when resource monitor actions are triggered, you must enable notifications .\n\n### Creating a resource monitor with a default schedule ¶\n\nYou can create a resource monitor that uses the default schedule using the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can create resource monitors.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select \\+ Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\n   choose Warehouse to select the warehouses to monitor.\n7. For Actions , choose which notifications to enable by entering a threshold next to the option. You must select at\n   least one option.\n   \n   Select Add to create additional notifications. You can specify up to five notify actions.\n\nSQL :\n    In SQL, this task is performed in two steps:\n\n1. Execute a CREATE RESOURCE MONITOR command, but do not specify any scheduling properties.\n2. Execute an ALTER WAREHOUSE statement to assign warehouses to the resource monitor or an ALTER ACCOUNT statement to set the resource monitor for the account.\n\nFor example:\n\n* To create a monitor that starts monitoring immediately, resets at the beginning of each month, and suspends the assigned warehouse\n  when the used credits reach 100% of the credit quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >   TRIGGERS ON 100 PERCENT DO SUSPEND ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  The SUSPEND action waits for currently executing queries to finish before suspending the warehouse. A query might start before the\n  threshold is reached and complete after the SUSPEND action is triggered. In this case, the warehouse continues to consume credits\n  even after the quota is reached.\n* To create a similar monitor that suspends at 90% and suspends immediately at 100% after the quota has been reached:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >   TRIGGERS ON 90 PERCENT DO SUSPEND \n  >            ON 100 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  In this example, a notification is sent and the assigned warehouses are suspended when 90% of the credit quota is reached.\n  Currently executing queries complete, but the resource monitor prevents the warehouses from executing any new queries.\n  If the assigned warehouses reach 100% of the credit quota, a notification is sent and the warehouses are suspended immediately,\n  canceling all currently executing queries. This prevents all warehouses in the account from consuming credits.\n* To create a monitor that is similar to the first example, but lets the assigned warehouse exceed the quota by 10% and also includes two\n  notification actions to alert account administrators as the used credits reach the halfway and three-quarters points for the quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >    TRIGGERS ON 50 PERCENT DO NOTIFY \n  >             ON 75 PERCENT DO NOTIFY \n  >             ON 100 PERCENT DO SUSPEND \n  >             ON 110 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  In this example:\n  \n    + When 50% and 75% usage is reached, an alert notification is sent to all account administrators who have enabled notifications, but no\n        other actions are performed.\n    + When 100% usage is reached, the assigned warehouse is suspended.\n    + If the warehouse is still running when 110% usage is reached, it is suspended immediately.\n\n### Creating a resource monitor with a custom schedule ¶\n\nYou can create a resource monitor that uses a schedule other than the default using the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can create resource monitors.\n\nComplete the following steps to create a resource monitor with a custom schedule:\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select \\+ Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\n   choose Warehouse to select the warehouses to monitor.\n7. Select Schedule » Customize to set a custom schedule for the specified interval. You can skip this step to use the default schedule .\n   \n   You can set a custom start and end date using Custom Start Date and Custom End Date , or specify a date range\n   by using the Range tab.\n   \n   Note\n   \n   If you choose to end monitoring at a specified date and time, all assigned warehouses are suspended on that date and time even\n   if the credit quota has not been reached. A notification is sent when this occurs that states the resource monitor has reached\n   a percentage of its quota and has triggered a suspend immediate action. The percentage of the quota reflects the number\n   of used credits in the current interval up to the end date and might not be a threshold you specified.\n   \n   You can also customize the specified interval for monitoring. Select Resets and you can select from the following periodic\n   intervals at which to reset the credit quota:\n   \n    + Monthly\n    + Daily\n    + Weekly\n    + Yearly\n    + Never\n8. For Actions , choose which notifications to enable by entering a threshold next to the option. You must select at\n   least one option.\n   \n   Select Add to create additional notifications. You can specify up to five notify actions.\n9. For Actions and Notifications , enable a given action or notification by entering a threshold next to the option.\n   You must select at least one option.\n   \n   Select \\+Add more notification thresholds to create additional notifications. You can specify up to five notify actions.\n\nSQL :\n    Execute a CREATE RESOURCE MONITOR command, with one or more of the following scheduling properties:\n\n* FREQUENCY\n* START\\_TIMESTAMP\n* END\\_TIMESTAMP\n\nFor example:\n\n* To create an account-level resource monitor that starts immediately (based on the current timestamp), resets monthly on the same day,\n  has no end date or time, and suspends the assigned warehouse when the used credits reach 100% of the quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >     FREQUENCY = MONTHLY \n  >     START_TIMESTAMP = IMMEDIATELY \n  >     TRIGGERS ON 100 PERCENT DO SUSPEND ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  >\n* To create a resource monitor that starts at a specific date and time in the future, resets weekly on the same day, has no end date or\n  time, and performs two different suspend actions at different thresholds on two assigned warehouses:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 2000 \n  >     FREQUENCY = WEEKLY \n  >     START_TIMESTAMP = '2019-03-04 00:00 PST' \n  >     TRIGGERS ON 80 PERCENT DO SUSPEND \n  >              ON 100 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ; \n  > \n  >  ALTER WAREHOUSE wh2 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  >\n\nNote\n\nYou cannot change the customized schedule for a resource monitor back to the default. You must drop the monitor and create a new monitor.\n\n## Modifying a resource monitor ¶\n\nYou can modify the following properties for an existing resource monitor:\n\n* Increase or decrease the credit quota for the monitor.\n* Customize the schedule (frequency, start timestamp, and end timestamp) for the monitor.\n* Add or remove actions, or modify the threshold percentages for existing actions.\n* If the monitor is monitoring your account, convert it to monitor individual warehouses.\n* If the monitor is monitoring individual warehouses:\n  \n    + Add or remove warehouses from the list.\n    + Convert it to monitor your account.\n\nNote\n\nChanging any of these properties does not affect the used credits to-date for the monitor. All changes only affect used credits\nafter the changes are saved.\n\nResource monitors can be modified through the web interface or SQL.\n\nNote\n\nThe following privileges are required to modify the properties of a resource monitor:\n\n* To modify the credit quota, schedule, or actions for a resource monitor, a user must use a role with the MODIFY\n  privilege on the resource monitor.\n* To modify the monitor type for a resource monitor from warehouse to account or vice versa, a user must use the\n  ACCOUNTADMIN role.\n* To modify the list of warehouses for a warehouse-level resource monitor, a user must use the ACCOUNTADMIN role.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\n\nSQL :\n    * To change the quota, customize the schedule, or add/remove/modify actions, execute an ALTER RESOURCE MONITOR statement.\n  \n  For example, to increase the credit quota for resource monitor `limit1` to `3000` , execute the following statement:\n  \n  > ```\n  > ALTER RESOURCE MONITOR limit1 SET CREDIT_QUOTA = 3000 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  For more examples, see Examples .\n\n* To change the monitor type, execute an ALTER WAREHOUSE or ALTER ACCOUNT statement.\n  \n  For example, to change resource monitor `my_rm` which currently monitors warehouses to monitor\n  the account `my_account` , execute the following steps:\n  \n    1. Find all the warehouses the resource monitor `my_rm` is monitoring. Check the `resource_monitor` column for `my_rm` :\n         \n         ```\n         SHOW WAREHOUSES ;\n         ```\n         \n         Copy\n         \n         Returns the following results:\n         \n         ```\n         +--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------+ \n          | name   | state     | type     | size    | running | queued | is_default | is_current | auto_suspend | auto_resume | available | provisioning | quiescing | other | created_on                    | resumed_on                    | updated_on                    | owner        | comment | resource_monitor | actives | pendings | failed | suspended | uuid       | budget | owner_role_type | \n          |--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------| \n          | MY_WH1 | STARTED   | STANDARD | X-Small |       0 |      0 | N          | N          |          600 | true        |           |              |           |       | 2024-01-17 14:37:36.223 -0800 | 2024-01-17 14:37:36.325 -0800 | 2024-01-17 14:47:49.854 -0800 | MY_ROLE      |         | null             |       0 |        0 |      0 |         1 | 1222706972 | NULL   | ROLE            | \n          | MY_WH2 | SUSPENDED | STANDARD | X-Small |       0 |      0 | N          | Y          |          600 | true        |           |              |           |       | 2023-12-20 13:50:50.972 -0800 | 2024-01-17 14:28:39.170 -0800 | 2024-01-17 14:37:57.560 -0800 | ACCOUNTADMIN |         | MY_RM            |       0 |        0 |      0 |         1 | 1222706948 | NULL   | ROLE            | \n          | MY_WH3 | SUSPENDED | STANDARD | Small   |       0 |      0 | N          | N          |          600 | true        |           |              |           |       | 2024-01-17 14:26:26.911 -0800 | 2024-01-17 14:33:39.260 -0800 | 2024-01-17 14:38:31.192 -0800 | ACCOUNTADMIN |         | MY_RM            |       0 |        0 |      0 |         2 | 1222706960 | NULL   | ROLE            | \n          +--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------+\n         ```\n         \n         Resource monitor `my_rm` is monitoring two warehouses `my_wh2` and `my_wh3` .\n    2. Remove the resource monitor for both warehouses by executing the following statements:\n         \n         ```\n         ALTER WAREHOUSE my_wh2 UNSET RESOURCE_MONITOR ; \n         \n          ALTER WAREHOUSE my_wh3 UNSET RESOURCE_MONITOR ;\n         ```\n         \n         Copy\n    3. Change the resource monitor to monitor the account by executing the following statement:\n         \n         ```\n         ALTER ACCOUNT my_account SET RESOURCE_MONITOR = my_rm ;\n         ```\n         \n         Copy\n\nNote\n\nIf a resource monitor has a customized schedule, you cannot change the schedule back to the default. You must drop the monitor and\ncreate a new monitor.\n\n## Send resource monitor notifications to non-administrator users ¶\n\nNon-administrator users can only receive email notifications for warehouse monitors . Each non-administrator\nuser must have a verified email address. You can add up to five non-administrator users to a warehouse monitor using the CREATE RESOURCE\nMONITOR or ALTER RESOURCE MONITOR command.\n\nFor example, to add users `user1` and `user2` to the warehouse monitor `my_warehouse_rm` , execute the following\nstatement:\n\n```\nALTER RESOURCE MONITOR my_warehouse_rm \n  SET NOTIFY_USERS = ( USER1 , USER2 );\n```\n\nCopy\n\nNote\n\nIf any user in the notification list does not have a verified email, the statement fails.\n\nFor more information, see the NOTIFY\\_USERS parameter and Usage notes in the ALTER RESOURCE MONITOR topic.\n\nTo add non-administrator users to the notification list for a resource monitor when you create a resource monitor using SQL, see CREATE RESOURCE MONITOR .\n\n## Setting a resource monitor for your account ¶\n\nA resource monitor can be set for your account through the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can set a resource monitor to monitor the account.\n\nSnowsight :\n    You can set the monitor type to account when you create a resource monitor. For more information,\nsee Creating resource monitors .\nSQL :\n    In SQL, this task is performed in two steps:\n\n1. Use the CREATE RESOURCE MONITOR command to create the resource monitor (if it doesn’t already exist).\n   \n   If the resource monitor does exist, to change a warehouse level resource monitor to monitor an account, see the example in the Modifying a Resource Monitor section .\n2. Use the ALTER ACCOUNT command to set the resource monitor you created as the monitor for your account.\n   \n   For example, to set the account resource monitor to `my_account_rm` , execute the following statements:\n   \n   > ```\n   > USE ROLE ACCOUNTADMIN ; \n   > \n   >  CREATE RESOURCE MONITOR my_account_rm WITH CREDIT_QUOTA = 10000 \n   >   TRIGGERS ON 100 PERCENT DO SUSPEND ; \n   > \n   >  ALTER ACCOUNT SET RESOURCE_MONITOR = my_account_rm ;\n   > ```\n   > \n   > Copy\n   > \n   >\n\nTo change the monitor type of an existing resource monitor from a warehouse monitor to an account monitor, see the example in the Modifying a Resource Monitor section .\n\nTo view whether a resource monitor is set for your account, use the web interface or the SHOW RESOURCE MONITORS command. The `LEVEL` column for a resource monitor displays whether it is set for your account or individual warehouses.\n\nImportant\n\n* An account-level resource monitor only controls the virtual warehouses explicitly created in your account; it does not control credit\n  usage by the Snowflake-provided warehouses for serverless features (for example, Snowpipe , Automatic Clustering , and materialized views ).\n* A warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. The monitor can only\n  suspend the user-managed virtual warehouses created in your account. After a user-managed virtual warehouse is suspended, subsequent\n  queries run against that warehouse can still result in additional cloud services costs. For more information about credit usage for cloud\n  services, see Cloud service credit usage .\n\n## Assigning warehouses to a resource monitor ¶\n\nWarehouses can be assigned to an existing resource monitor through the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can assign warehouses to resource monitors.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\n5. If Monitor Type is Account , select Warehouse .\n6. Select Warehouse to choose the warehouses to monitor.\n\nSQL :\n    Use the ALTER WAREHOUSE command to assign a warehouse to a resource monitor.\n\nFor example, to monitor warehouse `my_wh` with the resource monitor `my_rm` , execute the following statement:\n\n> ```\n> ALTER WAREHOUSE my_wh SET RESOURCE_MONITOR = my_rm ;\n> ```\n> \n> Copy\n> \n>\n\n## Viewing resource monitors ¶\n\nResource monitors can be viewed through the web interface or SQL.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors to see a list of resource monitors for which your role has been granted the MODIFY or MONITOR\n   privilege. Account administrator users can see all resource monitors.\n4. Select a resource monitor to view detailed information about resource monitor settings, current credit usage, and a list of\n   roles with privileges on the resource monitor.\n5. Select Account  » Resource Monitors .\n\nSQL :\n    Using the ACCOUNTADMIN role or a role that has been granted the MONITOR or MODIFY privilege on the resource monitor, execute\na SHOW RESOURCE MONITORS statement.\n\nIn addition, using any role, you can execute a SHOW WAREHOUSES statement to view the warehouses owned\nby the role (or for which the role has been granted USAGE privilege). The output includes the resource monitor, if any, to which\nthe warehouse is assigned.\n\nNote\n\nFor provider accounts that have created reader accounts, Snowflake provides an additional view, RESOURCE\\_MONITORS . This view can be used for querying resource monitor usage\nin the provider’s reader accounts. For more information, see Account Usage .\n\n## Replicating resource monitors ¶\n\n Business Critical Feature\n\nResource monitor replication requires Business Critical (or higher). To inquire about upgrading, please contact [Snowflake Support](https://docs.snowflake.com/user-guide/contacting-support) .\n\nResource monitors can be replicated from a source account to target accounts using a replication or failover group . For more information, see Resource monitor replication .\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nLanguage: **English**\n\n* English\n* Français\n* Deutsch\n* 日本語\n* 한국어\n* Português"
      ],
      "full_content": null
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/classes/budget/methods/set_spending_limit",
      "title": "<budget_name>!SET_SPENDING_LIMIT | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Reference Class reference BUDGET SET\\_SPENDING\\_LIMIT\n\n# <budget\\_ name>!SET\\_ SPENDING\\_ LIMIT ¶\n\nSet the spending limit for a budget . The spending limit is expressed\nin number of credits.\n\nSee also:\n    <budget\\_name>!GET\\_SPENDING\\_LIMIT\n\n## Syntax ¶\n\n```\n<budget_name> ! SET_SPENDING_LIMIT ( <number> )\n```\n\nCopy\n\n## Arguments ¶\n\n`_number_`\n    The number of credits allocated to the budget per month. When total usage for all objects assigned to the budget reaches this\nnumber for the current month, the budget is considered to be at 100% of the spending limit.\n\nFor the account budget, all supported objects contribute to the credit\nusage.\n\nIf a value is not specified for a budget, the budget has no spending limit, will never reach 100% usage, and will not\ntrigger notifications.\n\nDefault: -1 (no spending limit).\n\n## Returns ¶\n\n```\nThe spending limit has been updated to <n> credits.\n```\n\n## Access control requirements ¶\n\n* The following minimum privileges and roles are required to view results for _custom budgets_ :\n  \n    + ADMIN instance role for the budget instance.\n    + USAGE privilege on the database and schema that contains the budget instance.\n* The following role is required to view results for the _account budget_ :\n  \n  BUDGET\\_ADMIN application role for the account budget.\n\nFor more information, see Budgets roles and privileges .\n\n## Usage notes ¶\n\n* The `_number_` argument must be a positive integer.\n* Calling this method does not return the object. Because of this, you can’t use method chaining to call another method on the\n  return value of this method. Instead, call each method in a separate SQL statement.\n\n## Examples ¶\n\nSet the spending limit for the account budget to 500 credits per month:\n\n```\nCALL snowflake.local.account_root_budget ! SET_SPENDING_LIMIT ( 500 );\n```\n\nCopy\n\nSet the spending limit for budget `my_database.my_schema.my_budget` to 100 credits per month.\n\n```\nCALL my_database . my_schema . my_budget ! SET_SPENDING_LIMIT ( 100 );\n```\n\nCopy\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Syntax\n2. Arguments\n3. Returns\n4. Access control requirements\n5. Usage notes\n6. Examples\n\nRelated content\n\n1. BUDGET (SNOWFLAKE.CORE)\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"
      ],
      "full_content": null
    }
  ],
  "errors": [],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 7
    }
  ]
}