{
  "extract_id": "extract_998ef6ae0eb54e88b91a75ed5a6483ce",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor",
      "title": "CREATE RESOURCE MONITOR | Snowflake Documentation",
      "publish_date": "2026-01-01",
      "excerpts": [
        "Reference SQL command reference Virtual warehouses & resource monitors CREATE RESOURCE MONITOR\n\n# CREATE RESOURCE MONITOR ¶\n\nCreates a new resource monitor . This command can only be executed by account administrators.\n\nSee also:\n    ALTER RESOURCE MONITOR , DROP RESOURCE MONITOR , SHOW RESOURCE MONITORS , ALTER WAREHOUSE , ALTER ACCOUNT\n\n## Syntax ¶\n\n```\nCREATE [ OR REPLACE ] RESOURCE MONITOR [ IF NOT EXISTS ] <name> WITH \n                      [ CREDIT_QUOTA = <number> ] \n                      [ FREQUENCY = { MONTHLY | DAILY | WEEKLY | YEARLY | NEVER } ] \n                      [ START_TIMESTAMP = { <timestamp> | IMMEDIATELY } ] \n                      [ END_TIMESTAMP = <timestamp> ] \n                      [ NOTIFY_USERS = ( <user_name> [ , <user_name> , ... ] ) ] \n                      [ TRIGGERS triggerDefinition [ triggerDefinition ... ] ]\n```\n\nCopy\n\nWhere:\n\n> ```\n> triggerDefinition ::= \n>     ON <threshold> PERCENT DO { SUSPEND | SUSPEND_IMMEDIATE | NOTIFY }\n> ```\n> \n> Copy\n> \n>\n\n## Required parameters ¶\n\n`_name_`\n    Identifier for the resource monitor; must be unique for your account.\n\nThe identifier must start with an alphabetic character and cannot contain spaces or special characters unless the entire identifier string\nis enclosed in double quotes (e.g. `\"My object\"` ). Identifiers enclosed in double quotes are also case-sensitive.\n\nFor more details, see Identifier requirements .\n\n## Optional parameters ¶\n\n`CREDIT_QUOTA = _num_`\n    The number of credits allocated to the resource monitor per frequency interval. When total usage for all warehouses assigned to the\nmonitor reaches this number for the current frequency interval, the resource monitor is considered to be at 100% of quota.\n\nIf a value is not specified for a resource monitor, the monitor has no quota and will never reach 100% usage within the specified interval.\n\nDefault: No value (i.e. no credit quota) `FREQUENCY = MONTHLY | DAILY | WEEKLY | YEARLY | NEVER`\n    The frequency interval at which the credit usage resets to `0` .\n\nIf you set a frequency for a resource monitor, you must also set `START_TIMESTAMP` .\n\nIf you specify `NEVER` for the frequency, the credit usage for the warehouse does not reset.\n\nDefault: No value (i.e. legacy behavior, whereby the credit quota resets at the beginning of each calendar month) `START_TIMESTAMP = _timestamp_ | IMMEDIATELY`\n    The date and time when the resource monitor starts monitoring credit usage for the assigned warehouses.\n\nIf you set a timestamp for a resource monitor, you must also set `FREQUENCY` .\n\nIf you specify `IMMEDIATELY` for the start timestamp, the current timestamp is used.\n\nIf you specify a date without a time, the current time is used.\n\nIf you set a time without specifying a time zone, UTC is used as the default time zone.\n\nDefault: No value (i.e. legacy behavior, whereby the resource monitor starts monitoring warehouses immediately) `END_TIMESTAMP = _timestamp_`\n    The date and time when the resource monitor suspends the assigned warehouses.\n\nDefault: No value (i.e. no warehouse suspension date) `NOTIFY_USERS = ( _user_name_ [ , _user_name_ , ... ] )`\n    Specifies the list of users to receive email notifications on resource monitors. If a user identifier includes spaces or special\ncharacters or is case-sensitive, then the identifier must be enclosed in double quotes (e.g. “Mary Smith”). See Identifier requirements for details.\n\nThe user identifier, `_user_name_` , is the value of the `name` column from the output of SHOW USERS .\n\nEach user listed must have a verified email address. For instructions on verifying email addresses in the web interface, see Verify your email address .\n\nEmail notifications for non-administrator users do not supersede email notifications for administrators. Any account administrators that\nhave enabled email notifications will continue to receive email notifications.\n\nNote\n\n* The following limitations apply for non-administrator users:\n  \n    + Non-administrator users can only receive notifications for warehouse monitors .\n    + Non-administrator users are notified by email but can’t see notifications in Snowsight.\n    + Non-administrator users can’t create resource monitors.\n    + Non-administrator users can’t assign other users to be notified. `TRIGGERS ...` (aka _actions_ )\n    Specifies one or more triggers for the resource monitor. Each trigger definition consists of the following:\n\n> `ON _threshold_ PERCENT`\n>     A numeric value specified as a percentage of the credit quota for the resource monitor; values larger than `100` are supported.\n> Once usage reaches this threshold for the current frequency interval, the trigger fires. `DO SUSPEND | SUSPEND_IMMEDIATE | NOTIFY`\n>     Specifies the action performed by the trigger when the threshold is reached:\n> \n> * `SUSPEND` : Suspend all assigned warehouses while allowing currently running queries to complete. No new queries can be executed\n>   by the warehouses until the credit quota for the resource monitor is increased. In addition, this action sends a notification to all\n>   users who have enabled notifications for themselves.\n> * `SUSPEND_IMMEDIATE` : Suspend all assigned warehouses immediately and cancel any currently running queries or statements using\n>   the warehouses. In addition, this action sends a notification to all users who have enabled notifications for themselves.\n> * `NOTIFY` : Send a notification (to all account administrators with notifications enabled), but do not take any other action.\n> \n> \n\nDefault: No value (i.e. resource monitor performs no actions)\n\n## Usage notes ¶\n\n* Triggers are optional; however, at least one trigger must be added to a resource monitor before it can perform any actions.\n* Each resource monitor supports up to a maximum of 5 `NOTIFY` action triggers.\n* After a resource monitor is created, it must be assigned to a warehouse or account before it can perform any monitoring actions:\n  \n    + To assign a warehouse to a resource monitor, use ALTER WAREHOUSE (or CREATE WAREHOUSE if you are creating the warehouse).\n    + To assign a resource monitor at the account level, use ALTER ACCOUNT . The NOTIFY\\_USERS parameter must be null.\n* To view all resource monitors created in your account and their assignment, use the SHOW RESOURCE MONITORS command. The command\n  output displays `NULL` in the `level` column for resource monitors that are not assigned to the account or any warehouses\n  and, therefore, are not monitoring any credit usage.\n* If `frequency` and `start_timestamp` parameters are set on a resource monitor, the day for the credit usage reset is\n  calculated based on those parameters. The time the credit usage resets to `0` is 12:00 AM UTC regardless of the time specified in `start_timestamp` .\n* If you specify an `end_timestamp` , monitoring ends at that specified date and time and all assigned warehouses are suspended\n  at that date and time even if the credit quota has not been reached.\n  \n  When this occurs, a notification is sent that states the resource monitor has reached a percentage of its quota and has triggered a\n  suspend immediate action. The percentage of the quota reflects the number of credits used in the current interval up to the end date\n  and might not be a threshold you specified.\n* If there are non-administrator users in the notification list, the following notes apply:\n  \n    + If any user in the notification list does not have a verified email ,\n        the SQL statement fails.\n    + If any user in the notification list changes their email address and does not verify the new email address, the\n        notification silently fails.\n    + The notification list is limited to a maximum number of 5 non-administrator users.\n    + Account administrators can view the notification list of non-administrator users in the output of SHOW RESOURCE MONITORS in the `notify_user` column.\n* Regarding metadata:\n  \n  Attention\n  \n  Customers should ensure that no personal data (other than for a User object), sensitive data, export-controlled data, or other regulated data is entered as metadata when using the Snowflake service. For more information, see Metadata fields in Snowflake .\n\n* The OR REPLACE and IF NOT EXISTS clauses are mutually exclusive. They can’t both be used in the same statement.\n* CREATE OR REPLACE _<object>_ statements are atomic. That is, when an object is replaced, the old object is deleted and the new object is created in a single transaction.\n\nImportant\n\nTo receive notifications generated by resource monitors, account administrators and non-administrator users in the notification\nlist must explicitly enable notifications in their preferences. In addition, to receive email notifications, users must have a\nverified email in their preferences. Preferences can only\nbe set in the Snowflake web interface. For more information, see Enabling receipt of notifications .\n\n## Examples ¶\n\nCreate a resource monitor named `limiter` with 3 triggers:\n\n> ```\n> CREATE OR REPLACE RESOURCE MONITOR limiter \n>   WITH CREDIT_QUOTA = 5000 \n>   TRIGGERS ON 75 PERCENT DO NOTIFY \n>            ON 100 PERCENT DO SUSPEND \n>            ON 110 PERCENT DO SUSPEND_IMMEDIATE ;\n> ```\n> \n> Copy\n> \n> \n\nCreate a resource monitor to send notifications to three users when 75% of the credit quota is reached. In this example, the `_user_name_` for two of the users includes a space and must be enclosed in double quotes:\n\n> ```\n> CREATE OR REPLACE RESOURCE MONITOR limiter \n>   WITH CREDIT_QUOTA = 5000 \n>        NOTIFY_USERS = ( JDOE , \"Jane Smith\" , \"John Doe\" ) \n>   TRIGGERS ON 75 PERCENT DO NOTIFY \n>            ON 100 PERCENT DO SUSPEND \n>            ON 110 PERCENT DO SUSPEND_IMMEDIATE ;\n> ```\n> \n> Copy\n> \n>\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Syntax\n2. Required parameters\n3. Optional parameters\n4. Usage notes\n5. Examples\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"
      ],
      "full_content": null
    }
  ],
  "errors": [
    {
      "url": "60000",
      "error_type": "fetch_error",
      "http_status_code": null,
      "content": null
    }
  ],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 1
    }
  ]
}
