{"search_id":"search_78f7d97efc1846149a3ecebb4ef4d895","results":[{"url":"https://docs.snowflake.com/en/developer-guide/declarative-sharing/monitoring","title":"Monitoring Usage with Declarative Sharing in the Native Application Framework | Snowflake Documentation","excerpts":["Developer Snowflake Declarative Sharing Monitoring\nSection Title: Monitoring Usage with Declarative Sharing in the Native Application Framework ¶\nContent:\nFeature — Generally Available\nSupport for Snowflake Declarative Native Apps is available to all accounts.\nAs a provider, you can monitor the usage of your Declarative Native App to gain insights into how consumers are interacting with your data product.\nThis topic describes the views available in Snowflake to track application usage, access history, and the current state of installed applications.\nSection Title: ... > Monitor app usage ¶\nContent:\nTo monitor the usage of your Declarative Native Apps, you can use the following views:\nAPPLICATION_DAILY_USAGE_HISTORY view .\nLISTING_ACCESS_HISTORY view .\nAPPLICATION_STATE view .\nFor more information, see Data Sharing Usage .\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nSection Title: ... > Privacy Preference Center\nContent:\nYour Opt Out Preference Signal is Honored\nYour Privacy\nStrictly Necessary Cookies\nPerformance Cookies\nFunctional Cookies\nTargeting Cookies\nSection Title: Monitoring Usage with Declarative Sharing in the Native Application Framework ¶ > ... > Your Privacy\nContent:\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\nSection Title: ... > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎\n ... \nSection Title: ... > Functional Cookies\nContent:\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\nCookies Details‎\nSection Title: ... > Targeting Cookies\nContent:\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nCookies Details‎\nSection Title: Monitoring Usage with Declarative Sharing in the Native Application Framework ¶ > ... > Cookie List\nContent:\nConsent Leg.Interest\ncheckbox label label\ncheckbox label label\ncheckbox label label\nClear\ncheckbox label label\nApply Cancel\nConfirm My Choices\nAllow All\n[](https://www.onetrust.com/products/cookie-consent/)"]},{"url":"https://docs.snowflake.com/en/release-notes/2026/other/2026-02-20-nativeapps-configuration","title":"Feb 20, 2026: Snowflake Native Apps: Configuration (Preview) | Snowflake Documentation","excerpts":["Section Title: Feb 20, 2026: Snowflake Native Apps: Configuration ( *Preview* ) ¶\nContent:\nSnowflake Native Apps can now request configuration values from consumers using application configurations.\nThis capability allows an app to define configuration keys that request specific information from the consumer, such as the name of a server app for inter-app communication, or an arbitrary string value like an external URL or account identifier. Configurations can be marked as sensitive to protect values such as API keys or access tokens from exposure in query history and command output.\nFor more information, see Application configuration .\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)"]},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/native-apps-about","title":"About the Snowflake Native App Framework | Snowflake Documentation","excerpts":["Section Title: About the Snowflake Native App Framework ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic provides general information about the Snowflake Native App Framework.\nSection Title: About the Snowflake Native App Framework ¶ > Introduction to the Snowflake Native App Framework ¶\nContent:\nThe Snowflake Native App Framework allows you to create data applications that leverage core Snowflake functionality.\nThe Snowflake Native App Framework allows you to:\nExpand the capabilities of other Snowflake features by sharing data and related\nbusiness logic with other Snowflake accounts. The business logic of an application can include a Streamlit app,\nstored procedures, and functions written using Snowpark API ,\nJavaScript, and SQL.\nShare an application with consumers through listings. A listing can be either free or paid.\nYou can distribute and monetize your apps in the Snowflake Marketplace or distribute them to\nspecific consumers using private listings.\nInclude rich visualizations in your application using Streamlit.\nThe Snowflake Native App Framework also supports an enhanced development experience that provides:\nSection Title: About the Snowflake Native App Framework ¶ > Introduction to the Snowflake Native App Framework ¶\nContent:\nA streamlined testing environment where you can test your applications from a single account.\nA robust developer workflow. While your data and related database objects remain within Snowflake,\nyou can manage supporting code files and resources within source control using your preferred\ndeveloper tools.\nThe ability to release versions and patches for your application that allows you, as a provider,\nto change and evolve the logic of your applications and release them incrementally to consumers.\nSupport for logging of structured and unstructured events so that you can troubleshoot and monitor\nyour applications.\nSection Title: About the Snowflake Native App Framework ¶ > Components of the Snowflake Native App Framework ¶\nContent:\nThe following diagram shows a high-level view of the Snowflake Native App Framework.\nThe Snowflake Native App Framework is built around the concept of provider and consumer used by other\nSnowflake features, including Snowflake Collaboration and Secure Data Sharing\nProvider\nA Snowflake user who wants to share data content and application logic with other Snowflake users.\nConsumer\nA Snowflake user who wants to access the data content and application logic shared by providers.\n ... \nSection Title: About the Snowflake Native App Framework ¶ > ... > Publish an Application Package ¶\nContent:\nAfter developing and testing an application package, a provider can share an application with consumers by\npublishing a listing containing the application package as the data product of a listing. The listing can be a Snowflake Marketplace\nlisting or a private listing.\nSnowflake Marketplace listing\nAllows providers to market applications across the Snowflake Data Cloud. Offering a listing on the Snowflake Marketplace\nlets providers share applications with many consumers simultaneously, rather than maintain\nsharing relationships with each individual consumer.\nPrivate listing\nAllows providers to take advantage of the capabilities of listings to share applications directly with another\nSnowflake account in any Snowflake region supported by the Snowflake Native App Framework.\nSee About listings for details.\n ... \nSection Title: ... > Protect provider intellectual property in an app with containers ¶\nContent:\nWhen an app with containers is installed in the consumer account, the query history of the services\nis available in the consumer account. To protect a provider’s confidential information, the Snowflake Native App Framework redacts\nthe following information:\nThe query text is hidden from the QUERY_HISTORY view .\nAll information in the ACCESS_HISTORY view is hidden.\nThe Query Profile graph for the service’s query is collapsed\ninto a single empty node instead of displaying the full query profile tree.\nSection Title: ... > Multi-factor requirements for users in a provider account ¶\nContent:\nDepending on the type of user, Snowflake requires different types of authentication for\nusers in the provider account."]},{"url":"https://www.flexera.com/blog/finops/snowflake-native-apps/","title":"Snowflake Native Apps 101: Build and monetize data apps (2026)","publish_date":"2026-01-27","excerpts":["Section Title: ... > What Are Snowflake Native Applications?\nContent:\n**Snowflake Native Apps** are applications built using the Snowflake Native App Framework, which allows developers to create, test and deploy applications directly within Snowflake’s Data Cloud. These Native Apps leverage Snowflake’s core features like stored procedures , user-defined functions (Snowflake UDFs) and the [Snowpark API](https://docs.snowflake.com/en/developer-guide/snowpark/index) , all while keeping the data secure by running the code on your data stored in Snowflake. Native apps are available on the Snowflake Marketplace . You can discover and install them quickly, just like downloading an app on your smartphone.\nSection Title: ... > What Are Snowflake Native Applications?\nContent:\n**TL;DR:\n** **What They Are** — Snowflake Native Apps run entirely within Snowflake, eliminating the need to move data out for processing.\n**How They Work** — Snowflake Native Apps operate in your Snowflake account, using your existing data without external connections. Developers create and distribute them via the Snowflake Marketplace.\n**Why Use Them** :\n**Fast** — Snowflake Native Apps process data directly in Snowflake, reducing latency.\n**Secure** — Snowflake Native Apps don’t access or store data outside your account, relying on Snowflake’s encryption and access controls.\n**Scalable** — Snowflake Native Apps can grow alongside your Snowflake resources, handling larger datasets or more users.\nSnowflake Native Apps (Source: [Snowflake](https://www.snowflake.com/en/data-cloud/workloads/applications/native-apps/) )\nSection Title: ... > 1) **Native Integration with Snowflake Services**\nContent:\nSnowflake Native Apps work directly with Snowflake’s core services. They use stored procedures , user-defined functions (Snowflake UDFs UDFs) and the Snowpark API, making them efficient and seamless.\n ... \nSection Title: ... > 3) **Monetization via Snowflake Marketplace**\nContent:\nProviders can list and sell Snowflake apps in the Snowflake Marketplace . Consumers install these apps directly into their Snowflake accounts, simplifying deployment and making app monetization straightforward.\n ... \nSection Title: ... > Architecture of the Snowflake Native App Framework\nContent:\nThe architecture of the Snowflake Native App Framework operates on a provider-consumer model:\n**Provider** — Creates and shares data and application logic using the framework.\n**Consumer** — Installs and interacts with applications shared by providers.\nSnowflake Native Applications are packaged as **Application Packages** , which contains the necessary logic, metadata and configuration to deploy a Snowflake Native App. This includes:\n**Manifest file** : Configuration details, including setup script locations and versioning.\n**Setup script** : Contains SQL commands for installation and updates.\nThe provider publishes the Snowflake Native app via:\n**Marketplace Listings** — Accessible to all Snowflake users for broad distribution.\n**Private Listings** — Targeted sharing with specific accounts across regions.\n ... \nSection Title: ... > **Step 6** —Adding Data Content to Your Snowflake Native App\nContent:\n```\ndefinition_version: 2\nentities:\n\t snowflake_native_app_demo_package:\n\t\t\t type: application package\n\t\t\tstage: stage_content.hello_snowflake_stage\n\t\t\tmanifest: app/manifest.yml\n\t\t\tidentifier: snowflake_native_app_demo_package\n\t\t\t artifacts:\n\t\t\t\t\t- src: app/*\n\t\t\t\t\t dest: ./\n\t\t\t meta:\n\t\t\t\t post_deploy:\n\t\t\t\t\t\t - sql_script: scripts/shared_content.sql\n\t\tdemo_snowflake_native_app:\n\t\t\ttype: application\n\t\t\t from:\n\t\t\t\t target: snowflake_native_app_demo_package\n\t\t\tdebug: false\n```\nNext, modify the **setup_script.sql** file to create a view that app consumers can use to query the data.\n**Create a Versioned Schema:**\n```\nCREATE OR ALTER VERSIONED SCHEMA code_schema;\nGRANT USAGE ON SCHEMA code_schema TO APPLICATION ROLE snowflake_native_app_public;\n```\n**Create the View:**\n ... \nSection Title: ... > **Step 3** —Create and Configure a Private Listing on the Snowflake Marketplace\nContent:\nAttach the application package you prepared earlier as the core data content for the listing. Provide a detailed description outlining your app’s features and usage scenarios. If creating a private listing, add the account identifiers of intended consumers in the “ **Add** **Consumer accounts** ” section. Finally, publish your listing for approval.\nCreating a private listing for only specified consumers – Snowflake Native App\n ... \nSection Title: ... > [FinOps enters its technology value era: Insights from the State of FinOps 2026](https://ww...\nContent:\nFebruary 20, 2026\n×\nGet updates delivered to your inbox\nSubscribe"]},{"url":"https://docs.snowflake.com/en/release-notes/2026/other/2026-02-13-nativeapps-iac","title":"Feb 13, 2026: Snowflake Native Apps: Inter-App Communication (Preview) | Snowflake Documentation","excerpts":["[DOCUMENTATION](https://docs.snowflake.com)\n/\nEN\nEnglish\nFrançais\nDeutsch\n日本語\n한국어\nPortuguês\nGet started\nGuides\nDeveloper\nReference\nRelease notes\nTutorials\n[Status](https://status.snowflake.com)\nOverview\nRelease notes\nAll release notes\nSnowflake server release notes and feature updates\nClient, driver, and library release notes\nMonthly release notes\nClient versions & support policy\nSnowflake Connector release notes\nSnowflake Connector for Google Analytics Raw Data\nSnowflake Connector for Google Analytics Aggregate Data\nSnowflake Connector for ServiceNow V2\nSnowflake Connector for MySQL\nSnowflake Connector for PostgreSQL\nSnowflake Connector for Sharepoint\nNative SDK for Connectors\nNative SDK for Connectors Java library\nNative SDK for Connectors Java Test library\nNative SDK for Connectors Java Template\nNative SDK Example Java GitHub Connector\nBehavior changes\nBehavior change announcements\nRecent improvements\nPerformance improvements\nSQL improvements\nFeature information\nPreview features\nRelease notes Snowflake server release notes and feature updates Feb 13, 2026 - Snowflake Native Apps Inter-App Communication (Preview)\nSection Title: Feb 13, 2026: Snowflake Native Apps: Inter-App Communication ( *Preview* ) ¶\nContent:\nSnowflake Native Apps can now securely communicate with other apps in the same account.\nThis capability allows a Snowflake Native App to enhance the functionality of multiple Snowflake Native Apps in the same consumer account by enabling the sharing and merging of data.\nFor more information, see Inter-app Communication .\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)"]},{"url":"https://docs.snowflake.com/en/sql-reference/account-usage","title":"Account Usage | Snowflake Documentation","excerpts":["Section Title: Account Usage ¶\nContent:\nIn the SNOWFLAKE database, the ACCOUNT_USAGE and READER_ACCOUNT_USAGE schemas enable querying object metadata, as well as historical\nusage data, for your account and all reader accounts (if any) associated with the account.\nSection Title: Account Usage ¶ > Overview of Account Usage schemas ¶\nContent:\nACCOUNT_USAGE :\nViews that display object metadata and usage metrics for your account.\nIn general, these views mirror the corresponding views and table functions in the Snowflake Snowflake Information Schema , but\nwith the following differences:\nRecords for dropped objects included in each view.\nLonger retention time for historical usage data.\nData latency.\nFor more details, see Differences Between Account Usage and Information Schema (in this topic). For more details about each\nview, see ACCOUNT_USAGE Views (in this topic).\nREADER_ACCOUNT_USAGE :\nViews that display object metadata and usage metrics for all the reader accounts that have been created for\nyour account (as a Secure Data Sharing provider).\nThese views are a small subset of the ACCOUNT_USAGE views that apply to reader accounts. Also, each view in this schema contains an\nadditional `READER_ACCOUNT_NAME` column for filtering results by reader account.\nSection Title: Account Usage ¶ > Overview of Account Usage schemas ¶\nContent:\nFor more details about each view, see READER_ACCOUNT_USAGE Views (in this topic).\nNote that these views are empty if no reader accounts have been created for your account.\n ... \nSection Title: Account Usage ¶ > ... > Historical data retention ¶\nContent:\nCertain account usage views provide historical usage metrics. The retention period for these views is 1 year (365 days).\nIn contrast, the corresponding views and table functions in the Snowflake Information Schema have much shorter retention periods,\nranging from 7 days to 6 months, depending on the view.\n ... \nSection Title: Account Usage ¶ > ACCOUNT_USAGE views ¶\nContent:\n| View | Type | Latency [1] | Edition [3] | Notes |\n| ACCESS_HISTORY | Historical | 3 hours | Enterprise Edition (or higher) | Data retained for 1 year. |\n| AGGREGATE_ACCESS_HISTORY | Historical | 3 hours | Enterprise Edition (or higher) | Data retained for 1 year. |\n| AGGREGATE_QUERY_HISTORY | Historical | 3 hours |  |  |\n| AGGREGATION_POLICIES | Object | 2 hours |  |  |\n| APPLICATION_SPECIFICATIONS | Historical | 1 hour |  | Data for deleted app specifications is retained for 1 year. |\n| ARCHIVE_STORAGE_DATA_RETRIEVAL_USAGE_HISTORY | Historical | 1 hour |  | Data retained for 1 year. |\n| AUTOMATIC_CLUSTERING_HISTORY | Historical | 3 hours |  | Data retained for 1 year. |\n| BACKUP_OPERATION_HISTORY | Historical | 6 hours |  | Data retained for 1 year. |\n| BACKUP_POLICIES | Object | 6 hours |  |  |\n| BACKUP_SETS | Object | 6 hours |  |  |\n| BACKUP_STORAGE_USAGE | Historical | 6 hours |  | Data retained for 1 year. |\n ... \nSection Title: Account Usage ¶ > ... > ACCOUNT_ USAGE schema SNOWFLAKE database roles ¶\nContent:\n| Role | Purpose and Description |\n| OBJECT_VIEWER | The OBJECT_VIEWER role provides visibility into object metadata. |\n| USAGE_VIEWER | The USAGE_VIEWER role provides visibility into historical usage information. |\n| GOVERNANCE_VIEWER | The GOVERNANCE_VIEWER role provides visibility into data governance related information. |\n| SECURITY_VIEWER | The SECURITY_VIEWER role provides visibility into security based information. |\n ... \nSection Title: Account Usage ¶ > ... > Database role required to access ACCOUNT_ USAGE views ¶\nContent:\n| View | Database Role |\n| ACCESS_HISTORY view | GOVERNANCE_VIEWER |\n| APPLICATION_CONFIGURATIONS view | SECURITY_VIEWER |\n| AGGREGATE_ACCESS_HISTORY view | GOVERNANCE_VIEWER |\n| AGGREGATE_QUERY_HISTORY view | GOVERNANCE_VIEWER |\n| STORAGE_LIFECYCLE_POLICY_HISTORY view | GOVERNANCE_VIEWER |\n| STORAGE_USAGE view | USAGE_VIEWER |\n| TABLE_CONSTRAINTS view | OBJECT_VIEWER |\n| TABLE_DML_HISTORY view | USAGE_VIEWER |\n| TABLE_PRUNING_HISTORY view | USAGE_VIEWER |\n| TABLE_QUERY_PRUNING_HISTORY view | USAGE_VIEWER |\n| TABLE_STORAGE_METRICS view | USAGE_VIEWER |\n| TABLES view | OBJECT_VIEWER |\n| TAG_REFERENCES view | GOVERNANCE_VIEWER |\n| TAGS view | OBJECT_VIEWER or GOVERNANCE_VIEWER |\n| TASK_HISTORY view | USAGE_VIEWER |\n| TRUST_CENTER_FINDINGS view | SECURITY_VIEWER |\n| USERS view | SECURITY_VIEWER |\n| VIEWS view | OBJECT_VIEWER |\n| WAREHOUSE_EVENTS_HISTORY view | USAGE_VIEWER |\n ... \nSection Title: Account Usage ¶ > Privacy Preference Center > Your Privacy > Functional Cookies\nContent:\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\nCookies Details‎"]},{"url":"https://docs.snowflake.com/en/collaboration/provider-listings-workflows","title":"Provider workflows | Snowflake Documentation","excerpts":["[DOCUMENTATION](https://docs.snowflake.com)\n/\nGet started\nGuides\nDeveloper\nReference\nRelease notes\nTutorials\n[Status](https://status.snowflake.com)\nGuides Listings Snowflake Marketplace listings Use listings as a provider Provider workflows\nSection Title: Provider workflows ¶\nContent:\nThis section describes the workflows that providers follow to become a Snowflake Marketplace provider and to offer data/share listings and Snowflake Native App listings on Snowflake Marketplace.\nSection Title: Provider workflows ¶ > Provider approval process ¶\nContent:\nThe image below shows the approval process for becoming a Snowflake Marketplace provider. The steps below the image describe the actions that providers take when following the workflow.\nIf you don’t have one already, [create a Snowflake account](https://signup.snowflake.com) .\nConfigure your provider profile.For more information, see Manage your provider profile .\nIn the navigation menu, select Marketplace » Provider Studio .\nSelect the Profiles tab.\nSelect + Create profile » External profile .\nSubmit your profile for approval.\nSnowflake will review your profile and respond to you within approximately 1 business day.\n ... \nSection Title: Provider workflows ¶ > Snowflake Native App listing approval flow ¶\nContent:\nThe image below shows the approval process for a Snowflake Native App listing on Snowflake Marketplace. The steps below the image describe the actions that providers take when following the workflow.\nNote\nSnowflake recommends that you test your application by privately sharing it with another account prior to submitting for publishing. This may expedite the review process.\nSection Title: Provider workflows ¶ > Snowflake Native App listing approval flow ¶\nContent:\nCreate a Snowflake Native App package.For more information, see Tutorial 1: Create a basic Snowflake Native App . To initiate an automated security scan, set the DISTRIBUTION property for the application package to `EXTERNAL` . If the automated security scan fails, Snowflake will perform a manual security review that can take approximately 3 business days. If the Snowflake Native App uses Snowpark Container Services (SPCS), then you must complete a [security questionnaire](https://docs.google.com/forms/d/1XLjbcSrp689kXEvVELa6KbEUOPfsJIirSTG5pGQDMZE/viewform?ts=65fb4866&edit_requested=true) . After the questionnaire is approved, the automated security scan starts. Create a listing and submit it for approval.For more information, see Publish an app to consumers .\nSection Title: Provider workflows ¶ > Snowflake Native App listing approval flow ¶\nContent:\nSnowflake reviews the listing metadata and conducts a functional review of the Native App, ensuring that it meets all Snowflake Marketplace enforced requirements . If your listing is approved, it will then be published and available on Snowflake Marketplace.NoteIf you submitted your listing using manual publishing, the listing will not be published. The listing will remain approved until you manually publish the listing. For more information, see Submit your listing for approval . If your listing is rejected, Snowflake will reach out using the emails listed in the profile contacts (business and technical) with feedback on the application. Reviews may take up to 14 days.\nSection Title: Provider workflows ¶ > Snowflake Native App listing approval flow ¶\nContent:\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nSupplemental Documentation\nAdditional terms of use may apply to features listed on this page.\nOn this page\nProvider approval process\nData/share listing approval flow\nSnowflake Native App listing approval flow\nRelated content\nLegal requirements for providers and consumers of listings\nManage your provider profile\n[Snowflake Marketplace provider playbook](https://www.snowflake.com/wp-content/uploads/2023/08/sm-provider-playbook-extended-ver.pdf)\nLanguage: **English**\nEnglish\nFrançais\nDeutsch\n日本語\n한국어\nPortuguês"]},{"url":"https://medium.com/infostrux-solutions/unlocking-secure-scalable-retail-insights-with-snowflake-native-apps-a50988638cad","title":"Unlocking Secure, Scalable Retail Insights With Snowflake Native Apps | by Stéphane Burwash | Feb, 2026 | Infostrux Engineering Blog","publish_date":"2026-02-25","excerpts":["Section Title: Unlocking Secure, Scalable Retail Insights With Snowflake Native Apps\nContent:\n[](https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fbookmark%2Fp%2Fa50988638cad&operation=register&redirect=https%3A%2F%2Fblog.infostrux.com%2Funlocking-secure-scalable-retail-insights-with-snowflake-native-apps-a50988638cad&source=---header_actions--a50988638cad---------------------bookmark_footer------------------)\nListen\nShare\nPress enter or click to view image in full size\nRetail and Consumer product organizations sit on a wealth of data. From POS (Point-of-Sale) systems and loyalty programs to e-commerce, promotions, and inventory management, they’re basically drowning in it. While this may seem advantageous, as anyone who has ever gone to a restaurant with a seven-page menu will attest, having too much information can be more jarring than helpful.\nExtracting valuable insights from a fragmented ecosystem of tools is a difficult, time-consuming and costly task.\n ... \nSection Title: ... > The Challenge — Data Governance in Large Retail Organizations\nContent:\nData governance is a structured approach to managing, organizing and controlling data assets within an organization. This includes establishing guidelines and procedures to ensure data quality, security and compliance.[- Snowflake Data Governance Documentation](https://www.snowflake.com/en/fundamentals/data-governance/)\nFusion’s data platform is built in large part on Snowflake and has been optimized to process and refine retail data at scale.\nIn most cases, clients securely provide their raw data to Fusion, which performs all transformations inside Fusion’s Snowflake environment. However, not all organizations can or are willing to share raw data with external organizations.\nMany retailers and CPGs operate under strict data-governance and compliance requirements. For these organizations, raw data, and especially transaction-level or customer-identifiable data, cannot leave their environment under any circumstances.\n ... \nSection Title: ... > The Solution — Native App Toolkits\nContent:\nSnowflake Native Apps allow providers (like Fusion) to package code, logic, interfaces, and secure data access into a single deployable application that runs directly within a client’s Snowflake environment. You can find some [common examples](https://app.snowflake.com/marketplace/listing/GZTYZND0ABB/infostrux-solutions-inc-infostrux-cost-optimization?search=infostrux) and [Snowflake-built apps](https://app.snowflake.com/marketplace/listing/GZSTZ67BY9OQ4/snowflake-snowflake-documentation?search=cortex+knowledge+extension) in the Snowflake Marketplace.\nGranular access can be granted to the Native Application only for the specific data it requires, and no data is exposed outside the account without the client’s explicit knowledge or consent.\n ... \nSection Title: Unlocking Secure, Scalable Retail Insights With Snowflake Native Apps > For Both:\nContent:\n**Faster Onboarding:** Reduced setup time means less time lost on both sides.\nHaving an audited, trustworthy solution that executes in-network without exposing its IP is valuable for both Fusion and its clients.\nSection Title: Unlocking Secure, Scalable Retail Insights With Snowflake Native Apps > Business Impact\nContent:\nWhile still in its early stages of rollout, this initiative will impact Fusion Analytics in several meaningful ways:\n**Increased Win Rate and Access to a broader market** by removing security-related objections during the sales cycle.\n**Reduced Onboarding Timelines** for Snowflake-based clients, enabling faster time-to-value.\n**Reduce the Time Spent** on projects run in Fusion’s Snowflake environment by reducing setup time and minimizing maintenance requirements.\nIn effect, Native Apps enable Fusion to scale its business without compromising client trust and can also boost internal efficiency.\nSection Title: Unlocking Secure, Scalable Retail Insights With Snowflake Native Apps > Conclusion\nContent:\nThere are a couple of things that make working on a project fun:\n**A great team** that is motivated, interested, and driven to complete the project.\n**A clear and engaging objective** , utilizing fun technologies or tackling an interesting problem.\n**A clear value proposition** , where you know that the work you are doing is meaningful and impactful.\nWith the Fusion Native App, we had the opportunity to have all of these:\nA great team (shoutout to Amir Reza, Stephen, and Chris).\nAn engaging objective (working with Native Applications is always interesting).\nA clear value proposition (for both revenue expansion externally and time savings internally.\nThis truly cements it as a great project and opportunity for all parties involved.\nThe Native Application toolkit initiative provided us with a glimpse of the potential of such an application, branching out into new markets and delving into the world of GenAI."]},{"url":"https://docs.snowflake.com/en/sql-reference/account-usage/views","title":"VIEWS view | Snowflake Documentation","excerpts":["[DOCUMENTATION](https://docs.snowflake.com)\n/\nGet started\nGuides\nDeveloper\nReference\nRelease notes\nTutorials\n[Status](https://status.snowflake.com)\nOverview\nSQL data types reference\nSQL command reference\nFunction and stored procedure reference\nClass reference\nScripting reference\nGeneral reference\nAPI reference\nReference General reference SNOWFLAKE database Account Usage VIEWS\nSchema:\nACCOUNT_USAGE\nSection Title: VIEWS view ¶\nContent:\nThis Account Usage view displays a row for each view in the account, not including the views in the ACCOUNT_USAGE, READER_ACCOUNT_USAGE, and INFORMATION_SCHEMA schemas.\nSee also:\nTABLES view\nSection Title: VIEWS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| TABLE_ID | NUMBER | Internal/system-generated identifier for the view. |\n| TABLE_NAME | VARCHAR | Name of the view. |\n| TABLE_SCHEMA_ID | NUMBER | Internal/system-generated identifier for the schema that the view belongs to. |\n| TABLE_SCHEMA | VARCHAR | Schema that the view belongs to. |\n| TABLE_CATALOG_ID | NUMBER | Internal/system-generated identifier for the database that the view belongs to. |\n| TABLE_CATALOG | VARCHAR | Database that the view belongs to. |\n| TABLE_OWNER | VARCHAR | Name of the role that owns the view. |\n| VIEW_DEFINITION | VARCHAR | Text of the query expression for the view. |\n| CHECK_OPTION | VARCHAR | Not applicable for Snowflake. |\n| IS_UPDATABLE | VARCHAR | Not applicable for Snowflake. |\n| INSERTABLE_INTO | VARCHAR | Not applicable for Snowflake. |\n| IS_SECURE | VARCHAR | Specifies whether the view is secure. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the view was created. |\nSection Title: VIEWS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| TABLE_ID | NUMBER | Internal/system-generated identifier for the view. |\n| TABLE_NAME | VARCHAR | Name of the view. |\n| TABLE_SCHEMA_ID | NUMBER | Internal/system-generated identifier for the schema that the view belongs to. |\n| TABLE_SCHEMA | VARCHAR | Schema that the view belongs to. |\n| LAST_ALTERED | TIMESTAMP_LTZ | Date and time the object was last altered by a DML, DDL, or background metadata operation. See Usage Notes . |\n| LAST_DDL | TIMESTAMP_LTZ | Timestamp of the last DDL operation performed on the table or view. |\nSection Title: VIEWS view ¶ > Columns ¶\nContent:\nAll supported table/view DDL operations update this field:\n{ CREATE | ALTER | DROP | UNDROP } TABLE\n{ CREATE | ALTER | DROP } VIEW\nAll ALTER TABLE operations update this field, including setting or unsetting a table parameter (for example, COMMENT,\nDATA_RETENTION_TIME, etc.) and changes to table columns (ADD / MODIFY / RENAME / DROP).\nFor more information, see the Usage Notes . |\n|LAST_DDL_BY |VARCHAR |The current username for the user who executed the last DDL operation. If the user has been dropped, shows `DROPPED_USER(<id>)` .\nSection Title: VIEWS view ¶ > Columns ¶\nContent:\nFor dropped users, you can join the `<id>` with the USER_ID column in the USERS view of the ACCOUNT_USAGE or ORGANIZATION_USAGE schema. |\n|DELETED |TIMESTAMP_LTZ |Date and time when the view was deleted. |\n|COMMENT |VARCHAR |Comment for the view. |\n|INSTANCE_ID |NUMBER |Internal/system-generated identifier for the instance which the object belongs to. |\n|OWNER_ROLE_TYPE |VARCHAR |The type of role that owns the object, for example `ROLE` . . If a Snowflake Native App owns the object, the value is `APPLICATION` . . Snowflake returns NULL if you delete the object because a deleted object does not have an owner role. |\nSection Title: VIEWS view ¶ > Usage notes ¶\nContent:\nLatency for the view may be up to 90 minutes.\nThe view does not recognize the MANAGE GRANTS privilege and consequently may show less information compared to a SHOW command\nexecuted by a user who holds the MANAGE GRANTS privilege.\nThe LAST_ALTERED column is updated when the following operations are performed on an object:For views and tables, use the LAST_DDL column for the last modification time for an object.\nDDL operations.\nDML operations (for tables only). This column is updated even when no rows are affected by the DML statement.\nBackground maintenance operations on metadata performed by Snowflake.\nThe value in the LAST_DDL column is updated as follows:\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\nSection Title: VIEWS view ¶ > Usage notes ¶\nContent:\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nColumns\nUsage notes\nLanguage: **English**\nEnglish\nFrançais\nDeutsch\n日本語\n한국어\nPortuguês"]},{"url":"https://www.snowflake.com/en/product/features/native-apps/","title":"Snowflake Native Apps","excerpts":["Section Title: ... > How Snowflake’s Native App Simplifies Technical Orchestration for My Data Outlet Customers ...\nContent:\nOverview:\nSnowflake Native Apps\n[](https://www.snowflake.com/snowflake-native-app-bootcamp/?utm_cta=website-solution-native-apps-timely-content-snowflake-native-app-bootcamp)\nSection Title: Snowflake Native Apps > ... > Snowflake Native App Bootcamp\nContent:\nLearn how the Snowflake Native App Framework enables you to build, market, monetize, and distribute apps to customers across the AI Data Cloud in this comprehensive 120 minute bootcamp.\n[register today](https://www.snowflake.com/snowflake-native-app-bootcamp/?utm_cta=website-solution-native-apps-timely-content-snowflake-native-app-bootcamp)\nSection Title: Snowflake Native Apps > Build Faster, Deploy More Easily, Operate Effortlessly\nContent:\nAvoid the complex costs that come from multiple services and the manual expertise required to optimize. Switch to a fully managed service to efficiently support users and workload while reducing time and effort.* With Snowflake Native App Framework’s support for Snowpark Container Services,** you can bring sophisticated logic, AI/ML models and compute to your app, and boost your development time to value.\n**Snowflake Native App Framework in general availability on AWS, Azure and GCP* ***In general availability on AWS, public preview on Azure*\nSection Title: Snowflake Native Apps > ... > Snowflake Native App Developer Toolkit\nContent:\nGet immediate access to these exclusive app dev resources plus links to bootcamps, community forums and more.\n[access now](https://www.snowflake.com/snowflake-native-app-developer-toolkit/?utm_cta=workload-page-native-apps)\nSection Title: Snowflake Native Apps > Secured Data + Controlled Code = Accelerated Adoption\nContent:\nSince a Snowflake Native App runs in the customer's account, there is no need for customers to move or provide external access to their data. This results in happier security teams, reduced procurement hurdles and faster time to value for customers.\nSection Title: ... > How Snowflake Native App Helps DTCC Bring Hypothetical Market Scenarios to Customers Read More\nContent:\nExplore Snowflake\nNative Apps\n[](https://app.snowflake.com/marketplace/providers/GZT0ZBEKCNO/Affinity%20Solutions)\n[](https://app.snowflake.com/marketplace/providers/GZT0ZQP41EE/Capital%20One%20Software)\n[](https://app.snowflake.com/marketplace/providers/GZTSZAS2KCS/Cybersyn%2C%20Inc)\n[](https://app.snowflake.com/marketplace/providers/GZT0Z11US76L/LiveRamp)\n[](https://app.snowflake.com/marketplace/providers/GZTSZY7HHV6/Maxa)\n[](https://app.snowflake.com/marketplace/providers/GZTSZ67EU4B/My%20Data%20Outlet)\n[](https://app.snowflake.com/marketplace/providers/GZTYZT5BVG/Sundeck)\n[](https://app.snowflake.com/marketplace/providers/GZSYZMNVC6/SNP)\n[explore app listings](https://app.snowflake.com/marketplace?shareType=application)\nSection Title: Snowflake Native Apps > Developer Quickstarts\nContent:\nFollow along with Snowflake's Quickstart Tutorials to get you up and running with Snowflake Native Apps or join the Snowflake Native Apps Forum to connect with other developers.\n[snowflake native apps forum](https://snowflake.discourse.group/c/snowflake-native-apps/26)\n[##### Build a Snowflake Native App to analyze chairlift sensor data View Quickstart](https://quickstarts.snowflake.com/guide/native-app-chairlift/index.html?index=..%2F..index)\n[##### Build a native push-based Java connector View Quickstart](https://quickstarts.snowflake.com/guide/connectors_example_push_based_java)\n[##### Build a native Github connector with Python View Quickstart](https://quickstarts.snowflake.com/guide/connectors_github_python/)\n[##### Map Data in Snowflake Native Apps using Streamlit View Quickstart](https://quickstarts.snowflake.com/guide/data_mapping_in_native_apps/index.html?index=..%2F..index)\nSection Title: Snowflake Native Apps > Developer Quickstarts\nContent:\n[##### Build a native Github connector with Java View Quickstart](https://quickstarts.snowflake.com/guide/connectors_github_java)\n[##### Get started with Snowflake Native Apps View Quickstart](https://quickstarts.snowflake.com/guide/getting_started_with_native_apps/)\n ... \nSection Title: Snowflake Native Apps > Where Data Does More\nContent:\n30-day free trial\nNo credit card required\nCancel anytime\n[start for free](https://signup.snowflake.com/)\nwatch a demo\n**Subscribe to our monthly newsletter** Stay up to date on Snowflake’s latest products, expert insights and resources—right in your inbox!\nLearn * Resource Library\nLive Demos\nFundamentals\nTraining\nCertifications\nSnowflake University\nDeveloper Guides\nDocumentation\nPrivacy Policy\nSite Terms\nCommunication Preferences\nCookie Settings\nDo Not Share My Personal Information\nLegal\n[](https://x.com/Snowflake \"X (Twitter)\")\n[](https://www.linkedin.com/company/3653845 \"LinkedIn\")\n[](https://www.facebook.com/snowflakedb/ \"Facebook\")\n[](https://www.youtube.com/user/snowflakecomputing \"YouTube\")"]}],"usage":[{"name":"sku_search","count":1}]}
