{"extract_id":"extract_258c57c6ed1d44babc257744b0a6f2f6","results":[{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/ui-consumer-about","title":"Use and manage Snowflake Native Apps as a consumer | Snowflake Documentation","publish_date":null,"excerpts":["Guides Listings Snowflake Marketplace listings Use applications as a consumer\n\n# Use and manage Snowflake Native Apps as a consumer ¶\n\n Feature — Generally Available\n\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\n\nConsumers can discover and install apps published to the Snowflake Marketplace or shared\nusing private listings.\n\nThe Native Apps Framework allows consumers to perform the following:\n\n* Use the app by accessing data via Snowflake worksheets.\n* View Streamlit apps created by the provider.\n* Grant privileges on the app object to users in your organization.\n* Associate references that allow access to object required by the app.\n* Share event and logging information with the provider.\n\n## Consumer workflow for working with a Snowflake Native App ¶\n\nThe following workflow is what consumers typically do when working with apps:\n\n1. Become a consumer .\n2. Install an app from a listing .\n3. Review the access requests from the app .\n   \n   This includes granting the privileges and creating references required by the app.\n4. (Optional) Set up an event table to enable logging and\n   event sharing for an app.\n\n## Apps installed from trial listings ¶\n\nWhen the trial period ends for an app installed from a trial listing, Snowflake\nautomatically suspends the app unless the consumer converts the app to a full listing.\nWhen the trial period is about to expire, Snowflake sends an email notification before the app is\nsuspended.\n\nSnowflake recommends that consumers convert the trial listing into a full listing before the\ntrial period expires. After the app is suspended it may not be possible to resume the app. For example,\nif the provider removes the current version of the app or there are unresolved state changes, the\napp cannot be resumed.\n\nWhen an app installed from a trial listing is suspended, all data written inside the app is retained\nas long as the consumer does not delete the app.\n\nIf the app installed from a trial listing creates objects in the consumer account outside\nthe application object, consumers can retain these objects after the app is uninstalled. However, they\nmust transfer ownership of the objects before uninstalling the app. See Uninstall a Snowflake Native App .\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Consumer workflow for working with a Snowflake Native App\n2. Apps installed from trial listings\n\nRelated content\n\n1. Install an app from a listing\n2. Manage apps\n3. Allow access to a consumer account\n4. Set up event tracing for an app"],"full_content":null},{"url":"https://other-docs.snowflake.com/en/native-apps/consumer-enable-logging","title":"Set up event tracing for an app | Snowflake Documentation","publish_date":null,"excerpts":["Guides Listings Snowflake Marketplace listings Use applications as a consumer Set up event tracing for an app\n\n# Set up event tracing for an app ¶\n\n Feature — Generally Available\n\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\n\nThis topic describes how to set up use event tracing to capture the log messages and trace events\nemitted by an app. It also describes how to enable event sharing to share log messages and trace events\nwith providers.\n\n## About event tracing in the Snowflake Native App Framework ¶\n\nEvent tracing allows an app to emit information related to its performance and behavior. The Snowflake Native App Framework\nsupports using the Snowflake logging and tracing .\nfunctionality to gather this information. An app can emit the following:\n\n* Log messages that are independent, detailed messages with information about the state of a specific\n  feature within the app.\n* Trace events with structured data you can use to get information spanning and grouping multiple\n  parts of an app.\n* Metrics data that includes the CPU and memory metrics that Snowflake generates.\n\n### View the log messages, trace events, and metrics for an app ¶\n\nTo view the log messages and trace events emitted by the app, consumers must set up an event table in\ntheir account to collect this information. See Set up an event table for more information.\n\n## About event sharing ¶\n\nConsumers can also enable event sharing to share event data with providers. When a provider enables\nevent sharing, the log messages and trace events that are inserted into the event table in\nthe consumer account are also inserted into an event table in provider account.\n\nEvent sharing allows the provider to collect information about the app’s performance and behavior. See About event sharing for an app for more information.\n\n### About event definitions ¶\n\nEvent definitions specify how an app shares log messages and trace events with the provider.\nEvent definitions act as filters on the log message and trace event levels set by the provider.\nA provider specifies the event definitions for an app when a new version or patch is published.\n\nNote\n\nEvent definitions are not required. If a provider does not specify event definitions for an app\nconsumers can enable or disable event sharing as required.\n\nProviders can set an event definition to be required or optional:\n\n* Required event definitions are enabled automatically when the app is installed. To collect the\n  event definitions emitted by an app, a consumer should create an event table and set it as\n  the active event table for their account.\n* Optional event definitions can be enabled or disable by the consumer as necessary. Optional event\n  definitions require an active event table, but they are not required to install or use the app.\n\nCaution\n\nEvent definitions are not the same as the log and tracing levels set by the provider. The log and\ntracing levels determine the information that is inserted into the consumer event table.\n\nEvent definitions are filters that act on the log messages and trace events. They determine what\ninformation is inserted in the provider event table when event sharing is enabled.\n\n### Supported event definitions ¶\n\nThe following table lists the event definitions that are currently supported:\n\n> |Type |Name |Description |Filter |\n> | --- | --- | --- | --- |\n> |All |SNOWFLAKE$ALL |Shares all log messages and trace events that the app emits. |`*` |\n> |Errors and warnings |SNOWFLAKE$ERRORS\\_AND\\_WARNINGS |Shares logs related to errors, warnings, and fatal events. |`RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘FATAL’, ‘ERROR’, ‘WARN’)` |\n> |Metrics |SNOWFLAKE$METRICS |Shares the CPU and memory metrics that Snowflake generates. |`RECORD_TYPE = in ('METRIC')` |\n> |Traces |SNOWFLAKE$TRACES |Shares detailed traces of user activities and journeys in the application. |`RECORD_TYPE in (‘SPAN’, ‘SPAN_EVENT’)` |\n> |Usage logs |SNOWFLAKE$USAGE\\_LOGS |Shares high-level logs related to user actions and app events. |`RECORD_TYPE = LOG AND RECORD:severity_text = ‘INFO’` |\n> |Debug logs |SNOWFLAKE$DEBUG\\_LOGS |Shares technical logs used to troubleshoot the app. |`RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘DEBUG’, ‘TRACE’)` |\n> \n> \n\nNote\n\nIf a provider does not configure the app to use event definitions, Snowsight displays only the All type.\n\n### Considerations for consumers when using event definitions ¶\n\nConsumers can continue to use the existing SHARE\\_EVENTS\\_WITH\\_PROVIDER property, however there\nare limitations:\n\n* If an app only uses the OPTIONAL ALL event definition, setting the SHARE\\_EVENTS\\_WITH\\_PROVIDER property\n  to `true` enables event sharing and setting it to `false` disables event sharing.\n  \n  This is applicable when a provider explicitly adds the OPTIONAL ALL event definition to the manifest\n  file or an app was migrated from the existing event sharing functionality.\n* If a provider adds mandatory and optional event definitions to the manifest file, setting the\n  SHARE\\_EVENTS\\_WITH\\_PROVIDER property to `true` enables all event definitions. In contrast, the\n  SHARE\\_EVENTS\\_WITH\\_PROVIDER property can only be set to `false` if the provider adds only\n  optional event definitions.\n  \n  SHARE\\_EVENTS\\_WITH\\_PROVIDER is TRUE only when all event definitions are enabled, otherwise it is FALSE.\n\n## Workflow to set up event tracing for an app ¶\n\nThe following workflow describes how to set up event tracing for an app:\n\n1. Review the considerations for using logging and event tracing .\n2. Set up an event table .\n3. View the logging and trace event levels configured for the app .\n4. View the events in the event table .\n5. Enable event sharing on an app .\n\n## Considerations when using event tracing ¶\n\nBefore setting up event tracing for an app, you must consider the following:\n\n* This feature requires you to set up an event table in\n  your account.\n* After you enable event sharing , a masked and redacted\n  copy of the trace events and logs messages is automatically inserted in the event table of the designated\n  provider account.\n* Snowflake does not charge you to enable event sharing. However, you are responsible for the\n  cost of ingesting trace events and log message in the event table as well as storage\n  costs for the event table.\n* After enabling event sharing with a provider, you cannot revoke access to shared\n  trace events and log messages.\n* You cannot share historical events using event sharing.\n* Snowflake sends the shared events to a designated provider account within the same region as your account.\n  This feature does not share data across different regions.\n* You cannot change the logging or tracing levels for an app. The app provider sets these levels\n  when publishing the app.\n* Snowflake recommends reviewing the trace events and log messages in the event table before enabling\n  event sharing.\n* Snowflake recommends disabling event sharing if you do not need to troubleshoot the app.\n\n## Set up an event table ¶\n\nTo collect the log messages and trace events emitted by the app, consumers must create an event table to\nstore the information.\n\nNote\n\nIF the consumer does not set up an event table and make it the active event table before installing the\napp, trace event and log data is discarded.\n\nIf a provider includes required event definitions in the app, they are enabled by default during\ninstallation. However, if the consumer does not have an active event table, the log messages and\ntrace events emitted by the app are discarded.\n\nAn account can have multiple event tables, but only one of them can be set as the active event table in a\nSnowflake account at a time. Without an active event table, log messages and trace events that the app emits\nare not captured. This is true even if the functions and procedures in an app call the logging and trace\nevent APIs directly.\n\nTo create an event table, run the CREATE EVENT TABLE command as shown in the following example:\n\n```\nCREATE EVENT TABLE event_db . event_schema . my_event_table ;\n```\n\nCopy\n\nNote that this command specifies the database and schema that contain the event table.\n\nAfter creating the event table, use the ALTER ACCOUNT command to\nspecify that the event table is the active table for the account:\n\n```\nALTER ACCOUNT SET EVENT_TABLE = event_db . event_schema . my_event_table ;\n```\n\nCopy\n\n## Enable event sharing for an app ¶\n\nThe Snowflake Native App Framework supports sharing log messages and trace events stored in the consumer event table with the\napp provider. To share logs and event information with a provider, the consumer must enable event\nsharing for an app.\n\n### Prerequisites for enabling event sharing for an app ¶\n\nThe following prerequisites must be met to enable event sharing for an app instance:\n\n* Use a role with the MANAGE EVENT SHARING global privilege. The ACCOUNTADMIN role has this privilege by\n  default and can grant it to other roles.\n* Set up an event table in the consumer account .\n\n### Enable event sharing using Snowsight ¶\n\nNote\n\nIf the provider includes required event definitions in the app, event sharing and the required event definitions are enabled during installation and\ncannot be disabled later.\n\n2. In the navigation menu, select Catalog » Apps .\n3. Select the app.\n4. Select the Settings icon in the toolbar.\n5. Select the Events and logs tab.\n6. Under the Events and logs sharing area, move the slider for the events you want to capture.\n7. If the provider has defined event definitions for the app:\n   \n    1. Use the slider to enable optional event definitions. By default, all event types are enabled.\n    2. Select Save .\n8. If no event table is currently selected, select the event table from the list\n   under Event table location .\n   \n   Caution\n   \n   Use caution when changing the event table in Snowsight. Each Snowflake account\n   uses a single event table for all events generated within the account. Changing the event\n   table causes all events generated in the account to be stored in the new location.\n\n### Enable event sharing by using SQL ¶\n\n1. Use the SHOW TELEMETRY EVENT DEFINITIONS command to determine the event definitions for the app:\n   \n   ```\n   SHOW TELEMETRY EVENT DEFINITIONS IN APPLICATION hello_snowflake ;\n   ```\n   \n   Copy\n   \n   If the provider did not configure the app to use event definitions, the `type` column\n   displays `ALL` . Otherwise, this command lists the optional event definitions specified\n   for the app.\n2. If the app contains required event definitions, use the ALTER APPLICATION command to\n   enable them:\n   \n   ```\n   ALTER APPLICATION hello_snowflake SET AUTHORIZE_TELEMETRY_EVENT_SHARING = true\n   ```\n   \n   Copy\n   \n   This command enables all of the require event definitions, but does not enable optional event\n   definitions.\n   \n   Note\n   \n   After enabling the required event definitions for an app, event sharing cannot be disabled.\n3. If the app contains options event definitions, use the use the ALTER APPLICATION to enable them as shown in the following example:\n   \n   ```\n   ALTER APPLICATION hello_snowflake SET SHARED TELEMETRY EVENTS ( 'SNOWFLAKE$TRACES' , 'SNOWFLAKE$DEBUG_LOGS' );\n   ```\n   \n   Copy\n   \n   This example enables the `SNOWFLAKE$TRACES` and `SNOWFLAKE$DEBUG_LOGS` based on the output of the SHOW TELEMETRY EVENT DEFINITIONS command.\n4. To verify that event tracing and logging is enabled, use the DESCRIBE APPLICATION command:\n   \n   ```\n   DESC APPLICATION hello_snowflake ;\n   ```\n   \n   Copy\n   \n   The `authorize_telemetry_event_sharing` and `share_events_with_provider` rows of the output\n   indicate if event sharing is enabled.\n\n### Enable event sharing using SQL (deprecated functionality) ¶\n\nCaution\n\nThe method of enabling event sharing using SQL described in this section will be deprecated\nin a future release. Snowflake recommends using the method described in Enable log and event sharing using SQL to enable event sharing using SQL.\n\nTo enable event sharing for an app, run the ALTER APPLICATION command to set\nSHARE\\_EVENTS\\_WITH\\_PROVIDER to `TRUE` . For example:\n\n```\nALTER APPLICATION HelloSnowflake SET SHARE_EVENTS_WITH_PROVIDER = TRUE ;\n```\n\nCopy\n\nTo show the event sharing status for an app, use the DESCRIBE APPLICATION command as shown in the following example:\n\n```\nDESC APPLICATION HelloSnowflake ;\n```\n\nCopy\n\n`SHARE_EVENTS_WITH_PROVIDER` shows the status of event sharing for the app.\n\n## Enable event definitions during upgrades ¶\n\nDuring upgrades, event definitions behave as follows:\n\n> |Change to event definition |Behavior during upgrade |\n> | --- | --- |\n> |No change to an event definition |The event definition retains the same status as the previous version or patch. |\n> |A new event definition |Not enabled automatically. This is true for both required and optional event definitions.\n> The consumer must manually enable new event definitions. |\n> |Changes from required to optional or optional to required |The event definition retains the same status as the previous version or patch. |\n> |Deleted event definition |Event sharing stops after upgrade for log messages or trace events filter in the previous\n> version or patch. |\n> \n> \n\nDuring upgrade, consumers are prompted to review the changes to event definitions from the previous patch or\nversion.\n\n## View the log messages and trace events in the event table ¶\n\nWhen an event table is enabled, consumers can query the event table to see the log messages and\ntrace events emitted by the app.\n\n### View the event log messages and trace events by using Snowsight ¶\n\n2. In the navigation menu, select Catalog » Apps .\n3. Select the app.\n4. In the toolbar, select Settings .\n5. Select the App events tab.\n6. In the Event logging section, select View logs .\n\nThis opens a new worksheet with a pre-populated SELECT statement that displays the log messages\nand trace events for the app.\n\n### View the event log messages and trace events by using SQL ¶\n\nUse the SELECT command to query the\nevent log messages and trace events, as shown in the following example:\n\n```\nSELECT \n  TIMESTAMP as time , \n  RESOURCE_ATTRIBUTES [ 'snow.executable.name' ] as executable , \n  RECORD [ 'severity_text' ] as severity , \n  VALUE as message \n FROM \n  \"EVENT_LOG\" . \"PUBLIC\" . \"CONSUMER_EVENT_TABLE\" \n WHERE RESOURCE_ATTRIBUTES [ 'snow.application.name' ] = 'YOUR_APP_NAME'\n```\n\nCopy\n\nThis command returns all of the log messages and trace events stored in the event table `CONSUMER_EVENT_TABLE` for an app named `YOUR_APP_NAME` .\n\n### Determine if a log message or trace event is shared with the provider ¶\n\nThe RECORD\\_ATTRIBUTES column contains the `snow.application.shared` field. If the value of\nthis field is TRUE, the log message or trace event is shared with the provider. Otherwise,\nthe log message or event is not shared.\n\n## View the log and trace levels for an app ¶\n\nThe log and trace level of an app are defined by the provider before publishing an app.\nConsumers cannot change the log and trace levels for an app.\n\nHowever, before setting up event tracing or enabling event sharing for an app, Snowflake\nrecommends verifying the log level to understand the type of information that collected\nand shared with the provider.\n\nTo view the log and trace level of an app, run the following command:\n\n```\nDESC APPLICATION HelloSnowflake ;\n```\n\nCopy\n\nThis command displays information about the `HelloSnowflake` app, including the following information\nabout the log and trace level set for the app:\n\n* log\\_level: The log level set by the provider.\n* trace\\_level: The trace level set by the provider.\n* metric\\_level: The metric data level set by the provider.\n* effective\\_log\\_level: The log level set for the app.\n* effective\\_trace\\_level: The trace level enabled for the app.\n\nThe effective log and trace levels are determined by the event definitions the consumer enables for the app.\n\nFor example, if the provider defines the log level as OFF, but consumer enables the ERROR\\_AND\\_WARNING event\ndefinition, the app dynamically changes log level to WARN so that ERROR\\_AND\\_WARNING events can be collected. The app\nemits events that are less or equally as verbose as WARN and shares those error and warning events with the provider.\nThe values of `log_level` would be OFF and the value of `effective_log_level` would be WARN.\n\nIn contrast, if the provider defines the log level as TRACE, but the consumer enables the ERROR\\_AND\\_WARNING\nevent definition, the app emits events that are less or equally as verbose as trace, but only error and warning\nmessages are shared with the provider. The value of both log\\_level and effective\\_log\\_level would be TRACE.\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)"],"full_content":null},{"url":"https://docs.snowflake.com/en/developer-guide/declarative-sharing/monitoring","title":"Monitoring Usage with Declarative Sharing in the Native Application Framework | Snowflake Documentation","publish_date":null,"excerpts":["Developer Snowflake Declarative Sharing Monitoring\n\n# Monitoring Usage with Declarative Sharing in the Native Application Framework ¶\n\n Feature — Generally Available\n\nSupport for Snowflake Declarative Native Apps is available to all accounts.\n\nAs a provider, you can monitor the usage of your Declarative Native App to gain insights into how consumers are interacting with your data product.\nThis topic describes the views available in Snowflake to track application usage, access history, and the current state of installed applications.\n\n## Monitor app usage ¶\n\nTo monitor the usage of your Declarative Native Apps, you can use the following views:\n\n* APPLICATION\\_DAILY\\_USAGE\\_HISTORY view .\n* LISTING\\_ACCESS\\_HISTORY view .\n* APPLICATION\\_STATE view .\n\nFor more information, see Data Sharing Usage .\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"],"full_content":null}],"errors":[],"warnings":[{"type":"warning","message":"Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.","detail":null}],"usage":[{"name":"sku_extract_excerpts","count":3}]}