{"extract_id":"extract_933ccf60e6624752a75ad77b2e905593","results":[{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/requesting-about","title":"Create and access objects in a consumer account | Snowflake Documentation","publish_date":"2026-01-01","excerpts":["Developer Snowflake Native App Framework Access objects in a consumer account\nSection Title: Create and access objects in a consumer account ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic describes how providers can develop a Snowflake Native App to create objects in the\nconsumer account or access existing objects.\nSection Title: ... > Overview of creating and accessing objects in a consumer account ¶\nContent:\nSnowflake Native Apps often need to create or access objects in a consumer account. For example,\neven a basic app that allows the consumer to query shared data would require the app\nto create and use a warehouse in the consumer account. An app may also need to connect to external\nservices that are outside Snowflake.\nThe Snowflake Native App Framework provides two ways of requesting privileges to create objects in the consumer account.\nSection Title: ... > Automatically granting privileges to an app ¶\nContent:\nThe Snowflake Native App Framework allows providers to request certain safe privileges and then grants them automatically. Providers add these privileges to the manifest file of the app. During installation or upgrade of the app, Snowflake automatically grants these privileges to the app.\nFor more information on configuring an app to have privileges granted automatically, see Configure the privileges required by an app .\nFrom the provider perspective, automated granting of privileges streamlines app development because the\napp does not have to determine if a consumer has granted the requested privileges or created the required\nobjects in their account.\nSection Title: ... > Automatically granting privileges to an app ¶\nContent:\nFrom the consumer perspective, automated granting of privileges simplifies app installation and configuration. However, it also gives the consumer less control by default over what an app can do in their account. To allow consumers more control over what an app can do, the Snowflake Native App Framework provides the following features:\nApp specifications :\nAllow consumers to control the external endpoints that an app can connect to. To access services outside\nSnowflake, an app may need to create an external access integration or service integration depending on\nthe type of service. Using automated granting of privileges, the app can create these objects in the\nconsumer account. However, an account admin of the consumer account must approve the app specification\nthat allows the app to perform the external connection.\nSection Title: ... > Automatically granting privileges to an app ¶\nContent:\nFor information on developing an app to use app specifications, see Overview of app specifications .\nFor information on how the consumer approves an app specification, see Approve app specifications .\nFeature policies :\nFeature policies allow consumers to override the automatic granting of privileges. Before installing or\nupgrading an app, consumers can create a feature policy to prohibit the app from creating specific types\nof objects. For example, a consumer may need to configure a feature policy to prohibit an app from creating a\nwarehouse. If an app attempts to create a warehouse during installation or upgrade, the installation fails.\nFor information on how a consumer creates feature policies, see Use feature policies to limit the objects an app can create .\nSection Title: Create and access objects in a consumer account ¶ > ... > Manually granting privileges to an app ¶\nContent:\nFor apps that were created before the release of automated granting of privileges , for example an app that was installed and does not\nhave the necessary privileges to create objects in the consumer account, consumers must manually grant\nprivileges to the app using SQL or Snowsight, depending on how the app is configured. For more\ninformation, see Request global privileges from consumers .\nSection Title: ... > Accessing existing objects in the consumer account ¶\nContent:\nIn some contexts an app needs to access existing objects in a consumer account that exist outside the app. For example, an app might need to access existing tables in a consumer database. To allow the app to create objects, the Snowflake Native App Framework uses references that enable the customer to specify the name and schema for an object and enable access to the object.\nFor more information, see Request references and object-level privileges from consumers .\nSection Title: Create and access objects in a consumer account ¶ > Comparison of automatic and manual privileges ¶\nContent:\n| App requirement | Automatically granting privileges | Manually granting of privileges |\n| Privileges to create objects | Apps have privileges to create objects, with some exceptions. | Consumers must explicitly grant privileges to the app using Snowsight or SQL. |\n| Access external services | Apps can create network rules and external access integrations. |  |\nSection Title: Create and access objects in a consumer account ¶ > Comparison of automatic and manual privileges ¶\nContent:\nConsumers must approve external access using app specifications. |Consumers must manually create the required network rules and external access integrations and\nbind the integration using references. |\n|Access external identity providers |Apps can create security integrations for external API Authentication.\nConsumers must approve the external connection using app specification. |Consumers must manually create the required security integrations and bind the integration\nwith references |\n|Access to existing objects |Providers must use references to access existing objects.\nConsumers approve access to the references. |Providers must use references to access existing objects.\nSection Title: Create and access objects in a consumer account ¶ > Comparison of automatic and manual privileges ¶\nContent:\nConsumers approve access to the references. |\n|App development |Providers do not have to write code to determine if the consumer has granted a certain privilege. |Providers must write code that checks if the consumer has granted a certain privilege. |\n|App installation |Consumers do not have to manually create objects or grant privileges. |Consumers must manually create objects in their account or explicitly grant privileges to the app\nusing Snowsight or SQL. |\nSection Title: ... > Security considerations when using auto privileges with app specifications ¶\nContent:\nApp specifications only control communications to endpoints outside\nSnowflake. Consumers can approve or decline app specifications to\nallow or prevent the app making connection to these endpoints.\nApp specifications do not prevent the app from creating\nSnowflake objects that control external connections: network rules,\nexternal access integrations, and security integrations. Privileges\nto create these objects are granted using automated granting of\nprivileges.\nApp specifications do not provide data validation. In addition,\nthey do not place any restrictions on secrets or tokens referenced\nby an external access integration or security integration.\nFor example, if a provider configures an external access integration\nof an app to use ALLOWED_AUTHENTICATION_SECRETS and the consumer\napproves the app specification for that integration, the app can later\nmodify the secrets and tokens that it uses.\nSection Title: ... > Security considerations when using auto privileges with app specifications ¶\nContent:\nHowever, if a provider modifies the app to use a different endpoint,\nthe sequence number of the app specification would change and the\nconsumer would need to re-approve or decline the new version.\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nOverview of creating and accessing objects in a consumer account\nComparison of automatic and manual privileges\nSecurity considerations when using auto privileges with app specifications\nRelated content\nAbout the Snowflake Native App Framework\nSection Title: Create and access objects in a consumer account ¶ > Privacy Preference Center\nContent:\nYour Opt Out Preference Signal is Honored\nYour Privacy\nStrictly Necessary Cookies\nPerformance Cookies\nFunctional Cookies\nTargeting Cookies\nSection Title: Create and access objects in a consumer account ¶ > Privacy Preference Center > Your Privacy\nContent:\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\nSection Title: Create and access objects in a consumer account ¶ > ... > Your Privacy > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎\nSection Title: Create and access objects in a consumer account ¶ > ... > Your Privacy > Performance Cookies\nContent:\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nCookies Details‎\nSection Title: Create and access objects in a consumer account ¶ > ... > Your Privacy > Functional Cookies\nContent:\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\nCookies Details‎\nSection Title: Create and access objects in a consumer account ¶ > ... > Your Privacy > Targeting Cookies\nContent:\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nCookies Details‎\nSection Title: Create and access objects in a consumer account ¶ > Privacy Preference Center > Cookie List\nContent:\nConsent Leg.Interest\ncheckbox label label\ncheckbox label label\ncheckbox label label\nClear\ncheckbox label label\nApply Cancel\nConfirm My Choices\nAllow All\n[](https://www.onetrust.com/products/cookie-consent/)"],"full_content":null},{"url":"https://www.snowflake.com/en/blog/collect-logs-traces-snowflake-apps/","title":"Collect Logs and Traces From Your Snowflake Applications","publish_date":"2024-08-21","excerpts":["blog\nSection Title: Category\nContent:\nAI/ML At Snowflake Partner & Customer Value Industry Solutions Product & Technology Strategy & Insights\nData Engineering\nOct 30, 2023 | 4 min read\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables\nContent:\nWe are excited to announce the general availability of Snowflake\nEvent Tables\nfor logging and tracing, an essential feature to boost application observability and supportability for Snowflake developers.\nIn our conversations with developers over the last year, we’ve heard that monitoring and observability are paramount to effectively develop and monitor applications. But previously, developers didn’t have a centralized, straightforward way to capture application logs and traces.\nEnter the new Event Tables feature, which helps developers and data engineers easily instrument their code to capture and analyze logs and traces for all languages: Java, Scala, JavaScript, Python and Snowflake Scripting.\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables\nContent:\nWith Event Tables, developers can instrument logs and traces from their UDFs, UDTFs, stored procedures, Snowflake Native Apps and Snowpark Container Services, then seamlessly route them to a secure, customer-owned Event Table. Developers can then query Event Tables to troubleshoot their applications or gain insights into performance and code behavior.\nLogs and traces are collected and propagated via Snowflake’s telemetry APIs, then automatically ingested into your Snowflake Event Table.\nSection Title: ... > Simplify troubleshooting in Snowflake Native Apps\nContent:\nEvent Tables are also supported for Snowflake Native Apps. When a Snowflake Native App runs, it is running in the consumer’s account, generating telemetry data that’s ingested into their active Event Table.\nOnce the consumer enables event sharing, new telemetry data will be ingested into both the consumer and provider Event Tables. Now the provider has the ability to debug the application that’s running in the consumer’s account. The provider only sees the telemetry data that is being shared from this data application—nothing else.\nSection Title: ... > Improve reliability across a variety of use cases\nContent:\nYou can use Event Tables to capture and analyze logs for various use cases: * As a data engineer building UDFs and stored procedures within queries and tasks, you can instrument your code to analyze its behavior based on input data.\nAs a Snowpark developer, you can instrument logs and traces for your Snowflake applications to troubleshoot and improve their performance and reliability.\nAs a Snowflake Native App provider, you can analyze logs and traces from various consumers of your applications to troubleshoot and improve performance.\nSection Title: ... > Improve reliability across a variety of use cases\nContent:\nSnowflake customers ranging from Capital One to phData are already using Event Tables to unlock value in their organization. “The Event Tables feature simplifies capturing logs in the observability solution we built to monitor the quality and performance of Snowflake data pipelines in Capital One Slingshot,” says Yudhish Batra, Distinguished Engineer, Capital One Software. “Event Tables has abstracted the complexity associated with logging from our data pipelines—specifically, the central Event Table gives us the ability to monitor and alert from a single location.”\nAs phData migrates its Spark and Hadoop applications to Snowpark, the Event Tables feature has helped architects save time and hassle.\n“When working with Snowpark UDFs, some of the logic can become quite complex. In some instances, we had thousands of lines of Java code that needed to be monitored and debugged,” says Nick Pileggi,\nPrincipal Solutions Architect at phData\nSection Title: ... > Improve reliability across a variety of use cases\nContent:\n. “Before Event Tables, we had almost no way to see what was happening inside the UDF and correct issues. Once we rolled out Event Tables, the amount of time we spent testing dropped significantly and allowed us to have debug and info-level access to the logs we were generating in Java.”\nOne large communications service provider also uses logs in Event Tables to capture and analyze failed records during data ingestion from various external services to Snowflake. And a Snowflake Native App provider offering geolocation data services uses Event Tables to capture logs and traces from their UDFs to improve application reliability and performance.\nWith Event Tables, you now have a built-in place to easily and consistently manage logging and tracing for your Snowflake applications. And in conjunction with other features such as Snowflake Alerts and Email Notifications, you can be notified of new events and errors in your applications.\nSection Title: ... > Try Event Tables today\nContent:\nTo learn more about Event Tables, join us at BUILD\n,\nSnowflake’s developer conference. Or get started with Event Tables today with a tutorial\nand quickstarts for logging\nand tracing\n. For further information about how Event Tables work, visit Snowflake product documentation\n.\nSection Title: ... > The Data Engineer’s Guide to Python for Snowflake\nContent:\n[download now](https://www.snowflake.com/resource/the-data-engineers-guide-to-python-for-snowflake/)\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables > ... > Author\nContent:\nAshwin Kamath\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables > ... > Share Article\nContent:\n[](https://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.snowflake.com%2Fcontent%2Fsnowflake-site%2Fglobal%2Fen%2Fblog%2Fcollect-logs-traces-snowflake-apps&title=Collect+Logs+and+Traces+From+Your+Snowflake+Applications+With+Event+Tables)\n[](https://x.com/intent/post?url=https%3A%2F%2Fwww.snowflake.com%2Fcontent%2Fsnowflake-site%2Fglobal%2Fen%2Fblog%2Fcollect-logs-traces-snowflake-apps&text=Collect+Logs+and+Traces+From+Your+Snowflake+Applications+With+Event+Tables)\n[](https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.snowflake.com%2Fcontent%2Fsnowflake-site%2Fglobal%2Fen%2Fblog%2Fcollect-logs-traces-snowflake-apps)\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables > ... > Just For You\nContent:\nProduct and Technology\nSection Title: ... > Alerts and Observability for Pipeline Monitoring and Cost Management\nContent:\nShiyi Gu\nNov 23, 2022 | 5 min read\nSubscribe to our blog newsletter\nGet the best, coolest and latest delivered to your inbox each week\nBy submitting this form, I understand Snowflake will process my personal information in accordance with their Privacy Notice.\nSection Title: Collect Logs and Traces From Your Snowflake Applications With Event Tables > Where Data Does More\nContent:\n30-day free trial\nNo credit card required\nCancel anytime\n[start for free](https://signup.snowflake.com/)\nwatch a demo\n**Subscribe to our monthly newsletter** Stay up to date on Snowflake’s latest products, expert insights and resources—right in your inbox!\nLearn * Resource Library\nLive Demos\nFundamentals\nTraining\nCertifications\nSnowflake University\nDeveloper Guides\nDocumentation\nPrivacy Policy\nSite Terms\nCommunication Preferences\nCookie Settings\nDo Not Share My Personal Information\nLegal\n[](https://x.com/Snowflake \"X (Twitter)\")\n[](https://www.linkedin.com/company/3653845 \"LinkedIn\")\n[](https://www.facebook.com/snowflakedb/ \"Facebook\")\n[](https://www.youtube.com/user/snowflakecomputing \"YouTube\")"],"full_content":null},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/provider-view","title":"404 File Not Found - Snowflake Documentation","publish_date":null,"excerpts":["Section Title: We couldn't find that\nContent:\nLooks like the document you were looking for couldn't be found"],"full_content":null}],"errors":[],"warnings":null,"usage":[{"name":"sku_extract_excerpts","count":3}]}
