{"extract_id":"extract_82e5bdd4d50b427092ea82e1a97c4699","results":[{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/event-definition","title":"Configure event definitions for an app | Snowflake Documentation","publish_date":null,"excerpts":["Developer Snowflake Native App Framework Configure logging and event tracing for an app Use event definitions to configure log messages and trace events\nSection Title: Configure event definitions for an app ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic describes how to define event definitions in the manifest file of an app. Event definitions\ndefine which log messages and trace events are shared with a provider.\nSection Title: Configure event definitions for an app ¶ > About event definitions ¶\nContent:\nEvent definitions specify how an app shares log messages and trace events with the provider.\nEvent definitions act as filters on the log message and trace event levels set by the provider.\nA provider specifies the event definitions for an app when a new app version or patch is published.\nEvent definitions are filters that act on the log messages and trace events. They determine what\ninformation is inserted in the provider event table when event sharing is enabled.\nEvent definitions are optional. If a provider does not specify event definitions for an app,\nconsumers can only enable or disable event sharing for all events when the provider enables event tracing.\nCaution\nSection Title: Configure event definitions for an app ¶ > About event definitions ¶\nContent:\nEvent definitions differ from the log and tracing levels set by the provider. Log and\ntracing levels determine the information that is inserted into the consumer event table. If neither\nthe log nor tracing levels are set, then the app does not emit any events.\nThe log and trace levels for an app can change based on the event definitions enabled by the consumer.\nSnowflake uses the most verbose log and trace levels allowed by the event definitions\nthe consumer has enabled.\nSection Title: Configure event definitions for an app ¶ > Mandatory and optional event definitions ¶\nContent:\nProviders can set an event definition to be required or optional:\nRequired event definitions are enabled automatically when the app is installed.After installing an app with required event definitions, consumers cannot disable event sharing or\nthe required event definitions. When an app is being upgraded, providers can use system functions or\nthe Python Permission SDK to check if the consumer has enabled all required event definitions.\nOptional event definitions can be enabled or disabled by the consumer as necessary.\nSection Title: Configure event definitions for an app ¶ > Supported event definitions ¶\nContent:\nThe following table lists currently supported event definitions.\nSection Title: Configure event definitions for an app ¶ > Supported event definitions ¶\nContent:\n| Type | Name | Description | Filter |\n| All | SNOWFLAKE$ALL | Shares all log messages and trace events that the app emits. | `*` |\n| Events | SNOWFLAKE$ALL_EVENTS | Shares all events from the application. | `RECORD_TYPE='EVENT'` |\n| Errors and warnings | SNOWFLAKE$ERRORS_AND_WARNINGS | Shares logs related to errors, warnings, and fatal events. | `RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘FATAL’, ‘ERROR’, ‘WARN’)` |\n| Traces | SNOWFLAKE$TRACES | Shares detailed traces of user activities and journeys in the application. | `RECORD_TYPE in (‘SPAN’, ‘SPAN_EVENT’)` |\n| Usage logs | SNOWFLAKE$USAGE_LOGS | Shares high-level logs related to user actions and app events. | `RECORD_TYPE = LOG AND RECORD:severity_text = ‘INFO’` |\n| Debug logs | SNOWFLAKE$DEBUG_LOGS | Shares technical logs used to troubleshoot the app. | `RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘DEBUG’, ‘TRACE’)` |\nSection Title: Configure event definitions for an app ¶ > Supported event definitions ¶\nContent:\n| Type | Name | Description | Filter |\n| All | SNOWFLAKE$ALL | Shares all log messages and trace events that the app emits. | `*` |\n| Events | SNOWFLAKE$ALL_EVENTS | Shares all events from the application. | `RECORD_TYPE='EVENT'` |\n| Errors and warnings | SNOWFLAKE$ERRORS_AND_WARNINGS | Shares logs related to errors, warnings, and fatal events. | `RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘FATAL’, ‘ERROR’, ‘WARN’)` |\n| Traces | SNOWFLAKE$TRACES | Shares detailed traces of user activities and journeys in the application. | `RECORD_TYPE in (‘SPAN’, ‘SPAN_EVENT’)` |\n| Metrics | SNOWFLAKE$METRICS | Enable consumers to share metrics with providers. | `RECORD_TYPE   in (‘METRIC’)` |\nSection Title: Configure event definitions for an app ¶ > Supported event definitions ¶\nContent:\nNote\nSnowsight only displays the all event All type to the consumer if the provider has not configured the app to\nuse event definitions.\nSection Title: ... > Limitations of event definitions in apps with containers ¶\nContent:\nSnowflake Native Apps with Snowpark Container Services currently only supports the `ALL` event definition. Support for additional\nevent definitions will be added in a future release.\nSection Title: Configure event definitions for an app ¶ > Set the log and trace levels for an app ¶\nContent:\nTo allow an app to use event tracing, a provider must configure the log and trace levels\nin the manifest file.\nTo set the log and trace levels for an app, add a `configuration` block in the manifest file as shown in the following example:\n```\nconfiguration : \n ... \n log_level : INFO \n trace_level : ALWAYS \n metric_level : ALL \n ...\n```\nCopy\nThis example sets the log and trace levels for the app as follows:\nThe `log_level` property is set to `INFO` .\nThe `trace_level` property is set to `ALWAYS` .\nThe `metric_level` property is set to `ALL` .\nSee LOG_LEVEL , TRACE_LEVEL , and METRIC_LEVEL for information on\nthe valid values for these parameters.\nCaution\nAfter you publish an app, the log and trace levels cannot be changed. If the log and trace levels\nare not set in the manifest file, the app does not emit any information.\nSection Title: Configure event definitions for an app ¶ > Set the log and trace levels for an app ¶\nContent:\nWhen the log and trace levels are set for an app, consumers must set up an event table in their account\nto see the log messages and trace events that the app emits.\nTo allow the provider to see the log messages and trace events that an app generates, consumers must\nenable event sharing. See Enable event sharing for an app for more information.\nSection Title: Configure event definitions for an app ¶ > Add an event definition to the manifest file ¶\nContent:\nTo specify an event definition, a provider adds an entry to the `configuration.telemetry_event_definitions` block of the manifest file as shown in the\nfollowing example:\n```\nconfiguration : \n telemetry_event_definitions : \n - type : ERRORS_AND_WARNINGS \n sharing : MANDATORY \n - type : DEBUG_LOGS \n sharing : OPTIONAL\n```\nCopy\nThis example specifies the following event definitions:\nA required event definition with type `ERRORS_AND_WARNINGS` .\nAn optional event definition with type `DEBUG_LOGS` .\nSee Supported event definitions for more information.\nAfter a consumer installs an app, the event definitions appears in the Events and logs tab on the Security page of the app. See [Enable logging and event sharing for an app](https://other-docs.snowflake.com/en/native-apps/consumer-enable-logging) for more information.\nSection Title: ... > Set the log, trace, and metric levels for specific objects ¶\nContent:\nProviders may fine-tune the log, trace, and metric levels for specific objects within an app. This\ngives providers more control over the telemetry data emitted by the app.\nProviders can set the log, trace, and metric levels for the following objects within an app:\nSchemas\nVersioned schemas\nStored procedures\nUser-defined functions\nThe following table lists the SQL commands used to set the log, trace, and event levels for\nthese objects:\nSection Title: ... > Set the log, trace, and metric levels for specific objects ¶\nContent:\n| Object | Command |\n| Schemas | ALTER SCHEMA |\n| Versioned schema | CREATE OR ALTER VERSIONED SCHEMA |\n| Stored procedures | ALTER PROCEDURE |\n| User-defined functions | ALTER FUNCTION |\nSection Title: ... > Set the log, trace, and metric levels for specific objects ¶\nContent:\nFor schemas, stored procedures, and user-defined functions, providers can use the `SET` clause\nof the ALTER commands to set the following properties:\nLOG_LEVEL\nTRACE_LEVEL\nMETRIC_LEVEL\nFor versioned schemas providers can set these properties using CREATE OR ALTER VERSIONED SCHEMA in the setup script.\nSection Title: Configure event definitions for an app ¶ > Order of precedence for log, trace, and metric levels ¶\nContent:\nWithin an app, the log, trace, and metric levels can be configured in different ways\nfor components of the app. To determine the events that are emitted, the Snowflake Native App Framework uses the\nfollowing order of precedence:\nStored procedures and user-defined functionsIf an override is set for the specific stored procedure or user-defined function,\nit takes precedence.\nSchemas and version schemasIf no overrides are set for stored procedures or user-defined functions, overrides\nfor schemas and versioned schemas take precedence.\nApp-level settingsIf no object-level overrides are found, the app-level telemetry configuration, typically defined\nin the manifest file, is used.\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\nSection Title: Configure event definitions for an app ¶ > Order of precedence for log, trace, and metric levels ¶\nContent:\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)"],"full_content":null},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/ui-consumer-enable-logging","title":"Set up event tracing for an app | Snowflake Documentation","publish_date":null,"excerpts":["Guides Listings Snowflake Marketplace listings Use applications as a consumer Set up event tracing for an app\nSection Title: Set up event tracing for an app ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic describes how to set up use event tracing to capture the log messages and trace events\nemitted by an app. It also describes how to enable event sharing to share log messages and trace events\nwith providers.\nSection Title: Set up event tracing for an app ¶ > About event tracing in the Snowflake Native App Framework ¶\nContent:\nEvent tracing allows an app to emit information related to its performance and behavior. The Snowflake Native App Framework\nsupports using the Snowflake logging and tracing .\nfunctionality to gather this information. An app can emit the following:\nLog messages that are independent, detailed messages with information about the state of a specific\nfeature within the app.\nTrace events with structured data you can use to get information spanning and grouping multiple\nparts of an app.\nMetrics data that includes the CPU and memory metrics that Snowflake generates.\nSection Title: ... > View the log messages, trace events, and metrics for an app ¶\nContent:\nTo view the log messages and trace events emitted by the app, consumers must set up an event table in\ntheir account to collect this information. See Set up an event table for more information.\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶\nContent:\nConsumers can also enable event sharing to share event data with providers. When a provider enables\nevent sharing, the log messages and trace events that are inserted into the event table in\nthe consumer account are also inserted into an event table in provider account.\nEvent sharing allows the provider to collect information about the app’s performance and behavior. See About event sharing for an app for more information.\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > About event definitions ¶\nContent:\nEvent definitions specify how an app shares log messages and trace events with the provider.\nEvent definitions act as filters on the log message and trace event levels set by the provider.\nA provider specifies the event definitions for an app when a new version or patch is published.\nNote\nEvent definitions are not required. If a provider does not specify event definitions for an app\nconsumers can enable or disable event sharing as required.\nProviders can set an event definition to be required or optional:\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > About event definitions ¶\nContent:\nRequired event definitions are enabled automatically when the app is installed. To collect the\nevent definitions emitted by an app, a consumer should create an event table and set it as\nthe active event table for their account.\nOptional event definitions can be enabled or disable by the consumer as necessary. Optional event\ndefinitions require an active event table, but they are not required to install or use the app.\nCaution\nEvent definitions are not the same as the log and tracing levels set by the provider. The log and\ntracing levels determine the information that is inserted into the consumer event table.\nEvent definitions are filters that act on the log messages and trace events. They determine what\ninformation is inserted in the provider event table when event sharing is enabled.\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > Supported event definitions ¶\nContent:\nThe following table lists the event definitions that are currently supported:\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > Supported event definitions ¶\nContent:\nTypeNameDescriptionFilterAllSNOWFLAKE$ALLShares all log messages and trace events that the app emits.`*`EventsSNOWFLAKE$ALL_EVENTSShares all events from the application.`RECORD_TYPE='EVENT'`Errors and warningsSNOWFLAKE$ERRORS_AND_WARNINGSShares logs related to errors, warnings, and fatal events.`RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘FATAL’, ‘ERROR’, ‘WARN’)`MetricsSNOWFLAKE$METRICSShares the CPU and memory metrics that Snowflake generates.`RECORD_TYPE = in ('METRIC')`TracesSNOWFLAKE$TRACESShares detailed traces of user activities and journeys in the application.`RECORD_TYPE in (‘SPAN’, ‘SPAN_EVENT’)`Usage logsSNOWFLAKE$USAGE_LOGSShares high-level logs related to user actions and app events.`RECORD_TYPE = LOG AND RECORD:severity_text = ‘INFO’`Debug logsSNOWFLAKE$DEBUG_LOGSShares technical logs used to troubleshoot the app.`RECORD_TYPE = ‘LOG’ AND RECORD:severity_text in (‘DEBUG’,\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > Supported event definitions ¶\nContent:\n‘TRACE’)`\nSection Title: Set up event tracing for an app ¶ > About event sharing ¶ > Supported event definitions ¶\nContent:\nNote\nIf a provider does not configure the app to use event definitions, Snowsight displays only the All type.\nSection Title: ... > Considerations for consumers when using event definitions ¶\nContent:\nConsumers can continue to use the existing SHARE_EVENTS_WITH_PROVIDER property, however there\nare limitations:\nIf an app only uses the OPTIONAL ALL event definition, setting the SHARE_EVENTS_WITH_PROVIDER property\nto `true` enables event sharing and setting it to `false` disables event sharing.This is applicable when a provider explicitly adds the OPTIONAL ALL event definition to the manifest\nfile or an app was migrated from the existing event sharing functionality.\nIf a provider adds mandatory and optional event definitions to the manifest file, setting the\nSHARE_EVENTS_WITH_PROVIDER property to `true` enables all event definitions. In contrast, the\nSHARE_EVENTS_WITH_PROVIDER property can only be set to `false` if the provider adds only\noptional event definitions.SHARE_EVENTS_WITH_PROVIDER is TRUE only when all event definitions are enabled, otherwise it is FALSE.\nSection Title: Set up event tracing for an app ¶ > Workflow to set up event tracing for an app ¶\nContent:\nThe following workflow describes how to set up event tracing for an app:\nReview the considerations for using logging and event tracing .\nSet up an event table .\nView the logging and trace event levels configured for the app .\nView the events in the event table .\nEnable event sharing on an app .\nSection Title: Set up event tracing for an app ¶ > Considerations when using event tracing ¶\nContent:\nBefore setting up event tracing for an app, you must consider the following:\nSection Title: Set up event tracing for an app ¶ > Considerations when using event tracing ¶\nContent:\nThis feature requires you to set up an event table in\nyour account. After you enable event sharing , a masked and redacted\ncopy of the trace events and logs messages is automatically inserted in the event table of the designated\nprovider account. Snowflake does not charge you to enable event sharing. However, you are responsible for the\ncost of ingesting trace events and log message in the event table as well as storage\ncosts for the event table. After enabling event sharing with a provider, you cannot revoke access to shared\ntrace events and log messages. You cannot share historical events using event sharing. Snowflake sends the shared events to a designated provider account within the same region as your account. This feature does not share data across different regions. You cannot change the logging or tracing levels for an app. The app provider sets these levels\nwhen publishing the app.\nSection Title: Set up event tracing for an app ¶ > Considerations when using event tracing ¶\nContent:\nSnowflake recommends reviewing the trace events and log messages in the event table before enabling\nevent sharing. Snowflake recommends disabling event sharing if you do not need to troubleshoot the app.\nSection Title: Set up event tracing for an app ¶ > Set up an event table ¶\nContent:\nTo collect the log messages and trace events emitted by the app, consumers must create an event table to\nstore the information.\nNote\nIF the consumer does not set up an event table and make it the active event table before installing the\napp, trace event and log data is discarded.\nIf a provider includes required event definitions in the app, they are enabled by default during\ninstallation. However, if the consumer does not have an active event table, the log messages and\ntrace events emitted by the app are discarded.\nAn account can have multiple event tables, but only one of them can be set as the active event table in a\nSnowflake account at a time. Without an active event table, log messages and trace events that the app emits\nare not captured. This is true even if the functions and procedures in an app call the logging and trace\nevent APIs directly.\nSection Title: Set up event tracing for an app ¶ > Set up an event table ¶\nContent:\nTo create an event table, run the CREATE EVENT TABLE command as shown in the following example:\n```\nCREATE EVENT TABLE event_db . event_schema . my_event_table ;\n```\nCopy\nNote that this command specifies the database and schema that contain the event table.\nAfter creating the event table, use the ALTER ACCOUNT command to\nspecify that the event table is the active table for the account:\n```\nALTER ACCOUNT SET EVENT_TABLE = event_db . event_schema . my_event_table ;\n```\nCopy\nSection Title: Set up event tracing for an app ¶ > Enable event sharing for an app ¶\nContent:\nThe Snowflake Native App Framework supports sharing log messages and trace events stored in the consumer event table with the\napp provider. To share logs and event information with a provider, the consumer must enable event\nsharing for an app.\nSection Title: Set up event tracing for an app ¶ > ... > Prerequisites for enabling event sharing for an app ¶\nContent:\nThe following prerequisites must be met to enable event sharing for an app instance:\nUse a role with the MANAGE EVENT SHARING global privilege. The ACCOUNTADMIN role has this privilege by\ndefault and can grant it to other roles.\nSet up an event table in the consumer account .\nSection Title: Set up event tracing for an app ¶ > ... > Enable event sharing using Snowsight ¶\nContent:\nNote\nIf the provider includes required event definitions in the app, event sharing and the required event definitions are enabled during installation and\ncannot be disabled later.\nSection Title: Set up event tracing for an app ¶ > ... > Enable event sharing using Snowsight ¶\nContent:\nIn the navigation menu, select Catalog » Apps .\nSelect the app.\nSelect the Settings icon in the toolbar.\nSelect the Events and logs tab.\nUnder the Events and logs sharing area, move the slider for the events you want to capture.\nIf the provider has defined event definitions for the app:\nUse the slider to enable optional event definitions. By default, all event types are enabled.\nSelect Save .\nIf no event table is currently selected, select the event table from the list\nunder Event table location .CautionUse caution when changing the event table in Snowsight. Each Snowflake account\nuses a single event table for all events generated within the account. Changing the event\ntable causes all events generated in the account to be stored in the new location.\nSection Title: Set up event tracing for an app ¶ > ... > Enable event sharing by using SQL ¶\nContent:\nUse the SHOW TELEMETRY EVENT DEFINITIONS command to determine the event definitions for the app:CopyIf the provider did not configure the app to use event definitions, the `type` column\ndisplays `ALL` . Otherwise, this command lists the optional event definitions specified\nfor the app. If the app contains required event definitions, use the ALTER APPLICATION command to\nenable them:CopyThis command enables all of the require event definitions, but does not enable optional event\ndefinitions.NoteAfter enabling the required event definitions for an app, event sharing cannot be disabled. If the app contains options event definitions, use the use the ALTER APPLICATION to enable them as shown in the following example:CopyThis example enables the `SNOWFLAKE$TRACES` and `SNOWFLAKE$DEBUG_LOGS` based on the output of the SHOW TELEMETRY EVENT DEFINITIONS command.\nSection Title: Set up event tracing for an app ¶ > ... > Enable event sharing by using SQL ¶\nContent:\nTo verify that event tracing and logging is enabled, use the DESCRIBE APPLICATION command:CopyThe `authorize_telemetry_event_sharing` and `share_events_with_provider` rows of the output\nindicate if event sharing is enabled.\nSection Title: ... > Enable event sharing using SQL (deprecated functionality) ¶\nContent:\nCaution\nThe method of enabling event sharing using SQL described in this section will be deprecated\nin a future release. Snowflake recommends using the method described in Enable log and event sharing using SQL to enable event sharing using SQL.\nTo enable event sharing for an app, run the ALTER APPLICATION command to set\nSHARE_EVENTS_WITH_PROVIDER to `TRUE` . For example:\n```\nALTER APPLICATION HelloSnowflake SET SHARE_EVENTS_WITH_PROVIDER = TRUE ;\n```\nCopy\nTo show the event sharing status for an app, use the DESCRIBE APPLICATION command as shown in the following example:\n```\nDESC APPLICATION HelloSnowflake ;\n```\nCopy\n`SHARE_EVENTS_WITH_PROVIDER` shows the status of event sharing for the app.\nSection Title: Set up event tracing for an app ¶ > Enable event definitions during upgrades ¶\nContent:\nDuring upgrades, event definitions behave as follows:\nChange to event definitionBehavior during upgradeNo change to an event definitionThe event definition retains the same status as the previous version or patch.A new event definitionNot enabled automatically. This is true for both required and optional event definitions.The consumer must manually enable new event definitions.Changes from required to optional or optional to requiredThe event definition retains the same status as the previous version or patch.Deleted event definitionEvent sharing stops after upgrade for log messages or trace events filter in the previousversion or patch.\nDuring upgrade, consumers are prompted to review the changes to event definitions from the previous patch or\nversion.\nSection Title: Set up event tracing for an app ¶ > View the log messages and trace events in the event table ¶\nContent:\nWhen an event table is enabled, consumers can query the event table to see the log messages and\ntrace events emitted by the app.\nSection Title: ... > View the event log messages and trace events by using Snowsight ¶\nContent:\nIn the navigation menu, select Catalog » Apps .\nSelect the app.\nIn the toolbar, select Settings .\nSelect the App events tab.\nIn the Event logging section, select View logs .\nThis opens a new worksheet with a pre-populated SELECT statement that displays the log messages\nand trace events for the app.\nSection Title: ... > View the event log messages and trace events by using SQL ¶\nContent:\nUse the SELECT command to query the\nevent log messages and trace events, as shown in the following example:\n```\nSELECT \n  TIMESTAMP as time , \n  RESOURCE_ATTRIBUTES [ 'snow.executable.name' ] as executable , \n  RECORD [ 'severity_text' ] as severity , \n  VALUE as message \n FROM \n  \"EVENT_LOG\" . \"PUBLIC\" . \"CONSUMER_EVENT_TABLE\" \n WHERE RESOURCE_ATTRIBUTES [ 'snow.application.name' ] = 'YOUR_APP_NAME'\n```\nCopy\nThis command returns all of the log messages and trace events stored in the event table `CONSUMER_EVENT_TABLE` for an app named `YOUR_APP_NAME` .\nSection Title: ... > Determine if a log message or trace event is shared with the provider ¶\nContent:\nThe RECORD_ATTRIBUTES column contains the `snow.application.shared` field. If the value of\nthis field is TRUE, the log message or trace event is shared with the provider. Otherwise,\nthe log message or event is not shared.\nSection Title: Set up event tracing for an app ¶ > View the log and trace levels for an app ¶\nContent:\nThe log and trace level of an app are defined by the provider before publishing an app.\nConsumers cannot change the log and trace levels for an app.\nHowever, before setting up event tracing or enabling event sharing for an app, Snowflake\nrecommends verifying the log level to understand the type of information that collected\nand shared with the provider.\nTo view the log and trace level of an app, run the following command:\n```\nDESC APPLICATION HelloSnowflake ;\n```\nCopy\nThis command displays information about the `HelloSnowflake` app, including the following information\nabout the log and trace level set for the app:\nlog_level: The log level set by the provider.\ntrace_level: The trace level set by the provider.\nmetric_level: The metric data level set by the provider.\neffective_log_level: The log level set for the app.\neffective_trace_level: The trace level enabled for the app.\nSection Title: Set up event tracing for an app ¶ > View the log and trace levels for an app ¶\nContent:\nThe effective log and trace levels are determined by the event definitions the consumer enables for the app.\nFor example, if the provider defines the log level as OFF, but consumer enables the ERROR_AND_WARNING event\ndefinition, the app dynamically changes log level to WARN so that ERROR_AND_WARNING events can be collected. The app\nemits events that are less or equally as verbose as WARN and shares those error and warning events with the provider.\nThe values of `log_level` would be OFF and the value of `effective_log_level` would be WARN.\nIn contrast, if the provider defines the log level as TRACE, but the consumer enables the ERROR_AND_WARNING\nevent definition, the app emits events that are less or equally as verbose as trace, but only error and warning\nmessages are shared with the provider. The value of both log_level and effective_log_level would be TRACE.\nWas this page helpful?\nYes No\nSection Title: Set up event tracing for an app ¶ > View the log and trace levels for an app ¶\nContent:\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)"],"full_content":null},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/event-develop","title":"Determine information about event sharing in the consumer account | Snowflake Documentation","publish_date":"2026-01-01","excerpts":["Developer Snowflake Native App Framework Configure logging and event tracing for an app Determine information about event sharing in the consumer account\nSection Title: Determine information about event sharing in the consumer account ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic describes how a provider can set up an app to determine if a consumer has enabled\nevent sharing in their account.\nSection Title: ... > Verify event definitions by using system functions ¶\nContent:\nTo determine if event sharing is enabled in a consumer account, providers can call the following\nsystem functions within the setup script:\nSYSTEM$IS_APPLICATION_AUTHORIZED_FOR_TELEMETRY_EVENT_SHARING()Returns TRUE if the AUTHORIZE_TELEMETRY_EVENT_SHARING property is set, which indicates that\nevent sharing is allowed in the consumer account. Otherwise, this system function returns FALSE.\nSYSTEM$IS_APPLICATION_ALL_MANDATORY_TELEMETRY_EVENT_DEFINITIONS_ENABLED()Returns TRUE if all required event definitions have been enabled in the consumer account.\nOtherwise, this system function returns FALSE.\nThe following example shows a stored procedure that performs a calculation only if both\nIS_APPLICATION_AUTHORIZED_FOR_TELEMETRY_EVENT_SHARING and\nIS_APPLICATION_ALL_MANDATORY_TELEMETRY_EVENT_DEFINITIONS_ENABLED are set to TRUE.\nSection Title: ... > Verify event definitions by using system functions ¶\nContent:\n```\nCREATE OR ALTER VERSIONED SCHEMA app_schema ; \n CREATE OR REPLACE PROCEDURE app_schema . sum ( num1 float , num2 float ) \n RETURNS STRING \n LANGUAGE SQL \n EXECUTE AS OWNER \n AS $$ \n    BEGIN \n      IF ( SYSTEM$IS_APPLICATION_AUTHORIZED_FOR_TELEMETRY_EVENT_SHARING () and SYSTEM$IS_APPLICATION_ALL_MANDATORY_TELEMETRY_EVENT_DEFINITIONS_ENABLED ()) THEN \n        RETURN num1 + num2 ; \n      ELSE \n        -- notify consumers that they need to enable event sharing \n        RETURN 'Sorry you can\\' t access the API , please enable event sharing .'; \n      END IF ; \n    END ; \n $$;\n```\nCopy\nSection Title: ... > Verify event definitions by using the Permissions SDK ¶\nContent:\nThe Python Permission SDK provides the following functions to determine if even sharing is enabled\nin a consumer account:\n`is_application_authorized_for_telemetry_event_sharing()`Returns `true` if the AUTHORIZE_TELEMETRY_EVENT_SHARING property is `true` . Returns `false` , otherwise.See is_application_authorized_for_telemetry_event_sharing() for more information.\n`is_application_all_mandatory_telemetry_event_definitions_enabled()`Returns `true` if all mandatory event definitions have been enabled in the consumer account.See is_application_all_mandatory _telemetry_event_definitions_enabled() for more information.\nSection Title: ... > Verify event definitions by using the Permissions SDK ¶\nContent:\nThe following example shows how to use the `is_application_authorized_for_telemetry_event_sharing()` and `is_application_all_mandatory_telemetry_event_definitions_enabled()` functions of the\nPython Permission SDK to verify that event sharing is enabled in the consumer account and that mandatory\nevents have been enabled.\n```\nimport streamlit as st \n import snowflake.permissions as permissions \n\n def critical_feature_that_requires_event_sharing (): \n  st . write ( \"critical_feature_that_requires_event_sharing\" ) \n\n def main (): \n  if permissions . is_application_authorized_for_telemetry_event_sharing () and permissions . is_application_all_mandatory_telemetry_event_definitions_enabled (): \n     critical_feature_that_requires_event_sharing () \n  else : \n     permissions . request_event_sharing () \n\n if __name__ == \"__main__\" : \n  main ()\n```\nCopy\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\nSection Title: ... > Verify event definitions by using the Permissions SDK ¶\nContent:\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nVerify event definitions by using system functions\nVerify event definitions by using the Permissions SDK\nRelated content\nLogging, tracing, and metrics\nSection Title: Determine information about event sharing in the consumer account ¶ > Privacy Preference Center\nContent:\nYour Opt Out Preference Signal is Honored\nYour Privacy\nStrictly Necessary Cookies\nPerformance Cookies\nFunctional Cookies\nTargeting Cookies\nSection Title: Determine information about event sharing in the consumer account ¶ > ... > Your Privacy\nContent:\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\nSection Title: ... > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎\nSection Title: Determine information about event sharing in the consumer account ¶ > ... > Performance Cookies\nContent:\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nCookies Details‎\nSection Title: Determine information about event sharing in the consumer account ¶ > ... > Functional Cookies\nContent:\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\nCookies Details‎\nSection Title: Determine information about event sharing in the consumer account ¶ > ... > Targeting Cookies\nContent:\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nCookies Details‎\nSection Title: Determine information about event sharing in the consumer account ¶ > ... > Cookie List\nContent:\nConsent Leg.Interest\ncheckbox label label\ncheckbox label label\ncheckbox label label\nClear\ncheckbox label label\nApply Cancel\nConfirm My Choices\nAllow All\n[](https://www.onetrust.com/products/cookie-consent/)"],"full_content":null},{"url":"https://docs.snowflake.com/en/developer-guide/native-apps/ui-consumer-granting-privs","title":"Allow access to a consumer account | Snowflake Documentation","publish_date":null,"excerpts":["Guides Listings Snowflake Marketplace listings Use applications as a consumer Allow access to a consumer account\nSection Title: Allow access to a consumer account ¶\nContent:\nFeature — Generally Available\nThe Snowflake Native App Framework is generally available on supported cloud platforms. For additional information, see Support for private connectivity, VPS, and government regions .\nThis topic describes how a consumer can allow a Snowflake Native App to create and access objects in\ntheir account. This includes granting the privileges requested by an app or enabling access to existing\nobjects by using references. It also describes how to allow an app to use external and Apache Iceberg™\ntables that a provider shares in the app.\nSection Title: Allow access to a consumer account ¶ > Privileges and references requested by an app ¶\nContent:\nIn a simple Snowflake Native App, all of the objects required by the app are created inside the\napplication object when the setup script runs during installation. All of the objects\nrequired by the app are created in and accessed within the installed app.\nThe consumer does not need to perform any actions in their account.\nHowever, some apps might ask the consumer to perform the following types of actions in their account:\nCreate a database or warehouse.\nExecute tasks.\nAccess existing objects such as tables.\nThere are two types of access that a Snowflake Native App can request:\nSection Title: Allow access to a consumer account ¶ > Privileges and references requested by an app ¶\nContent:\nPrivileges that allow the app to perform some account-level operations. An app can request the\nfollowing global privileges:Some apps might also request the IMPORTED PRIVILEGES privilege on the SNOWFLAKE database. See Grant the IMPORTED PRIVILEGES privilege on the SNOWFLAKE database . EXECUTE TASK\nEXECUTE MANAGED TASK\nCREATE WAREHOUSE\nMANAGE WAREHOUSES\nCREATE DATABASE\nCREATE COMPUTE POOL\nBIND SERVICE ENDPOINT\nREAD SESSION\nReferences that allow the app to access objects that already exist in the consumer\naccount and are outside the application object.\nSection Title: Allow access to a consumer account ¶ > Privileges and references requested by an app ¶\nContent:\nA provider defines the references required by the\napp in the manifest file.After installing the app, the consumer can authorize access on an object by creating a reference that associates the object to the app.An app can request access to the following types of objects and their corresponding privileges:Object TypePrivileges AllowedTABLESELECT, INSERT, UPDATE, DELETE, TRUNCATE, REFERENCESVIEWSELECT, REFERENCESEXTERNAL TABLESELECT, REFERENCESFUNCTIONUSAGEPROCEDUREUSAGEWAREHOUSEMODIFY, MONITOR, USAGE, OPERATEAPI INTEGRATIONUSAGE\nSection Title: Allow access to a consumer account ¶ > Privileges and references requested by an app ¶\nContent:\nA consumer can approve these requests using Snowsight or by running the SQL commands.\nNote\nIf you do not grant the requested privileges or associate references on the requested object to the\napp, parts of the app may not function correctly.\nSection Title: Allow access to a consumer account ¶ > Manage access requests using Snowsight ¶\nContent:\nIf a provider implements a user interface in a Snowflake Native App, a consumer may perform the following using Snowsight .\nView and grant global privileges.\nAuthorize access to existing objects in the consumer account.\nSection Title: Allow access to a consumer account ¶ > ... > Grant global privileges ¶\nContent:\nIn the navigation menu, select Catalog » Apps .\nSelect an app.\nSelect the Settings icon in the toolbar.\nSelect the Privileges tab.The account level permissions requested by the app appear under Account level privileges\nIn the Account level privileges pane, select the Edit icon and then move the slider for each privilege that you want to grant.\nSelect Update Privileges .\nSection Title: Allow access to a consumer account ¶ > ... > Authorize access to specific objects ¶\nContent:\nIf a provider implements a user interface for a Snowflake Native App, a consumer can use Snowsight to authorize access on objects in their account.\nIn the navigation menu, select Catalog » Apps .\nSelect an app.\nSelect the Settings icon in the toolbar.\nSelect the Privileges tab.\nIn the Object access privileges pane, select Add next to the object to which\nyou want to authorize access.\nSelect Select Data and choose the data product to which you want to authorize access.\nSelect Save .\nSection Title: Allow access to a consumer account ¶ > ... > Revoke privileges and access to objects ¶\nContent:\nRevoking privileges or removing access from objects can cause the application to become unstable or stop working.\nIn the navigation menu, select Catalog » Apps .\nSelect an app.\nSelect the Settings icon in the toolbar.\nSelect the Privileges tab.\nIn the Account level privileges pane, select the Edit icon and then move the slider for the privilege you want to revoke.\nSelect Update Privileges .\nSection Title: Allow access to a consumer account ¶ > Manage privileges for an app by using SQL commands ¶\nContent:\nIf your provider does not implement an interface for granting privileges, you must\nuse SQL commands to manage application access requests.\nSection Title: Allow access to a consumer account ¶ > ... > View the privileges requested by an app ¶\nContent:\nWhen a provider specifies the privileges required by the app, the privilege request is\nincluded as part of the installed app. You can view these privileges after installing\nthe app.\nTo view the privileges required by an app, run the SHOW PRIVILEGES command as shown\nin the following example:\n```\nSHOW PRIVILEGES IN APPLICATION hello_snowflake_app ;\n```\nCopy\nSection Title: Allow access to a consumer account ¶ > ... > Grant privileges to a Snowflake Native App ¶\nContent:\nAfter a consumer determines the privileges requested by an app, they can grant those privileges to\nthe app.\nFor example, to grant the EXECUTE TASK privilege to an app, run the GRANT  … TO ROLE command as shown\nin the following example:\n```\nGRANT EXECUTE TASK ON ACCOUNT TO APPLICATION hello_snowflake_app ;\n```\nCopy\nSection Title: ... > Grant the MANAGE WAREHOUSES privilege to a Snowflake Native App ¶\nContent:\nThe MANAGE WAREHOUSES privilege allows an app to create, modify, and use warehouses within the consumer account. To grant the\nMANAGE WAREHOUSES privilege to an app, use the GRANT  … TO ROLE as shown in the following example:\n```\nGRANT MANAGE WAREHOUSES ON ACCOUNT TO APPLICATION hello_snowflake_app ;\n```\nCopy\nSection Title: ... > Grant the IMPORTED PRIVILEGES privilege on the SNOWFLAKE database ¶\nContent:\nSome apps might request that a consumer grants the IMPORTED PRIVILEGES privilege on the\nSNOWFLAKE database in their account. This privilege can only be granted using SQL commands. It cannot\nbe granted using Snowsight . If an app requires this privilege, the provider should\ncommunicate this requirement to the consumer, for example, in the README file of the app.\nTo grant the IMPORT privilege on the SNOWFLAKE database, run the following command:\n```\nGRANT IMPORTED PRIVILEGES ON DATABASE SNOWFLAKE TO APPLICATION hello_snowflake_app ;\n```\nCopy\nNote\nThe IMPORTED PRIVILEGES privilege allows the app to access information about usage and costs associated with\nthe consumer account. A consumer should ensure that they want to share this information with the\napp before granting this privilege.\nSection Title: Allow access to a consumer account ¶ > Manually authorize access to objects ¶\nContent:\nWhen a provider defines a reference to an object in the manifest file, this reference\ndefinition is included as part of the installed app. A consumer can create a reference to an object\nin their account to authorize the app to access the object. If the provider did not create a user\ninterface for allowing access to objects in the consumer account, the consumer can authorize access\nmanually.\nThe consumer can create a reference for an object to associate with the app if they have the requested\nprivileges on the object. For example, if SELECT and INSERT privileges are required for an object, for\nexample a table, the consumer must create the reference using a role that has the SELECT and INSERT privileges\non the table. To view the object types and the specific required privilege grants for each object,\nsee View the References Requested by an App .\nNote\nSection Title: Allow access to a consumer account ¶ > Manually authorize access to objects ¶\nContent:\nA reference does not grant any privileges on the object. If the role used to create the reference loses\nprivileges on the object, the reference is no longer valid. The consumer must do one of the following:\nRestore the required privileges to the role that created the reference.\nRecreate the reference using a role with the required privileges on the object.\nSection Title: Allow access to a consumer account ¶ > ... > View the references requested by an app ¶\nContent:\nA consumer can view the references requested by an app by running the SHOW REFERENCES command as shown in\nthe following example:\n```\nSHOW REFERENCES IN APPLICATION hello_snowflake_app ;\n```\nCopy\nThis command displays a list of all the references defined in the app. It also displays the privileges\nthat the consumer role must have on the object in order to create the reference.\nSection Title: ... > Create the reference and associate the reference to the app ¶\nContent:\nAfter viewing the references requested by the app,\na consumer can create the reference by running the SYSTEM$REFERENCE system\nfunction as shown in the following example:\n```\nSELECT SYSTEM$REFERENCE ( 'table' , 'db1.schema1.table1' , 'persistent' , 'select' , 'insert' );\n```\nCopy\nThis command creates the reference and returns an identifier for the object. The identifier looks\nsimilar to the following example:\n```\nENT_REF_TABLE_16617302895522_2CDD20F5C047A5B87B2CE36F6837715786AF9F2D\n```\nThe consumer passes this identifier to a callback stored procedure to associate the reference to the app.\nNote\nThe consumer must run this command for each reference requested by the app.\nSection Title: ... > Create the reference and associate the reference to the app ¶\nContent:\nTo associate a reference to an app, the consumer must pass the identifier returned by calling\nthe SYSTEM$REFERENCE system function to a callback stored procedure. A callback procedure is a stored procedure that the\nprovider creates in the Snowflake Native App to associates a reference to the app.\nTo use a callback procedure, run the following command:\n```\nCALL app . config . register_single_reference ( \n  'consumer_table' , 'ADD' , 'ENT_REF_TABLE_16617302895522_2CDD20F5C047A5B87B2CE36F6837715786AF9F2D' );\n```\nCopy\nIn this example, the `register_single_reference()` stored procedure associates the reference with the\nidentifier `ENT_REF_TABLE_16617302895522_2CDD20F5C047A5B87B2CE36F6837715786AF9F2D` to the app.\nNote\nA provider can include different callback procedures in an app. These should be specified in the\nREADME file of the app.\nSection Title: ... > Create and associate the reference to the app in a single step ¶\nContent:\nAfter viewing the references requested by the application,\na consumer can create the reference and associate it to the app by passing the SYSTEM$REFERENCE\nsystem function as an argument to a callback stored procedure.\nThe following example shows the syntax for passing the SYSTEM$REFERENCE system function as an argument to\na callback stored procedure:\n```\nCALL app . config . register_single_reference ( \n 'consumer_table' , 'ADD' , SYSTEM$REFERENCE ( 'table' , 'db1.schema1.table1' , \n 'PERSISTENT' , 'SELECT' , 'INSERT' ));\n```\nCopy\nThis example creates the reference and passes the identifier to the callback function to associate the\nreference to the app.\nSection Title: Allow access to a consumer account ¶ > Enable external and Apache Iceberg™ tables ¶\nContent:\nThe Snowflake Native App Framework allows providers to share external and Apache Iceberg™ tables in the provider shares with consumers\nin the app. However, consumers must give the app permission to access these tables.\nSection Title: Allow access to a consumer account ¶ > ... > Security and cost considerations ¶\nContent:\nWhen allowing an app to accesses an external or Iceberg table, consumers\nshould be aware of the following:\nExternal and Iceberg tables may pose data exfiltration risks to the consumer. For example, if an\napp exposes a view that contains an external table, a provider may be able to determine the types of\nqueries the consumer makes by using their cloud provider access logs.\nExternal and Iceberg tables may incur additional costs related to egress and ingress usage if the\nobject store containing the table is not in the same region where the app is published.\nSection Title: Allow access to a consumer account ¶ > ... > Enable external and Iceberg tables using Snowsight ¶\nContent:\nProviders can configure the app to display a dialog to all consumers to allow an app to access\nan external or Iceberg tables.\nTo allow an app to access to an external or Iceberg table:\nIn the navigation menu, select Catalog » Apps .\nSelect the app.\nIn the toolbar, select Settings .\nSelect the Privileges tab.\nUnder External data access , select Review .\nSelect Enable .\nSection Title: Allow access to a consumer account ¶ > ... > Enable external and Iceberg tables using SQL ¶\nContent:\nTo enable access to external and Iceberg tables by using SQL use the\nSET_APPLICATION_RESTRICTED_FEATURE_ACCESS system function as shown in the following\nexample:\n```\nSELECT SYSTEM$SET_APPLICATION_RESTRICTED_FEATURE_ACCESS ( hello_snowflake_app , 'external_data' , '{\"allowed_cloud_providers\" : \"all\"}' );\n```\nCopy\nThis command allows the `hello_snowflake_app` app to access the external or Iceberg tables in the\nthat the app uses.\nTo determine if external and Iceberg tables have been enabled for an app, use the\nLIST_APPLICATION_RESTRICTED_FEATURES system function as shown in the following example:\n```\nSYSTEM$LIST_APPLICATION_RESTRICTED_FEATURES ( 'hello_snowflake_app' )\n```\nCopy\nThis system function returns a JSON object that indicates if external and Iceberg tables are allowed\nthe for the `hello_snowflake_app` .\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\nSection Title: Allow access to a consumer account ¶ > ... > Enable external and Iceberg tables using SQL ¶\nContent:\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nPrivileges and references requested by an app\nManage access requests using Snowsight\nManage privileges for an app by using SQL commands\nManually authorize access to objects\nEnable external and Apache Iceberg™ tables\nRelated content\nInstall an app from a listing\nManage apps\nSet up event tracing for an app"],"full_content":null}],"errors":[],"warnings":null,"usage":[{"name":"sku_extract_excerpts","count":4}]}
