{
  "extract_id": "extract_bc6ed31cc4b549e7a7ca115087587215",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/sql-reference/account-usage/resource_monitors",
      "title": "RESOURCE_MONITORS view | Snowflake Documentation",
      "publish_date": "2026-01-01",
      "excerpts": [
        "Reference General reference SNOWFLAKE database Account Usage RESOURCE\\_MONITORS\n\nSchema:\n    ACCOUNT\\_USAGE , READER\\_ACCOUNT\\_USAGE\n\n# RESOURCE\\_MONITORS view ¶\n\nThis Account Usage view displays the resource monitors that have been created in the account.\n\n## Columns ¶\n\n|Column Name |Data Type |Description |\n| --- | --- | --- |\n|READER\\_ACCOUNT\\_NAME |VARCHAR |Name of the reader account where the resource monitor was created. Column only included in view in READER\\_ACCOUNT\\_USAGE schema. |\n|NAME |VARCHAR |Name of the resource monitor. |\n|CREATED |TIMESTAMP\\_LTZ |Date and time when the resource monitor was created. |\n|CREDIT\\_QUOTA |VARIANT |Monthly credit quota for the resource monitor. |\n|USED\\_CREDITS |VARIANT |Number of credits used in the current monthly billing cycle by all the warehouses associated with the resource monitor. |\n|REMAINING\\_CREDITS |FLOAT |Number of credits still available to use in the current monthly billing cycle. |\n|OWNER |VARCHAR |Name of the role that owns the resource monitor. |\n|WAREHOUSES |VARCHAR |Names of the warehouses that are associate with the resource monitor. |\n|NOTIFY |NUMBER |Percentage of the credit quota. When consumption reaches this threshold, notifications are sent. |\n|SUSPEND |NUMBER |Percentage of the credit quota. When consumption reaches this threshold, assigned warehouses are suspended but currently running queries are allowed to complete. |\n|SUSPEND\\_IMMEDIATE |NUMBER |Percentage of the credit quota. When consumption reaches this threshold, all assigned warehouses are suspended immediately, including those running queries. |\n|LEVEL |VARCHAR |Indicates whether it is an account-level or a warehouse-level resource monitor. |\n|READER\\_ACCOUNT\\_DELETED\\_ON |TIMESTAMP\\_LTZ |Time and date (in the UTC time zone) when the reader account is deleted. |\n\n## Usage notes ¶\n\n* Latency for the view may be up to 120 minutes (2 hours).\n\n* The view only displays objects for which the current role for the session has been granted access privileges.\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Columns\n2. Usage notes\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"
      ],
      "full_content": null
    }
  ],
  "errors": [
    {
      "url": "60000",
      "error_type": "fetch_error",
      "http_status_code": null,
      "content": null
    }
  ],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 1
    }
  ]
}
