{
  "extract_id": "extract_cb8e5163c01740ec8af1d292c5167139",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/user-guide/cost-understanding-compute",
      "title": "Understanding compute cost | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "[DOCUMENTATION](https://docs.snowflake.com)\n\n/\n\nEN\n\nEnglish\n\nFrançais\n\nDeutsch\n\n日本語\n\n한국어\n\nPortuguês\n\nGet started\n\nGuides\n\nDeveloper\n\nReference\n\nRelease notes\n\nTutorials\n\n[Status](https://status.snowflake.com)\n\n1. Overview\n2. Snowflake Horizon Catalog\n3. Applications and tools for connecting to Snowflake\n4. Virtual warehouses\n5. Databases, Tables, & Views\n6. Data types\n7. Data Integration\n   \n    + Snowflake Openflow\n    + Apache Iceberg™\n         \n        - Apache Iceberg™ Tables\n        - Snowflake Open Catalog\n8. Data engineering\n   \n    + Data loading\n    + Dynamic tables\n    + Streams and tasks\n    + Row timestamps\n    + dbt Projects on Snowflake\n    + Data Unloading\n9. Storage lifecycle policies\n10. Migrations\n11. Queries\n12. Listings\n13. Collaboration\n14. Snowflake AI & ML\n15. Snowflake Postgres\n16. Alerts & Notifications\n17. Security\n18. Data Governance\n19. Privacy\n20. Organizations & Accounts\n21. Business continuity & data recovery\n22. Performance optimization\n23. Cost & Billing\n    \n        - Cost Management\n        - Overview\n        - Understanding cost\n              \n                + Understanding compute cost\n                + Understanding storage cost\n                + Understanding data transfer cost\n        - Access control\n        - Visibility\n              \n            * Exploring cost\n            * Cost anomalies\n            * Attributing cost\n        - Control\n        - Optimization\n        - Billing Management\n        - Accessing billing invoices\n        - Accessing usage statements\n        - Reconciling usage statements\n        - Updating billing contacts\n\nGuides Cost & Billing Understanding cost Understanding compute cost\n\n# Understanding compute cost ¶\n\nCompute costs represent credits used for:\n\n* Virtual Warehouse compute — Virtual warehouses consume credits as they execute queries, load\n  data and perform other DML operations. Virtual Warehouses are user-managed , which means you can directly\n  control credit consumption of these resources.\n* Serverless compute —\n  Serverless features use compute resources that are managed by Snowflake instead of using virtual warehouses.\n* Compute pools — Compute pools provide the compute resources for Snowpark Container Services.\n* Cloud Services compute — Cloud Services is the layer of the Snowflake architecture that\n  performs services that tie together all the different components of Snowflake to process user requests, login, query display, and more.\n  Cloud Services compute resources are managed by Snowflake.\n\n## Virtual warehouse credit usage ¶\n\nA virtual warehouse is one or more clusters of compute resources that enable executing queries, loading data, and performing other DML\noperations. The web interface and other features use warehouses, such as Cross-Cloud Auto-Fulfillment or display information in dashboards.\n\nSnowflake credits are used to pay for the processing time used by each virtual warehouse.\nSnowflake credits are charged based on the number of virtual warehouses you use, how long they run, and their size.\n\nWarehouses come in many sizes. In this table, the size specifies the compute resources per cluster available to the warehouse.\nEach increase in size to the next larger warehouse approximately doubles the computing power and the number of credits billed per\nfull hour that the warehouse runs.\n\nFor information on credit consumption, see the [Snowflake Service Consumption Table](https://www.snowflake.com/legal-files/CreditConsumptionTable.pdf) .\n\nImportant\n\nWarehouses are only billed for credit usage while running. When a warehouse is suspended, it does not use any credits.\n\nThe credit numbers shown above are for a full hour of usage; however, credits are billed per-second, with a 60-second (i.e. 1-minute)\nminimum:\n\n* Each time a warehouse is started or resumed , the warehouse is billed for 1 minute’s worth of usage based on the hourly\n  rate shown above.\n* Each time a warehouse is resized to a larger size, the warehouse is billed for 1 minute’s worth of usage; however, the number\n  of credits billed are only for the additional compute resources that are provisioned. For example, resizing from Small\n  (2 credits/hour) to Medium (4 credits/hour) results in billing charges for 1 minute’s worth of 2 additional credits.\n* After 1 minute, all subsequent billing is per-second as long as the warehouse runs continuously.\n* Suspending and then resuming a warehouse within the first minute results in multiple charges because the 1-minute minimum starts\n  over each time a warehouse is resumed.\n* Resizing a warehouse from 5X-Large or 6X-Large to 4X-Large (or smaller) results in a brief period during which the warehouse is\n  billed for both the new compute resources and the old resources while the old resources are quiesced.\n\nFor more information on warehouses in general, see Overview of warehouses and Warehouse considerations .\n\nTo learn how to view the historical cost of consuming compute resources with virtual warehouses, see Exploring compute cost .\n\n## Serverless credit usage ¶\n\nServerless credit usage is the result of features relying on compute resources provided by Snowflake rather than user-managed\nvirtual warehouses. These compute resources are automatically resized and scaled up or down by Snowflake as required for each workload.\n\nFor these serverless features, which usually require continuous and/or maintenance operations, this model is more efficient, allowing\nSnowflake to charge based on the time spent using the resources. In contrast, user-managed virtual warehouses consume credits while running,\nregardless of whether they are performing any work, which may cause them to be overutilized or sit idle.\n\nCharges for serverless features are calculated based on total usage of snowflake-managed compute resources measured in _compute-hours_ .\nCompute-Hours are calculated on a per second basis, rounded up to the nearest whole second. The number of credits consumed per compute\nhour varies depending on the serverless feature.\n\nTo learn how many credits are consumed by a serverless feature, refer to the “Serverless Feature Credit Table” in the [Snowflake Service Consumption Table](https://www.snowflake.com/legal-files/CreditConsumptionTable.pdf) .\n\nCharges for the use of a serverless feature appear on your bill as an individual line item. Charges for both Snowflake-managed compute\nresources and Cloud Services appear as a single line item for that serverless feature.\n\nTo learn how to view the historical cost of using serverless compute resources, see Exploring compute cost .\n\n## Compute pool credit usage ¶\n\nSnowpark Container Services uses compute pools to run its jobs and services.\nA compute pool is a collection of one or more virtual machine (VM) nodes. The number and type of these nodes determine how many credits the\njob or service consumes as it uses the compute pool.\n\nFor more information about the cost of compute pools, including how to monitor these costs, see Compute pool cost .\n\n## Cloud service credit usage ¶\n\nThe cloud services layer of the Snowflake architecture is a collection of services that coordinate activities across Snowflake.\nThis layer authenticates users, enforces security, performs query compilation and optimization, handles request query caching, and more.\nCloud services tie together all of the different components of Snowflake, including supporting the use of virtual warehouses.\n\nThe cloud services layer is constructed of stateless compute resources, running across multiple availability zones and using a highly\navailable, distributed metadata store for global state management. The cloud services layer runs on compute instances provisioned by\nSnowflake from the cloud provider.\n\nSimilar to virtual warehouse usage, Snowflake credits are used to pay for the usage of the cloud\nservices.\n\nSnowflake Marketplace calculates compute costs for listing auto-fulfillment to VPS regions by using VPS rates. For details on VPS rates, see [Snowflake Service Consumption Table](https://www.snowflake.com/legal-files/CreditConsumptionTable.pdf) .\n\n### Understanding billing for cloud services usage ¶\n\nUsage for cloud services is charged only if the daily consumption of cloud services exceeds 10% of the daily usage of virtual warehouses.\nThe charge is calculated daily (in the UTC time zone). This ensures that the 10% adjustment is accurately applied each day, at the credit\nprice for that day.\n\nKeep the following in mind:\n\n* Serverless compute does not factor into the 10% adjustment for cloud services.\n* The 10% adjustment for cloud services is calculated daily (in the UTC time zone) by multiplying daily warehouse usage by 10%.\n* The adjustment on the monthly usage statement is equal to the sum of these daily calculations.\n* If cloud services consumption is less than 10% of warehouse compute credits on a given day, then the adjustment for that day is equal to\n  the cloud services used by your account. The daily adjustment never exceeds actual cloud services usage for that day. Thus, the total\n  monthly adjustment may be significantly less than 10%.\n\nFor example:\n\n|Date |Compute Credits Used (Warehouses only) |Cloud Services Credits Used |Credit Adjustment for Cloud Services (Lesser of 10% of Compute or Cloud Services) |Credits Billed (Sum of Compute, Cloud Services, and Adjustment) |\n| --- | --- | --- | --- | --- |\n|Nov 1 |100 |20 |\\-10 |110 |\n|Nov 2 |120 |10 |\\-10 |120 |\n|Nov 3 |80 |5 |\\-5 |80 |\n|Nov 4 |100 |13 |\\-10 |103 |\n|**Total** |**400** |**48** |**\\-35** |**413** |\n\n### More about cloud services ¶\n\n* To learn how to view the historical cost of consuming cloud services resources, see Exploring compute cost , which\n  includes sample queries you can run to see how much of cloud services consumption was\n  actually billed and which queries and warehouses have the highest cloud services usage.\n* To learn about patterns that drive cloud services consumption and ways that you might be able to reduce that consumption, see Optimizing cloud services for cost .\n\n## What are credits? ¶\n\nSnowflake credits are used to pay for the consumption of resources on Snowflake. A Snowflake credit is a unit of measure, and it is\nconsumed only when a customer is using resources, such as when a virtual warehouse is running, the cloud services layer is performing work,\nor serverless features are used.\n\n**Next Topic**\n    * Exploring compute cost\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Virtual warehouse credit usage\n2. Serverless credit usage\n3. Compute pool credit usage\n4. Cloud service credit usage\n5. What are credits?\n\nRelated content\n\n1. Understanding overall cost\n2. Exploring compute cost"
      ],
      "full_content": null
    }
  ],
  "errors": [],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 1
    }
  ]
}
