{
  "extract_id": "extract_bf0ad525a81f4e289ef45af4776943d6",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/user-guide/resource-monitors",
      "title": "Working with resource monitors | Snowflake Documentation",
      "publish_date": null,
      "excerpts": [
        "Guides Cost & Billing Control Resource monitors\n\n# Working with resource monitors ¶\n\nA _resource monitor_ can help control costs and avoid unexpected credit usage caused by running warehouses. A virtual warehouse consumes Snowflake credits while it runs. You can use a resource monitor\nto monitor credit usage by virtual warehouses and the cloud services needed to support those warehouses. You can also set up a resource\nmonitor to suspend a user-managed virtual warehouse when it reaches a credit limit.\n\nImportant\n\nResource monitors work for warehouses only. You can’t use a resource monitor to track spending associated with serverless\nfeatures and AI services. To monitor credit consumption by these features, use a budget instead.\n\nThe number of credits consumed depends on the size of the warehouse and how long it runs. For more information on warehouse credit usage,\nsee Virtual warehouse credit usage .\n\nCredit usage limits can be set for a specified interval or date range. When a limit is reached and/or reaches a specified threshold,\nthe resource monitor can trigger various actions, such as sending alert notifications and/or suspending user-managed warehouses.\n\nOnly users with the ACCOUNTADMIN role can create a resource monitor, but an account administrator can grant privileges to other roles\nto allow other users to view and modify resource monitors.\n\n## Resource monitor properties ¶\n\nA resource monitor is a first-class object in Snowflake, consisting of the following properties:\n\n### Credit quota ¶\n\nCredit quota specifies the number of Snowflake credits allocated to the monitor for the specified frequency interval. Any number can be specified.\n\nIn addition, Snowflake tracks the _used credits/quota_ within the specified frequency interval by all warehouses assigned to the monitor.\nAt the specified interval, this number resets to `0` .\n\nCredit quota accounts for credits consumed by both user-managed virtual warehouses and virtual warehouses used by cloud services.\n\nFor example, your resource monitor limit is set at 1000 credits. If your warehouse consumes 700 credits, and cloud services consume 300\ncredits within a specified interval or date range, an alert will be triggered.\n\nNote\n\nResource monitor limits do not take into account the daily 10% adjustment for cloud services. Snowflake uses all credit consumption by\nthe cloud services layer to calculate whether a limit has been reached, even if that consumption is never billed. For more information\nabout how cloud services credits and adjustments are calculated, see Understanding billing for cloud services usage .\n\nFor instructions on how to view your cloud services credit usage, see Exploring compute cost .\n\n### Monitor type ¶\n\nThis property specifies whether the resource monitor is used to monitor your account or a specific set of individual warehouses:\n\n* An _account monitor_ monitors the credit usage of all the warehouses in the account. An account can only have one account monitor.\n* A _warehouse monitor_ monitors the credit usage of the warehouses assigned to the resource monitor. An account can have multiple\n  warehouse monitors.\n  \n  A warehouse monitor can have one or more warehouses assigned to it, but each warehouse can only be assigned to one resource monitor.\n\nIf this property is not set, the resource monitor doesn’t monitor any credit usage. It simply remains dormant.\n\nFor more information, see Assignment of resource monitors .\n\n### Schedule ¶\n\nThe default schedule for a resource monitor specifies that it starts monitoring credit usage immediately and the used credits reset to `0` at the beginning of each calendar month (i.e. the start of the standard Snowflake billing cycle).\n\nHowever, you can optionally customize the schedule for a resource monitor using the following properties:\n\nFrequency :\n    The interval at which the used credits reset relative to the specified start date.\n\nSupported values:\n\n* Daily\n* Weekly\n* Monthly\n* Yearly\n* Never (used credits never reset; assigned warehouses continue using credits until the credit quota is reached)\n\nStart :\n    Date and time (i.e. timestamp) when the resource monitor starts monitoring the assigned warehouses.\n\nSupported values:\n\n* Immediately (i.e. current timestamp)\n* Later (i.e. any future timestamp)\n\nIn addition, Snowflake uses this date to determine when to reset the used credits, based on the specified frequency. Note, however, that\nregardless of the time specified in the start date and time, resource monitors reset at 12:00 AM UTC. For example, if the start is\n15-July-2019 (Monday) at 8:00 AM:\n\n* Frequency = Monthly: Used credits reset at 12:00 AM UTC on the 15th of each following month.\n* Frequency = Weekly: Used credits reset at 12:00 AM UTC on each following Monday.\n\nNote that, if you specify the last day of a month as the start date, Snowflake resets the used credits on the last day of all following\nmonths, regardless of the number of days in the month. For example, if you set the start date to January 31, Snowflake subsequently resets\nthe used credits for the resource monitor on February 28 (or February 29 in a leap year), March 31, April 30, and so on.\nEnd :\n    Date and time (i.e. timestamp) when Snowflake suspends the warehouses associated with the resource monitor, regardless of whether the\nused credits reached any of the thresholds defined for the resource monitor’s actions (see the next section in this topic).\n\nSupported values: Any future timestamp.\n\nNote that this property is not commonly used.\n\nImportant\n\nIf you choose to customize the schedule for a resource monitor, the frequency is relative to the specified start date, which is\ndifferent than the default schedule.\n\nAlso, if you specify a frequency, you must also specify a start date and time, and vice versa (i.e. you cannot set one without setting the\nother).\n\n### Actions ¶\n\nAlso referred to as _triggers_ , each action specifies a threshold, as a percentage of the credit quota for the resource monitor, and the\naction to perform when the threshold is reached within the specified interval. Note that actions support thresholds greater than `100` .\n\nResource monitors support the following actions:\n\nNotify & Suspend :\n    Send a notification and suspend all assigned warehouses after all statements being executed by the warehouse(s) have completed.\nNotify & Suspend Immediately :\n    Send a notification and suspend all assigned warehouses immediately, which cancels any statements being executed by the warehouses\nat the time.\nNotify :\n    Perform no action on warehouses, but send a notification.\n\nNotifications are sent to all account administrators with notifications enabled. Email notifications for resource monitors that monitor\nwarehouses are also sent to any non-administrator user that is enabled to receive those notifications.\n\nNote\n\nNon-administrator users can only receive email notifications for _warehouse_ monitors.\n\nEach resource monitor can have the following actions:\n\n* One **Suspend** action.\n* One **Suspend Immediate** action.\n* Up to five **Notify** actions.\n\nNote\n\nA resource monitor must have at least one action defined; if no actions have been defined, nothing happens when the used credits reach\nthe threshold.\n\n## Assignment of resource monitors ¶\n\nA single monitor can be set at the account level to control credit usage for all warehouses in your account.\n\nIn addition, a one or more warehouses can be assigned to a resource monitor, thereby controlling the credit usage for each assigned\nwarehouse. Note, however, that a warehouse can be assigned to only a single resource monitor below the account level.\n\nThe following diagram illustrates a scenario in which one resource monitor is set at the account level and individual warehouses are\nassigned to two other resource monitors:\n\nBased on this diagram:\n\n* The credit quota for the entire account is 5000 for the interval (month, week, etc.), as controlled by Resource Monitor 1; if this quota\n  is reached within the interval, the actions defined for the resource monitor ( **Suspend** , **Suspend Immediate** , etc.) are enforced for\n  all five warehouses.\n* Warehouse 3 can consume a maximum of 1000 credits within the interval.\n* Warehouse 4 and 5 can consume a maximum combined total of 2500 credits within the interval.\n\nNote that the actual credits consumed by Warehouses 3, 4, and 5 may be less than their quotas if the quota for the account is reached first.\n\nImportant\n\n* An account-level resource monitor does not override resource monitor assignment for individual warehouses. If either the account\n  resource monitor or the warehouse resource monitor reaches its defined threshold and a suspend action has been defined, the warehouse is\n  suspended.\n* An account-level resource monitor does not control credit usage by the Snowflake-provided compute resources for serverless features (for\n  example, Snowpipe, automatic reclustering, and materialized views).\n\n## Warehouse suspension and resumption ¶\n\nThe used credits for a resource monitor reflect the sum of credits consumed by all assigned warehouses within the specified interval,\nalong with the cloud services used to support those warehouses during the same interval. If a monitor has a **Suspend** or **Suspend Immediately** action defined and its used credits reach the threshold for the action, any warehouses assigned to the monitor are suspended\nand cannot be resumed until one of the following conditions is met:\n\n* The next interval, if any, starts, as dictated by the start date for the monitor.\n* The credit quota for the monitor is increased.\n* The credit threshold for the suspend action is increased.\n* The warehouses are no longer assigned to the monitor.\n* The monitor is dropped.\n\nA warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. After a virtual warehouse is\nsuspended, subsequent queries run against that warehouse can still result in additional cloud services costs. For more information\nabout credit usage for cloud services, see Cloud service credit usage .\n\nTip\n\nResource monitors are not intended for strictly controlling consumption on an hourly basis; they are intended for tracking and\ncontrolling credit consumption per interval (day, week, month, etc.). Also, they are not intended for setting precise limits on credit\nusage (i.e. down to the level of individual credits). For example, when credit quota thresholds are reached for a resource monitor, the\nassigned warehouses may take some time to suspend, even when the action is **Suspend Immediate** , thereby consuming additional credits.\n\nIf you wish to strictly enforce your quotas, we recommend the following:\n\n* Utilize buffers in the quota thresholds for actions (e.g. set a threshold to 90% instead of 100%).\n  \n  This will help ensure that your credit usage doesn’t exceed the quota.\n* To more strictly control credit usage for individual warehouses, assign only a single warehouse to each resource monitor.\n  \n  When multiple warehouses are assigned to the same resource monitor, they share the same quota thresholds, which may result in credit\n  usage for one warehouse impacting the other assigned warehouses.\n\n## Resource monitor notifications ¶\n\nWhen a resource monitor reaches the threshold for an action , it generates a notification\nsimilar to the following notification:\n\n```\nResource Monitor MY_ACCOUNT_MONITOR has reached 50% of its MONTHLY \n quota of 500 credits which has triggered a <action> action.\n```\n\nThe `<action>` is one of the following actions:\n\n* NOTIFY\n* SUSPEND\n* SUSPEND\\_IMMEDIATE\n\nNotification behavior depends on the type of resource monitor and whether or not notifications\nare enabled for an individual user. Notifications are sent as follows:\n\n* For _warehouse_ monitors, a notification is sent to the following users:\n  \n    + All account administrators who have enabled resource monitor notifications.\n    + Non-administrator users in the notification list for the resource monitor.\n* For _account_ monitors, a notification is sent to the following users:\n  \n    + The account administrator with the OWNERSHIP privilege on the resource monitor if they have enabled notifications.\n    + All account administrators who have enabled notifications using Snowsight.\n  \n  Note\n  \n  A non-administrator user can’t be added to the notification list for an _account_ monitor.\n\nImportant\n\nResource monitor notifications can be sent by email or in Snowsight, but are disabled by default. You must set up\nnotifications before they are sent. Users that do not have the ACCOUNTADMIN role can only be sent email notifications.\n\nTo enable notifications, see Enabling receipt of notifications .\n\n## DDL for resource monitors ¶\n\nSnowflake provides the following DDL commands for creating and using/managing resource monitors:\n\n* CREATE RESOURCE MONITOR\n* ALTER RESOURCE MONITOR\n* SHOW RESOURCE MONITORS\n* DROP RESOURCE MONITOR\n\nIn addition, the following DDL commands can be used to assign a resource monitor to a warehouse and determine whether a warehouse is assigned to\na monitor:\n\n* CREATE WAREHOUSE or ALTER WAREHOUSE\n* SHOW WAREHOUSES\n\n## Access control privileges for resource monitors ¶\n\nBy default, resource monitors can only be created by account administrators and, therefore, can only be viewed and maintained by them.\n\nHowever, roles that have been granted the following privileges on specific resource monitors can view and modify the resource monitor as\nneeded using SQL:\n\n* MONITOR\n* MODIFY\n\nFor more information, see Access control privileges and GRANT <privileges> … TO ROLE .\n\nNote that only account administrators can view and manage resource monitors via the Snowsight.\n\n## Enabling receipt of notifications ¶\n\nBefore you can receive any notifications from resource monitors, you must enable notifications in the web interface and verify your email.\n\nSnowsight :\n    To enable notifications, follow these steps:\n\n1. Verify your email address if you haven’t already done so. For instructions on how to verify your email address, see Verify your email address .\n2. Select your username, then select Profile\n3. For Notifications , select Enable notifications from resource monitors .\n   \n   Note\n   \n    + If you haven’t verified your email address, the Notifications option isn’t available until you verify your email.\n    + In Notifications , the Enable notifications from resource monitors option is only available to users with\n         the ACCOUNTADMIN role in the following cases:\n         \n        - If there is a resource monitor assigned to the account and the account administrator has the OWNERSHIP privilege\n                   on the account monitor.\n        - If there are warehouse monitors in the account. All account administrators can receive notifications for warehouse monitors.\n\n## Creating resource monitors ¶\n\nResource monitors can be created through either the web interface or SQL; however, only account administrators (i.e. users with the\nACCOUNTADMIN role) can create resource monitors.\n\nA resource monitor can’t be assigned more than 500 warehouses.\n\nImportant\n\nYou must assign at least one warehouse to a resource monitor or set the monitor at the account level for it to begin\nmonitoring/tracking credit usage:\n\n* In the web interface, you are required to do this at creation time.\n* In SQL, you must create the resource monitor first, then assign one or more warehouses to it by executing ALTER WAREHOUSE as a separate,\n  additional step.\n\nAlso, to receive notifications when resource monitor actions are triggered, you must enable notifications .\n\n### Creating a resource monitor with a default schedule ¶\n\nYou can create a resource monitor that uses the default schedule using the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can create resource monitors.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select \\+ Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\n   choose Warehouse to select the warehouses to monitor.\n7. For Actions , choose which notifications to enable by entering a threshold next to the option. You must select at\n   least one option.\n   \n   Select Add to create additional notifications. You can specify up to five notify actions.\n\nSQL :\n    In SQL, this task is performed in two steps:\n\n1. Execute a CREATE RESOURCE MONITOR command, but do not specify any scheduling properties.\n2. Execute an ALTER WAREHOUSE statement to assign warehouses to the resource monitor or an ALTER ACCOUNT statement to set the resource monitor for the account.\n\nFor example:\n\n* To create a monitor that starts monitoring immediately, resets at the beginning of each month, and suspends the assigned warehouse\n  when the used credits reach 100% of the credit quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >   TRIGGERS ON 100 PERCENT DO SUSPEND ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  The SUSPEND action waits for currently executing queries to finish before suspending the warehouse. A query might start before the\n  threshold is reached and complete after the SUSPEND action is triggered. In this case, the warehouse continues to consume credits\n  even after the quota is reached.\n* To create a similar monitor that suspends at 90% and suspends immediately at 100% after the quota has been reached:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >   TRIGGERS ON 90 PERCENT DO SUSPEND \n  >            ON 100 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  In this example, a notification is sent and the assigned warehouses are suspended when 90% of the credit quota is reached.\n  Currently executing queries complete, but the resource monitor prevents the warehouses from executing any new queries.\n  If the assigned warehouses reach 100% of the credit quota, a notification is sent and the warehouses are suspended immediately,\n  canceling all currently executing queries. This prevents all warehouses in the account from consuming credits.\n* To create a monitor that is similar to the first example, but lets the assigned warehouse exceed the quota by 10% and also includes two\n  notification actions to alert account administrators as the used credits reach the halfway and three-quarters points for the quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >    TRIGGERS ON 50 PERCENT DO NOTIFY \n  >             ON 75 PERCENT DO NOTIFY \n  >             ON 100 PERCENT DO SUSPEND \n  >             ON 110 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  In this example:\n  \n    + When 50% and 75% usage is reached, an alert notification is sent to all account administrators who have enabled notifications, but no\n        other actions are performed.\n    + When 100% usage is reached, the assigned warehouse is suspended.\n    + If the warehouse is still running when 110% usage is reached, it is suspended immediately.\n\n### Creating a resource monitor with a custom schedule ¶\n\nYou can create a resource monitor that uses a schedule other than the default using the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can create resource monitors.\n\nComplete the following steps to create a resource monitor with a custom schedule:\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select \\+ Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\n   choose Warehouse to select the warehouses to monitor.\n7. Select Schedule » Customize to set a custom schedule for the specified interval. You can skip this step to use the default schedule .\n   \n   You can set a custom start and end date using Custom Start Date and Custom End Date , or specify a date range\n   by using the Range tab.\n   \n   Note\n   \n   If you choose to end monitoring at a specified date and time, all assigned warehouses are suspended on that date and time even\n   if the credit quota has not been reached. A notification is sent when this occurs that states the resource monitor has reached\n   a percentage of its quota and has triggered a suspend immediate action. The percentage of the quota reflects the number\n   of used credits in the current interval up to the end date and might not be a threshold you specified.\n   \n   You can also customize the specified interval for monitoring. Select Resets and you can select from the following periodic\n   intervals at which to reset the credit quota:\n   \n    + Monthly\n    + Daily\n    + Weekly\n    + Yearly\n    + Never\n8. For Actions , choose which notifications to enable by entering a threshold next to the option. You must select at\n   least one option.\n   \n   Select Add to create additional notifications. You can specify up to five notify actions.\n9. For Actions and Notifications , enable a given action or notification by entering a threshold next to the option.\n   You must select at least one option.\n   \n   Select \\+Add more notification thresholds to create additional notifications. You can specify up to five notify actions.\n\nSQL :\n    Execute a CREATE RESOURCE MONITOR command, with one or more of the following scheduling properties:\n\n* FREQUENCY\n* START\\_TIMESTAMP\n* END\\_TIMESTAMP\n\nFor example:\n\n* To create an account-level resource monitor that starts immediately (based on the current timestamp), resets monthly on the same day,\n  has no end date or time, and suspends the assigned warehouse when the used credits reach 100% of the quota:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 1000 \n  >     FREQUENCY = MONTHLY \n  >     START_TIMESTAMP = IMMEDIATELY \n  >     TRIGGERS ON 100 PERCENT DO SUSPEND ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  >\n* To create a resource monitor that starts at a specific date and time in the future, resets weekly on the same day, has no end date or\n  time, and performs two different suspend actions at different thresholds on two assigned warehouses:\n  \n  > ```\n  > USE ROLE ACCOUNTADMIN ; \n  > \n  >  CREATE OR REPLACE RESOURCE MONITOR limit1 WITH CREDIT_QUOTA = 2000 \n  >     FREQUENCY = WEEKLY \n  >     START_TIMESTAMP = '2019-03-04 00:00 PST' \n  >     TRIGGERS ON 80 PERCENT DO SUSPEND \n  >              ON 100 PERCENT DO SUSPEND_IMMEDIATE ; \n  > \n  >  ALTER WAREHOUSE wh1 SET RESOURCE_MONITOR = limit1 ; \n  > \n  >  ALTER WAREHOUSE wh2 SET RESOURCE_MONITOR = limit1 ;\n  > ```\n  > \n  > Copy\n  > \n  >\n\nNote\n\nYou cannot change the customized schedule for a resource monitor back to the default. You must drop the monitor and create a new monitor.\n\n## Modifying a resource monitor ¶\n\nYou can modify the following properties for an existing resource monitor:\n\n* Increase or decrease the credit quota for the monitor.\n* Customize the schedule (frequency, start timestamp, and end timestamp) for the monitor.\n* Add or remove actions, or modify the threshold percentages for existing actions.\n* If the monitor is monitoring your account, convert it to monitor individual warehouses.\n* If the monitor is monitoring individual warehouses:\n  \n    + Add or remove warehouses from the list.\n    + Convert it to monitor your account.\n\nNote\n\nChanging any of these properties does not affect the used credits to-date for the monitor. All changes only affect used credits\nafter the changes are saved.\n\nResource monitors can be modified through the web interface or SQL.\n\nNote\n\nThe following privileges are required to modify the properties of a resource monitor:\n\n* To modify the credit quota, schedule, or actions for a resource monitor, a user must use a role with the MODIFY\n  privilege on the resource monitor.\n* To modify the monitor type for a resource monitor from warehouse to account or vice versa, a user must use the\n  ACCOUNTADMIN role.\n* To modify the list of warehouses for a warehouse-level resource monitor, a user must use the ACCOUNTADMIN role.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\n\nSQL :\n    * To change the quota, customize the schedule, or add/remove/modify actions, execute an ALTER RESOURCE MONITOR statement.\n  \n  For example, to increase the credit quota for resource monitor `limit1` to `3000` , execute the following statement:\n  \n  > ```\n  > ALTER RESOURCE MONITOR limit1 SET CREDIT_QUOTA = 3000 ;\n  > ```\n  > \n  > Copy\n  > \n  > \n  \n  For more examples, see Examples .\n\n* To change the monitor type, execute an ALTER WAREHOUSE or ALTER ACCOUNT statement.\n  \n  For example, to change resource monitor `my_rm` which currently monitors warehouses to monitor\n  the account `my_account` , execute the following steps:\n  \n    1. Find all the warehouses the resource monitor `my_rm` is monitoring. Check the `resource_monitor` column for `my_rm` :\n         \n         ```\n         SHOW WAREHOUSES ;\n         ```\n         \n         Copy\n         \n         Returns the following results:\n         \n         ```\n         +--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------+ \n          | name   | state     | type     | size    | running | queued | is_default | is_current | auto_suspend | auto_resume | available | provisioning | quiescing | other | created_on                    | resumed_on                    | updated_on                    | owner        | comment | resource_monitor | actives | pendings | failed | suspended | uuid       | budget | owner_role_type | \n          |--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------| \n          | MY_WH1 | STARTED   | STANDARD | X-Small |       0 |      0 | N          | N          |          600 | true        |           |              |           |       | 2024-01-17 14:37:36.223 -0800 | 2024-01-17 14:37:36.325 -0800 | 2024-01-17 14:47:49.854 -0800 | MY_ROLE      |         | null             |       0 |        0 |      0 |         1 | 1222706972 | NULL   | ROLE            | \n          | MY_WH2 | SUSPENDED | STANDARD | X-Small |       0 |      0 | N          | Y          |          600 | true        |           |              |           |       | 2023-12-20 13:50:50.972 -0800 | 2024-01-17 14:28:39.170 -0800 | 2024-01-17 14:37:57.560 -0800 | ACCOUNTADMIN |         | MY_RM            |       0 |        0 |      0 |         1 | 1222706948 | NULL   | ROLE            | \n          | MY_WH3 | SUSPENDED | STANDARD | Small   |       0 |      0 | N          | N          |          600 | true        |           |              |           |       | 2024-01-17 14:26:26.911 -0800 | 2024-01-17 14:33:39.260 -0800 | 2024-01-17 14:38:31.192 -0800 | ACCOUNTADMIN |         | MY_RM            |       0 |        0 |      0 |         2 | 1222706960 | NULL   | ROLE            | \n          +--------+-----------+----------+---------+---------+--------+------------+------------+--------------+-------------+-----------+--------------+-----------+-------+-------------------------------+-------------------------------+-------------------------------+--------------+---------+------------------+---------+----------+--------+-----------+------------+--------+-----------------+\n         ```\n         \n         Resource monitor `my_rm` is monitoring two warehouses `my_wh2` and `my_wh3` .\n    2. Remove the resource monitor for both warehouses by executing the following statements:\n         \n         ```\n         ALTER WAREHOUSE my_wh2 UNSET RESOURCE_MONITOR ; \n         \n          ALTER WAREHOUSE my_wh3 UNSET RESOURCE_MONITOR ;\n         ```\n         \n         Copy\n    3. Change the resource monitor to monitor the account by executing the following statement:\n         \n         ```\n         ALTER ACCOUNT my_account SET RESOURCE_MONITOR = my_rm ;\n         ```\n         \n         Copy\n\nNote\n\nIf a resource monitor has a customized schedule, you cannot change the schedule back to the default. You must drop the monitor and\ncreate a new monitor.\n\n## Send resource monitor notifications to non-administrator users ¶\n\nNon-administrator users can only receive email notifications for warehouse monitors . Each non-administrator\nuser must have a verified email address. You can add up to five non-administrator users to a warehouse monitor using the CREATE RESOURCE\nMONITOR or ALTER RESOURCE MONITOR command.\n\nFor example, to add users `user1` and `user2` to the warehouse monitor `my_warehouse_rm` , execute the following\nstatement:\n\n```\nALTER RESOURCE MONITOR my_warehouse_rm \n  SET NOTIFY_USERS = ( USER1 , USER2 );\n```\n\nCopy\n\nNote\n\nIf any user in the notification list does not have a verified email, the statement fails.\n\nFor more information, see the NOTIFY\\_USERS parameter and Usage notes in the ALTER RESOURCE MONITOR topic.\n\nTo add non-administrator users to the notification list for a resource monitor when you create a resource monitor using SQL, see CREATE RESOURCE MONITOR .\n\n## Setting a resource monitor for your account ¶\n\nA resource monitor can be set for your account through the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can set a resource monitor to monitor the account.\n\nSnowsight :\n    You can set the monitor type to account when you create a resource monitor. For more information,\nsee Creating resource monitors .\nSQL :\n    In SQL, this task is performed in two steps:\n\n1. Use the CREATE RESOURCE MONITOR command to create the resource monitor (if it doesn’t already exist).\n   \n   If the resource monitor does exist, to change a warehouse level resource monitor to monitor an account, see the example in the Modifying a Resource Monitor section .\n2. Use the ALTER ACCOUNT command to set the resource monitor you created as the monitor for your account.\n   \n   For example, to set the account resource monitor to `my_account_rm` , execute the following statements:\n   \n   > ```\n   > USE ROLE ACCOUNTADMIN ; \n   > \n   >  CREATE RESOURCE MONITOR my_account_rm WITH CREDIT_QUOTA = 10000 \n   >   TRIGGERS ON 100 PERCENT DO SUSPEND ; \n   > \n   >  ALTER ACCOUNT SET RESOURCE_MONITOR = my_account_rm ;\n   > ```\n   > \n   > Copy\n   > \n   >\n\nTo change the monitor type of an existing resource monitor from a warehouse monitor to an account monitor, see the example in the Modifying a Resource Monitor section .\n\nTo view whether a resource monitor is set for your account, use the web interface or the SHOW RESOURCE MONITORS command. The `LEVEL` column for a resource monitor displays whether it is set for your account or individual warehouses.\n\nImportant\n\n* An account-level resource monitor only controls the virtual warehouses explicitly created in your account; it does not control credit\n  usage by the Snowflake-provided warehouses for serverless features (for example, Snowpipe , Automatic Clustering , and materialized views ).\n* A warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. The monitor can only\n  suspend the user-managed virtual warehouses created in your account. After a user-managed virtual warehouse is suspended, subsequent\n  queries run against that warehouse can still result in additional cloud services costs. For more information about credit usage for cloud\n  services, see Cloud service credit usage .\n\n## Assigning warehouses to a resource monitor ¶\n\nWarehouses can be assigned to an existing resource monitor through the web interface or SQL.\n\nNote\n\nOnly users with the ACCOUNTADMIN role can assign warehouses to resource monitors.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\n5. If Monitor Type is Account , select Warehouse .\n6. Select Warehouse to choose the warehouses to monitor.\n\nSQL :\n    Use the ALTER WAREHOUSE command to assign a warehouse to a resource monitor.\n\nFor example, to monitor warehouse `my_wh` with the resource monitor `my_rm` , execute the following statement:\n\n> ```\n> ALTER WAREHOUSE my_wh SET RESOURCE_MONITOR = my_rm ;\n> ```\n> \n> Copy\n> \n>\n\n## Viewing resource monitors ¶\n\nResource monitors can be viewed through the web interface or SQL.\n\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors to see a list of resource monitors for which your role has been granted the MODIFY or MONITOR\n   privilege. Account administrator users can see all resource monitors.\n4. Select a resource monitor to view detailed information about resource monitor settings, current credit usage, and a list of\n   roles with privileges on the resource monitor.\n5. Select Account  » Resource Monitors .\n\nSQL :\n    Using the ACCOUNTADMIN role or a role that has been granted the MONITOR or MODIFY privilege on the resource monitor, execute\na SHOW RESOURCE MONITORS statement.\n\nIn addition, using any role, you can execute a SHOW WAREHOUSES statement to view the warehouses owned\nby the role (or for which the role has been granted USAGE privilege). The output includes the resource monitor, if any, to which\nthe warehouse is assigned.\n\nNote\n\nFor provider accounts that have created reader accounts, Snowflake provides an additional view, RESOURCE\\_MONITORS . This view can be used for querying resource monitor usage\nin the provider’s reader accounts. For more information, see Account Usage .\n\n## Replicating resource monitors ¶\n\n Business Critical Feature\n\nResource monitor replication requires Business Critical (or higher). To inquire about upgrading, please contact [Snowflake Support](https://docs.snowflake.com/user-guide/contacting-support) .\n\nResource monitors can be replicated from a source account to target accounts using a replication or failover group . For more information, see Resource monitor replication .\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)"
      ],
      "full_content": null
    }
  ],
  "errors": [],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 1
    }
  ]
}
