{
  "search_id": "search_c46d3f49f78e4015bc999ecc90bf4875",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/user-guide/resource-monitors",
      "title": "Working with resource monitors | Snowflake Documentation",
      "excerpts": [
        "Section Title: Working with resource monitors ¶\nContent:\nCredit usage limits can be set for a specified interval or date range. When a limit is reached and/or reaches a specified threshold,\nthe resource monitor can trigger various actions, such as sending alert notifications and/or suspending user-managed warehouses.\nOnly users with the ACCOUNTADMIN role can create a resource monitor, but an account administrator can grant privileges to other roles\nto allow other users to view and modify resource monitors.\n ... \nSection Title: Working with resource monitors ¶ > Resource monitor properties ¶ > Credit quota ¶\nContent:\nCredit quota specifies the number of Snowflake credits allocated to the monitor for the specified frequency interval. Any number can be specified.\nIn addition, Snowflake tracks the *used credits/quota* within the specified frequency interval by all warehouses assigned to the monitor.\nAt the specified interval, this number resets to `0` .\nCredit quota accounts for credits consumed by both user-managed virtual warehouses and virtual warehouses used by cloud services.\nFor example, your resource monitor limit is set at 1000 credits. If your warehouse consumes 700 credits, and cloud services consume 300\ncredits within a specified interval or date range, an alert will be triggered.\nNote\nSection Title: Working with resource monitors ¶ > Resource monitor properties ¶ > Credit quota ¶\nContent:\nResource monitor limits do not take into account the daily 10% adjustment for cloud services. Snowflake uses all credit consumption by\nthe cloud services layer to calculate whether a limit has been reached, even if that consumption is never billed. For more information\nabout how cloud services credits and adjustments are calculated, see Understanding billing for cloud services usage .\nFor instructions on how to view your cloud services credit usage, see Exploring compute cost .\n ... \nSection Title: Working with resource monitors ¶ > Resource monitor properties ¶ > Actions ¶\nContent:\nAlso referred to as *triggers* , each action specifies a threshold, as a percentage of the credit quota for the resource monitor, and the\naction to perform when the threshold is reached within the specified interval. Note that actions support thresholds greater than `100` .\nResource monitors support the following actions:\nNotify & Suspend :\nSend a notification and suspend all assigned warehouses after all statements being executed by the warehouse(s) have completed.\nNotify & Suspend Immediately :\nSend a notification and suspend all assigned warehouses immediately, which cancels any statements being executed by the warehouses\nat the time.\nNotify :\nPerform no action on warehouses, but send a notification.\n ... \nSection Title: Working with resource monitors ¶ > Assignment of resource monitors ¶\nContent:\nThe credit quota for the entire account is 5000 for the interval (month, week, etc.), as controlled by Resource Monitor 1; if this quota\nis reached within the interval, the actions defined for the resource monitor ( **Suspend** , **Suspend Immediate** , etc.) are enforced for\nall five warehouses.\nWarehouse 3 can consume a maximum of 1000 credits within the interval.\nWarehouse 4 and 5 can consume a maximum combined total of 2500 credits within the interval.\nNote that the actual credits consumed by Warehouses 3, 4, and 5 may be less than their quotas if the quota for the account is reached first.\nImportant\n ... \nSection Title: Working with resource monitors ¶ > Warehouse suspension and resumption ¶\nContent:\nIf you wish to strictly enforce your quotas, we recommend the following:\nUtilize buffers in the quota thresholds for actions (e.g. set a threshold to 90% instead of 100%).This will help ensure that your credit usage doesn’t exceed the quota.\nTo more strictly control credit usage for individual warehouses, assign only a single warehouse to each resource monitor.When multiple warehouses are assigned to the same resource monitor, they share the same quota thresholds, which may result in credit\nusage for one warehouse impacting the other assigned warehouses.\nSection Title: Working with resource monitors ¶ > Resource monitor notifications ¶\nContent:\nWhen a resource monitor reaches the threshold for an action , it generates a notification\nsimilar to the following notification:\n```\nResource Monitor MY_ACCOUNT_MONITOR has reached 50% of its MONTHLY \n quota of 500 credits which has triggered a <action> action.\n```\nThe `<action>` is one of the following actions:\nNOTIFY\nSUSPEND\nSUSPEND_IMMEDIATE\nNotification behavior depends on the type of resource monitor and whether or not notifications\nare enabled for an individual user. Notifications are sent as follows:\n ... \nSection Title: Working with resource monitors ¶ > ... > Creating a resource monitor with a default schedule ¶\nContent:\nYou can create a resource monitor that uses the default schedule using the web interface or SQL.\nNote\nOnly users with the ACCOUNTADMIN role can create resource monitors.\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select + Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\nchoose Warehouse to select the warehouses to monitor.\n7. For Actions , choose which notifications to enable by entering a threshold next to the option. You must select at\nleast one option.\nSelect Add to create additional notifications. You can specify up to five notify actions.\nSQL :\nIn SQL, this task is performed in two steps:\n ... \nSection Title: Working with resource monitors ¶ > ... > Creating a resource monitor with a default schedule ¶\nContent:\nTo create a monitor that starts monitoring immediately, resets at the beginning of each month, and suspends the assigned warehouse\nwhen the used credits reach 100% of the credit quota:CopyThe SUSPEND action waits for currently executing queries to finish before suspending the warehouse. A query might start before the\nthreshold is reached and complete after the SUSPEND action is triggered. In this case, the warehouse continues to consume credits\neven after the quota is reached. To create a similar monitor that suspends at 90% and suspends immediately at 100% after the quota has been reached:CopyIn this example, a notification is sent and the assigned warehouses are suspended when 90% of the credit quota is reached. Currently executing queries complete, but the resource monitor prevents the warehouses from executing any new queries.\nSection Title: Working with resource monitors ¶ > ... > Creating a resource monitor with a default schedule ¶\nContent:\nIf the assigned warehouses reach 100% of the credit quota, a notification is sent and the warehouses are suspended immediately,\ncanceling all currently executing queries. This prevents all warehouses in the account from consuming credits. To create a monitor that is similar to the first example, but lets the assigned warehouse exceed the quota by 10% and also includes two\nnotification actions to alert account administrators as the used credits reach the halfway and three-quarters points for the quota:CopyIn this example:\nWhen 50% and 75% usage is reached, an alert notification is sent to all account administrators who have enabled notifications, but no\nother actions are performed. When 100% usage is reached, the assigned warehouse is suspended. If the warehouse is still running when 110% usage is reached, it is suspended immediately.\nSection Title: Working with resource monitors ¶ > ... > Creating a resource monitor with a custom schedule ¶\nContent:\nYou can create a resource monitor that uses a schedule other than the default using the web interface or SQL.\nNote\nOnly users with the ACCOUNTADMIN role can create resource monitors.\nComplete the following steps to create a resource monitor with a custom schedule:\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select + Resource Monitor .\n4. For Name , enter a name for the resource monitor.\n5. For Credit Quota , enter the number of credits for each specified interval.\n6. Select the Monitor Type . Choose Account to create an account monitor or\nchoose Warehouse to select the warehouses to monitor.\n7. Select Schedule » Customize to set a custom schedule for the specified interval. You can skip this step to use the default schedule .\nSection Title: Working with resource monitors ¶ > ... > Creating a resource monitor with a custom schedule ¶\nContent:\nYou can set a custom start and end date using Custom Start Date and Custom End Date , or specify a date range\nby using the Range tab.\nNote\nIf you choose to end monitoring at a specified date and time, all assigned warehouses are suspended on that date and time even\nif the credit quota has not been reached. A notification is sent when this occurs that states the resource monitor has reached\na percentage of its quota and has triggered a suspend immediate action. The percentage of the quota reflects the number\nof used credits in the current interval up to the end date and might not be a threshold you specified.\nYou can also customize the specified interval for monitoring. Select Resets and you can select from the following periodic\nintervals at which to reset the credit quota:\n```\n+ Monthly\n+ Daily\n+ Weekly\n+ Yearly\n+ Never\n```\n ... \nSection Title: Working with resource monitors ¶ > Modifying a resource monitor ¶\nContent:\nTo modify the credit quota, schedule, or actions for a resource monitor, a user must use a role with the MODIFY\nprivilege on the resource monitor.\nTo modify the monitor type for a resource monitor from warehouse to account or vice versa, a user must use the\nACCOUNTADMIN role.\nTo modify the list of warehouses for a warehouse-level resource monitor, a user must use the ACCOUNTADMIN role.\nSnowsight :\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\nSQL :\n* To change the quota, customize the schedule, or add/remove/modify actions, execute an ALTER RESOURCE MONITOR statement.\nFor example, to increase the credit quota for resource monitor `limit1` to `3000` , execute the following statement:\nCopy\nFor more examples, see Examples ."
      ]
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/account-usage/resource_monitors",
      "title": "RESOURCE_MONITORS view - Snowflake Documentation",
      "excerpts": [
        "[DOCUMENTATION](https://docs.snowflake.com)\n/\nGet started\nGuides\nDeveloper\nReference\nRelease notes\nTutorials\n[Status](https://status.snowflake.com)\nReference General reference SNOWFLAKE database Account Usage RESOURCE_MONITORS\nSchema:\nACCOUNT_USAGE , READER_ACCOUNT_USAGE\nSection Title: RESOURCE_MONITORS view ¶\nContent:\nThis Account Usage view displays the resource monitors that have been created in the account.\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| READER_ACCOUNT_NAME | VARCHAR | Name of the reader account where the resource monitor was created. Column only included in view in READER_ACCOUNT_USAGE schema. |\n| NAME | VARCHAR | Name of the resource monitor. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the resource monitor was created. |\n| CREDIT_QUOTA | VARIANT | Monthly credit quota for the resource monitor. |\n| USED_CREDITS | VARIANT | Number of credits used in the current monthly billing cycle by all the warehouses associated with the resource monitor. |\n| REMAINING_CREDITS | FLOAT | Number of credits still available to use in the current monthly billing cycle. |\n| OWNER | VARCHAR | Name of the role that owns the resource monitor. |\n| WAREHOUSES | VARCHAR | Names of the warehouses that are associate with the resource monitor. |\n| NOTIFY | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, notifications are sent. |\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| READER_ACCOUNT_NAME | VARCHAR | Name of the reader account where the resource monitor was created. Column only included in view in READER_ACCOUNT_USAGE schema. |\n| NAME | VARCHAR | Name of the resource monitor. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the resource monitor was created. |\n| CREDIT_QUOTA | VARIANT | Monthly credit quota for the resource monitor. |\n| SUSPEND | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, assigned warehouses are suspended but currently running queries are allowed to complete. |\n| SUSPEND_IMMEDIATE | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, all assigned warehouses are suspended immediately, including those running queries. |\n| LEVEL | VARCHAR | Indicates whether it is an account-level or a warehouse-level resource monitor. |\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| READER_ACCOUNT_NAME | VARCHAR | Name of the reader account where the resource monitor was created. Column only included in view in READER_ACCOUNT_USAGE schema. |\n| NAME | VARCHAR | Name of the resource monitor. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the resource monitor was created. |\n| CREDIT_QUOTA | VARIANT | Monthly credit quota for the resource monitor. |\n| READER_ACCOUNT_DELETED_ON | TIMESTAMP_LTZ | Time and date (in the UTC time zone) when the reader account is deleted. |\nSection Title: RESOURCE_MONITORS view ¶ > Usage notes ¶\nContent:\nLatency for the view may be up to 120 minutes (2 hours).\nThe view only displays objects for which the current role for the session has been granted access privileges.\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nColumns\nUsage notes\nLanguage: **English**\nEnglish\nFrançais\nDeutsch\n日本語\n한국어\nPortuguês\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center\nContent:\nYour Opt Out Preference Signal is Honored\nYour Privacy\nStrictly Necessary Cookies\nPerformance Cookies\nFunctional Cookies\nTargeting Cookies\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Your Privacy\nContent:\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.\n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Your Privacy > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Your Privacy > Performance Cookies\nContent:\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nCookies Details‎\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Your Privacy > Functional Cookies\nContent:\nFunctional Cookies\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\nCookies Details‎\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Your Privacy > Targeting Cookies\nContent:\nTargeting Cookies\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nCookies Details‎\nSection Title: RESOURCE_MONITORS view ¶ > Privacy Preference Center > Cookie List\nContent:\nConsent Leg.Interest\ncheckbox label label\ncheckbox label label\ncheckbox label label\nClear\ncheckbox label label\nApply Cancel\nConfirm My Choices\nAllow All\n[](https://www.onetrust.com/products/cookie-consent/)"
      ]
    },
    {
      "url": "https://www.flexera.com/blog/finops/snowflake-resource-monitors/",
      "title": "Snowflake resource monitors 101: A comprehensive guide (2026)",
      "publish_date": "2026-01-27",
      "excerpts": [
        "Section Title: Snowflake resource monitors 101: A comprehensive guide (2026)\nContent:\nSnowflake Resource Monitors is a powerful feature that helps in Snowflake monitoring and avoid unexpected credit usage . It’s the only official monitoring tool from Snowflake that lets you monitor your credit consumption and control your warehouses, making it essential for Snowflake users.\nIn this article, we’ll explain how the Snowflake Resource Monitors work, how to set it up, how to customize notifications and define actions—and much more!!\nSection Title: Snowflake resource monitors 101: A comprehensive guide (2026) > What is Snowflake Resource Monitors?\nContent:\nSnowflake Resource Monitors is a feature in Snowflake that helps you manage and control Snowflake costs. It allows you to monitor and set limits on your compute resources, so you can avoid overspending and potentially going over your budget. By setting up Resource Monitors, you can define actions to be taken when usage thresholds are exceeded, such as sending alerts or suspending warehouses. This gives you more control over your Snowflake data warehouse and helps you stay within your budget.\nSection Title: ... > What Features Do Snowflake Resource Monitors Offer?\nContent:\nSnowflake Resource Monitors is a great feature for anyone using Snowflake. It offers a wealth of features that can help you better monitor and manage your Snowflake workloads and resources, giving you more control over your Snowflake environment.\nSome of the important features of the Snowflake Resource Monitors are:\n**1) Credit usage monitoring**\nSnowflake Resource Monitors allows you to monitor your credit usage in real-time, so you can stay updated on your account’s resource consumption.\n**2) Multiple levels of control**\nSnowflake Resource Monitors can be set at the account level or warehouse level, giving users high flexibility and control over their resources.\n**3) Credit quota management**\nSnowflake Resource Monitors allows you to set credit quotas for specific warehouses and even for the entire account to help you stay within your budget and avoid unexpected Snowflake costs.\n**4) Custom notification + alerting**\nSection Title: ... > What Features Do Snowflake Resource Monitors Offer?\nContent:\nResource Monitors can be customized to send notifications and alerts to users when credit usage reaches specific thresholds.\n**5) Custom Actions**\nResource Monitors allows you to configure custom actions that can be triggered when credit usage is exceeded (such as by suspending a warehouse or sending an alert).\n ... \nSection Title: ... > Step 3: Click on the “ **+Resource Monitors** ” button\nContent:\nUnder “Admin”, select “ **Resource Monitors** ” and then click “ **+Resource Monitors** “.\nResource Monitor dashboard\nYou will now see a “ **New Resource Monitor** ” window. In this window, you can set the Resource Monitor’s name, the Resource Monitor’s frequency( **credit quota** ), the credit usage threshold and the actions to be taken when the credit usage threshold is exceeded.\nNew Resource Monitor configuration\nSection Title: ... > Step 4: Configure the **Credit Quota** property\nContent:\nInside the “ **New Resource Monitor** ” popup window, configure the Credit Quota property. This is the number of credits that are allowed to be consumed in a given interval of time during which the Resource Monitor takes action.\nCredit Quota\n ... \nSection Title: ... > Step 7: Configure the **Actions** property\nContent:\nNow that you have set up the basic properties of your Resource Monitor, it’s time to define the **Actions** property that will be taken when the credit usage threshold gets exceeded. As you can see in the screenshot below, In the Actions property, there are three types of actions that Resource Monitors provide by default:\nResource Monitors actions configuration\nResource Monitors actions configuration\n**Suspend Immediately** : This action suspends all the assigned warehouses immediately, which cancels any query statements being executed by the warehouses at that time.\n**Suspend and notify** : This action suspends all the assigned warehouses after all statements being executed by the warehouse(s) have been completed and then sends an alert notification to the users.\n**Notify** : This action sends an alert notification to all users with notifications enabled.\n ... \nSection Title: ... > Step 8: Create the **Resource Monitor**\nContent:\nAs you can see in the screenshot below, we have successfully configured the Resource Monitor. So, once you’ve configured it, click the “ **Create Resource Monitor** ” button to create it. As you can see, we created a Snowflake Resource Monitor with the name “ **ResourceMonitor_DEMO** ,” a Credit Quota of “ **200** ” at the warehouse level, one warehouse configured with the default schedule, Suspend Immediately and Notify action set to trigger at 80% of credit usage, Suspend and Notify action set to trigger at **75%** of credit usage and Finally Notify action set to trigger at **50%** & **60%** of credit usage.\nResource Monitors configuration Resource Monitor dashboard\n ... \nSection Title: ... > How to create a Snowflake Resource Monitors using SQL query?\nContent:\nThis query creates a Resource Monitor named “ **ResourceMonitor_DEMO2** ” with a credit quota of **300** and sets triggers for suspend and suspend immediate actions at **80** and **75** percent usage, respectively. The monitor also includes a trigger for a notify action at **60 and 50** percent of usage respectively.\nCreate Resource Monitor\nOnce the query has been executed, navigate back to the Resource Monitors page. There, should see the newly created Resource Monitor, which will be in an active state.\nResource Monitor dashboard\n**How to Assign Warehouses to Resource Monitors?**\nOnce you have successfully created Snowflake Resource Monitors using SQL, warehouses can be easily assigned by using the following SQL query\n```\nALTER WAREHOUSE \"COMPUTE_WH\" SET RESOURCE_MONITOR =\"ResourceMonitor_DEMO2\";\n```\nAssign warehouse to Resource Monitors\n ... \nSection Title: ... > **How to enable Notification Alerts for Account admin?**\nContent:\nAccount administrators can receive notifications via the web interface or via email. Notifications are not enabled by default. It must be enabled manually, so follow the steps outlined below.\nUse the **ACCOUNTADMIN** role. If you are not already in this role, you can switch to it by clicking on the drop-down menu next to your name in the upper-right corner, selecting “ **Switch role** ” and then selecting “ **ACCOUNTADMIN** ” from the list.\nUser profile role\nIn the same drop-down menu, select **Profile** > Toggle **Notifications** .\nToggle notifications\n**How to enable Notification Alerts for Non-Admin Accounts?**\nEnabling email notifications for non-admin users can only be done through SQL statements(It’s not possible via the web interface). Use the SQL command shown below to trigger a notification for Non-admin accounts:\nSection Title: ... > **How to enable Notification Alerts for Account admin?**\nContent:\n```\nCREATE Resource Monitors \"ResourceMonitor_ALERT\" WITH CREDIT_QUOTA = 300\n NOTIFY_USERS = ('USER_NAME')\n TRIGGERS\n ON 80 PERCENT DO SUSPEND\n ON 75 PERCENT DO SUSPEND_IMMEDIATE\n ON 60 PERCENT DO NOTIFY\n ON 50 PERCENT DO NOTIFY;\n```\nTo view the list of users with access to email alerts for Resource Monitors, use the following SQL command.\n```\nSHOW Resource Monitors\n```\nEnable notifications alert for Non-admin\n ... \nSection Title: Snowflake resource monitors 101: A comprehensive guide (2026) > FAQs\nContent:\n**How does Snowflake Resource Monitors help control Snowflake costs?**\nSnowflake Resource Monitors helps you manage and control Snowflake costs. It allows you to monitor and set limits on your compute resources, so you can avoid overspending and potentially going over your budget.\n**How to setup resource monitor in Snowflake using Snowflake Web UI?**\nTo set up Snowflake Resource Monitors using Snowflake Web UI, log in, navigate to the Resource Monitors page under the Admin tab and click on the “+Resource Monitors” button.\n**What are the steps to configure a Resource Monitor’s credit quota and schedule?**\nTo configure a Resource Monitor’s credit quota and schedule, specify the desired values in the New Resource Monitor window, including credit quota, monitor type (account or warehouse level) and schedule properties.\n**Can I define custom actions for Snowflake Resource Monitors?**\nSection Title: Snowflake resource monitors 101: A comprehensive guide (2026) > FAQs\nContent:\nYes, Snowflake Resource Monitors allow you to define custom actions to be taken when credit usage thresholds are exceeded, such as suspending warehouses or sending alerts.\n**Can I create Snowflake Resource Monitors using SQL queries?**\nYes, Snowflake Resource Monitors can be created using SQL queries, using this simple query:\n```\nCREATE Resource Monitors \"ResourceMonitor_DEMO\" WITH CREDIT_QUOTA = 300\nTRIGGERS\n ON 80 PERCENT DO SUSPEND\n ON 75 PERCENT DO SUSPEND_IMMEDIATE\n ON 60 PERCENT DO NOTIFY\n ON 50 PERCENT DO NOTIFY;\n```\n**Can Resource Monitors be set at both the account and warehouse levels?**\nYes, Resource Monitors can be set at both the account and warehouse levels, providing flexibility and control over resource management.\n**Which schema has the resource monitor view in Snowflake?**"
      ]
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor",
      "title": "CREATE RESOURCE MONITOR - Snowflake Documentation",
      "excerpts": [
        "Reference SQL command reference Virtual warehouses & resource monitors CREATE RESOURCE MONITOR\nSection Title: CREATE RESOURCE MONITOR ¶\nContent:\nCreates a new resource monitor . This command can only be executed by account administrators.\nSee also:\nALTER RESOURCE MONITOR , DROP RESOURCE MONITOR , SHOW RESOURCE MONITORS , ALTER WAREHOUSE , ALTER ACCOUNT\n ... \nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\n`CREDIT_QUOTA = _num_`\nThe number of credits allocated to the resource monitor per frequency interval. When total usage for all warehouses assigned to the\nmonitor reaches this number for the current frequency interval, the resource monitor is considered to be at 100% of quota.\nIf a value is not specified for a resource monitor, the monitor has no quota and will never reach 100% usage within the specified interval.\nDefault: No value (i.e. no credit quota) `FREQUENCY = MONTHLY | DAILY | WEEKLY | YEARLY | NEVER`\nThe frequency interval at which the credit usage resets to `0` .\nIf you set a frequency for a resource monitor, you must also set `START_TIMESTAMP` .\nIf you specify `NEVER` for the frequency, the credit usage for the warehouse does not reset.\nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\nDefault: No value (i.e. legacy behavior, whereby the credit quota resets at the beginning of each calendar month) `START_TIMESTAMP = _timestamp_ | IMMEDIATELY`\nThe date and time when the resource monitor starts monitoring credit usage for the assigned warehouses.\nIf you set a timestamp for a resource monitor, you must also set `FREQUENCY` .\nIf you specify `IMMEDIATELY` for the start timestamp, the current timestamp is used.\nIf you specify a date without a time, the current time is used.\nIf you set a time without specifying a time zone, UTC is used as the default time zone.\nDefault: No value (i.e. legacy behavior, whereby the resource monitor starts monitoring warehouses immediately) `END_TIMESTAMP = _timestamp_`\nThe date and time when the resource monitor suspends the assigned warehouses.\nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\nDefault: No value (i.e. no warehouse suspension date) `NOTIFY_USERS = ( _user_name_ [ , _user_name_ , ... ] )`\nSpecifies the list of users to receive email notifications on resource monitors. If a user identifier includes spaces or special\ncharacters or is case-sensitive, then the identifier must be enclosed in double quotes (e.g. “Mary Smith”). See Identifier requirements for details.\nThe user identifier, `_user_name_` , is the value of the `name` column from the output of SHOW USERS .\nEach user listed must have a verified email address. For instructions on verifying email addresses in the web interface, see Verify your email address .\nEmail notifications for non-administrator users do not supersede email notifications for administrators. Any account administrators that\nhave enabled email notifications will continue to receive email notifications.\nNote\nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\nThe following limitations apply for non-administrator users:\nNon-administrator users can only receive notifications for warehouse monitors .\nNon-administrator users are notified by email but can’t see notifications in Snowsight.\nNon-administrator users can’t create resource monitors.\nNon-administrator users can’t assign other users to be notified. `TRIGGERS ...` (aka *actions* )\nSpecifies one or more triggers for the resource monitor. Each trigger definition consists of the following:\nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\n`ON _threshold_ PERCENT`\nA numeric value specified as a percentage of the credit quota for the resource monitor; values larger than `100` are supported. Once usage reaches this threshold for the current frequency interval, the trigger fires. `DO SUSPEND | SUSPEND_IMMEDIATE | NOTIFY`\nSpecifies the action performed by the trigger when the threshold is reached:`SUSPEND` : Suspend all assigned warehouses while allowing currently running queries to complete. No new queries can be executed\nby the warehouses until the credit quota for the resource monitor is increased. In addition, this action sends a notification to all\nusers who have enabled notifications for themselves.`SUSPEND_IMMEDIATE` : Suspend all assigned warehouses immediately and cancel any currently running queries or statements using\nthe warehouses.\nSection Title: CREATE RESOURCE MONITOR ¶ > Optional parameters ¶\nContent:\nIn addition, this action sends a notification to all users who have enabled notifications for themselves.`NOTIFY` : Send a notification (to all account administrators with notifications enabled), but do not take any other action.\n ... \nSection Title: CREATE RESOURCE MONITOR ¶ > Usage notes ¶\nContent:\nTriggers are optional; however, at least one trigger must be added to a resource monitor before it can perform any actions. Each resource monitor supports up to a maximum of 5 `NOTIFY` action triggers. After a resource monitor is created, it must be assigned to a warehouse or account before it can perform any monitoring actions:\nTo assign a warehouse to a resource monitor, use ALTER WAREHOUSE (or CREATE WAREHOUSE if you are creating the warehouse). To assign a resource monitor at the account level, use ALTER ACCOUNT . The NOTIFY_USERS parameter must be null. To view all resource monitors created in your account and their assignment, use the SHOW RESOURCE MONITORS command. The command\noutput displays `NULL` in the `level` column for resource monitors that are not assigned to the account or any warehouses\nand, therefore, are not monitoring any credit usage.\nSection Title: CREATE RESOURCE MONITOR ¶ > Usage notes ¶\nContent:\nIf `frequency` and `start_timestamp` parameters are set on a resource monitor, the day for the credit usage reset is\ncalculated based on those parameters. The time the credit usage resets to `0` is 12:00 AM UTC regardless of the time specified in `start_timestamp` . If you specify an `end_timestamp` , monitoring ends at that specified date and time and all assigned warehouses are suspended\nat that date and time even if the credit quota has not been reached.When this occurs, a notification is sent that states the resource monitor has reached a percentage of its quota and has triggered a\nsuspend immediate action. The percentage of the quota reflects the number of credits used in the current interval up to the end date\nand might not be a threshold you specified. If there are non-administrator users in the notification list, the following notes apply:\nIf any user in the notification list does not have a verified email ,\nthe SQL statement fails.\nSection Title: CREATE RESOURCE MONITOR ¶ > Usage notes ¶\nContent:\nIf any user in the notification list changes their email address and does not verify the new email address, the\nnotification silently fails. The notification list is limited to a maximum number of 5 non-administrator users. Account administrators can view the notification list of non-administrator users in the output of SHOW RESOURCE MONITORS in the `notify_user` column. Regarding metadata:AttentionCustomers should ensure that no personal data (other than for a User object), sensitive data, export-controlled data, or other regulated data is entered as metadata when using the Snowflake service. For more information, see Metadata fields in Snowflake . The OR REPLACE and IF NOT EXISTS clauses are mutually exclusive. They can’t both be used in the same statement. CREATE OR REPLACE ** statements are atomic. That is, when an object is replaced, the old object is deleted and the new object is created in a single transaction.\nSection Title: CREATE RESOURCE MONITOR ¶ > Usage notes ¶\nContent:\nImportant\nTo receive notifications generated by resource monitors, account administrators and non-administrator users in the notification\nlist must explicitly enable notifications in their preferences. In addition, to receive email notifications, users must have a\nverified email in their preferences. Preferences can only\nbe set in the Snowflake web interface. For more information, see Enabling receipt of notifications .\nSection Title: CREATE RESOURCE MONITOR ¶ > Examples ¶\nContent:\nCreate a resource monitor named `limiter` with 3 triggers:\nCopy\nCreate a resource monitor to send notifications to three users when 75% of the credit quota is reached. In this example, the `_user_name_` for two of the users includes a space and must be enclosed in double quotes:\nCopy\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nSyntax\nRequired parameters\nOptional parameters\nUsage notes\nExamples\n ... \nSection Title: CREATE RESOURCE MONITOR ¶ > Privacy Preference Center > Your Privacy > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎"
      ]
    },
    {
      "url": "https://select.dev/posts/snowflake-resource-monitors",
      "title": "Controlling Costs with Snowflake Resource Monitors",
      "publish_date": "2023-03-18",
      "excerpts": [
        "Section Title: Controlling Costs with Snowflake Resource Monitors > Table of Contents\nContent:\nWhat are Snowflake resource monitors for?\nSection Title: Controlling Costs with Snowflake Resource Monitors > Contents\nContent:\nWhat are Snowflake resource monitors for?\nWhat do Snowflake resource monitors do?\nHow do you create a resource monitor in Snowflake?\nCreating a resource monitor in the UI\nCreating a resource monitor with SQL\nWhat resource monitors should you consider creating?\nHow do you view resource monitors?\nWho can create or access resource monitors?\nWhat are the downsides of Snowflake resource monitors?\nTroubleshooting no email from resource monitor\nResource monitors are a feature offered by Snowflake to help customers control their spend. In this post we cover everything you need to know about how to configure and best utilize resource monitors in your account. To start things off, let's cover why you should use resource monitors in the first place.\nSection Title: Controlling Costs with Snowflake Resource Monitors > What are Snowflake resource monitors for?\nContent:\nSnowflake's usage-based pricing model and ease of scaling allow customers to pay for just the resources they need while quickly scaling to meet demand. The downside is that Snowflake costs can rise unexpectedly when left unchecked or without proper controls in place. Resource monitors help users monitor and control costs by sending notifications at defined spend thresholds. Resource monitors can also be configured to help avoid early contract renewal by mitigating unexpected credit usage.\nSection Title: Controlling Costs with Snowflake Resource Monitors > What do Snowflake resource monitors do?\nContent:\nResource monitors allow users to specify a Snowflake credit limit for a given resource and timeframe. For example, a warehouse or grouping of warehouses can be assigned a daily credit limit of 50 credits per day. When the specified percentage of that limit is reached in the given timeframe, resource monitors can trigger different actions. The three possible actions are:\nNotify the user via email\nSuspend the warehouse(s) after all queries are finished running\nImmediately suspend the warehouse(s) and abort any running queries\nOutside of warehouses, resource monitors can be configured for an entire account.\nThe screenshot below shows an example of an email notification sent by a resource monitor.\n ... \nSection Title: Controlling Costs with Snowflake Resource Monitors > ... > Creating a resource monitor in the UI\nContent:\nTo create a new resource monitor in the Snowflake UI, navigate to the Admin > Resource Monitors section. After clicking the \"+ Resource Monitor\" button in the top right, you'll be prompted to fill out the following details:\n**Name** : Set this to anything you like, but note that spaces are not allowed\n**Credit Quota** : The desired credit allowance for the monitor\n**Monitor Type** : Either \"Account\" or \"Warehouse\". If \"Account\", the credit quoata applies to the entire account. If \"Warehouse\", the quota only applies to the warehouses you specify.\n**Warehouse(s)** : If you chose \"Warehouse\" as your monitor type, then you will be prompted to select 1 or more warehouses to associate with the monitor.\nSection Title: Controlling Costs with Snowflake Resource Monitors > ... > Creating a resource monitor in the UI\nContent:\n**Schedule** : Here, the start time and (optional) end time for when the resource monitor operates can be configured. The frequency at which the resource monitor resets its credit count can also be set. Supported options for this include: daily, monthly, yearly and never.\n**Actions** : At least one action must be configured to create the monitor.\nSection Title: Controlling Costs with Snowflake Resource Monitors > ... > Creating a resource monitor with SQL\nContent:\nAn example command to create a resource monitor with SQL is shown below:\n```\n1 create or replace resource monitor compute_warehouse_monitor with credit_quota=5 frequency=daily start_timestamp=immediately triggers on 75 percent do notify on 100 percent do suspend on 110 percent do suspend_immediate ;\n```\nTo assign the monitor to the `COMPUTE` warehouse, run the following:\n`alter warehouse compute set resource_monitor = compute_warehouse_monitor`\nThe full syntax for this command can be found in the [Snowflake documentation](https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor) .\nSection Title: ... > What resource monitors should you consider creating?\nContent:\nConsider creating an account-level resource monitor based on your Snowflake contract amount. This can help ensure you don't finish your contract budget earlier than expected.\nFor example, if the remaining Snowflake contract balance is $240,000 over the next 6 months, then you could set a monthly account resource monitor with a credit quota of 16,000 credits (assuming a credit price of $2.5/credit). You could choose to get notified by email if the account's credit usage exceeds 100% of that quota.\nAnother recommendation is to create a resource monitor to alert you of any credit usage spikes. To accomplish this, you could create a resource monitor to send an alert whenever daily spend exceeds 1.5x the average daily amount. We recommend adjusting this threshold multiple as needed to avoid being alerted too frequently.\nSection Title: Controlling Costs with Snowflake Resource Monitors > How do you view resource monitors?\nContent:\nResource monitors can be viewed in the Snowflake UI under Admin -> Resource Monitors:\nAlternatively, you can run `show resource monitors` as a SQL statement:\nSection Title: Controlling Costs with Snowflake Resource Monitors > Who can create or access resource monitors?\nContent:\nResource monitors can only be created by account administrators. Once a resource monitor is created, [roles](https://select.dev/posts/snowflake-roles) can be granted [access to view or modify a monitor](https://docs.snowflake.com/en/user-guide/security-access-control-privileges) . Access has to be granted to each resource monitor individually.\nAny user in Snowflake can receive email notifications from resource monitors. This is accomplished using SQL by setting the `NOTIFY USERS` parameter on the resource monitor. See the [Snowflake documentation](https://docs.snowflake.com/en/sql-reference/sql/create-resource-monitor) for more details.\nSection Title: ... > What are the downsides of Snowflake resource monitors?\nContent:\nWhile resource monitors are a great starting point for controlling Snowflake credit usage and avoiding unexpected charges, there are a few downsides as of today.\nFirst, you can only set resource monitors at the account or warehouse level. Serverless features such as automatic clustering or materialized views can also incur sudden charges but are not supported by resource monitors.\nResource monitors only support notifications via email. Most teams prefer to receive notifications directly in Slack or Teams along with the rest of their alerts and team communication.\nAdditionally, as shown in the screenshot earlier, the email notifications contain little information about what caused the credit allowance to be exceeded. Users must then dig through their account usage data to determine what caused the spike.\n ... \nSection Title: Controlling Costs with Snowflake Resource Monitors > Troubleshooting no email from resource monitor\nContent:\nIf you are not receiving an email from a resource monitor, it may be because notifications haven't been enabled for the Snowflake admin. See [this page](https://docs.snowflake.com/en/user-guide/resource-monitors) for instructions on how to accomplish that.\nIan Whitestone · Co-founder & CEO of SELECT\nIan is the Co-founder & CEO of SELECT, a SaaS Snowflake cost management and optimization platform. Prior to starting SELECT, Ian spent 6 years leading full stack data science & engineering teams at Shopify and Capital One. At Shopify, Ian led the efforts to optimize their data warehouse and increase cost observability.\nWant to hear about our latest Snowflake learnings? Subscribe to get notified.\nSubscribe\n ... \nSection Title: Controlling Costs with Snowflake Resource Monitors > ... > Features\nContent:\nVisibility\nInsights\nAutomated Savings\nUsage Groups\nNotifications\nIntegrations"
      ]
    },
    {
      "url": "https://keebo.ai/2024/07/29/controlling-costs-with-resource-monitors-in-snowflake-what-they-can-cant-do/",
      "title": "Snowflake Cost Monitoring: How to Create a Resource Monitor in Snowflake - What They Can (& Can’t) Do - Keebo",
      "publish_date": "2026-02-21",
      "excerpts": [
        "Section Title: ... > What is a resource monitor in Snowflake?\nContent:\nSnowflake warehouse resource monitors are built-in tools that help users avoid unexpected credit consumption when running warehouses. After all, the more credits you consume, the more you spend (read our complete guide to [how Snowflake pricing works](https://keebo.ai/2024/04/11/how-does-snowflake-pricing-work/) here).\nWhen you create a resource monitor in Snowflake, you’re essentially setting thresholds to control credit consumption for specific virtual warehouses. Once these thresholds are reached, the monitor can trigger predefined actions such as sending alerts, suspending warehouses, or preventing new queries from running to stop costs from escalating further.\nUsers can set up resource monitors to suspend a warehouse or send notifications when it consumes a certain number of credits. Here are the components that create a resource monitor in Snowflake.\nSection Title: ... > Credit quota\nContent:\nCredit quota indicates the number of Snowflake credits allocated to the Snowflake warehouse resource monitor for the specified frequency interval (monthly by default, but this can be customized). The quota includes the total of all resources consumed—warehouse, serverless, and cloud services. Credit quotas do not include the [daily 10% adjustment for cloud services](https://docs.snowflake.com/en/user-guide/cost-understanding-compute) .\n ... \nSection Title: ... > Schedule\nContent:\nThe schedule determines the interval after which used credits will reset to zero. By default, Snowflake sets resource monitor schedules to reset at the beginning of each calendar month, as this aligns with the standard [Snowflake billing cycles](https://keebo.ai/2024/07/01/how-often-are-snowflake-bills-generated/) .\nYou can customize your resource monitor schedule by frequency (e.g. daily, weekly, monthly), never (i.e. used credits never reset), and start (i.e. immediately or later) and end times.\nSection Title: ... > Actions\nContent:\nYou can set triggers for specific actions at certain percentages of the resource monitor’s credit quota. These actions include notification, suspend, or both. For example, if you consume 70% of your credit quota, you can send a notification to your account manager so they can make necessary adjustments. When you reach 100%, you can set the warehouse to automatically suspend.\nNotifications will look like the following:\n```\nResource Monitor KEEBO_ACCOUNT_MONITOR has reached 50% of its MONTHLY quota of 500 credits which has triggered a NOTIFY action.    \n  \nResource Monitor KEEBO_WAREHOUSE_1_MONITOR has reached 90% of its MONTHLY quota of 500 credits which has triggered a SUSPEND action.\n```\nEveryone other than users with the ACCOUNTADMIN role will receive these notifications via email.\nOnce a resource monitor suspends a warehouse, it cannot be resumed until one of the following conditions is met:\nSection Title: ... > Actions\nContent:\nThe next interval starts\nAdmin increases the monitor’s credit quota\nAdmin increases the credit threshold for suspend actions\nAdmin removes warehouses from the monitor\nAdmin drops the monitor\n ... \nSection Title: ... > Creating a resource monitor in Snowslight\nContent:\nSign into Snowsight\nGo to Admin >> Cost Management\nSelect Resource Monitors, then + Resource Monitor\nEnter a Name for the resource monitor\nEnter the Credit Quota for the specified interval\nSelect Monitor Type. Choose either Account or Warehouse.\nEnter a threshold next to each Action option. Select Add to create additional notifications. You can add up to five notify actions.\nSelect Schedule >> Customize to set a custom interval within which the credit quota will reset. Keep in mind that you cannot change a customized schedule for a resource monitor back to the default. Instead, you must drop the monitor and recreate it.\nSection Title: ... > Creating a resource monitor in the Snowflake classic console\nContent:\nSelect Account >> Resource Monitors >> Create Resource Monitor\nEnter a resource monitor Name\nEnter your Credit Quota\nSelect the Monitor Level (i.e. Account or Warehouse)\nSelect the Actions and Notifications you want to enable indicating a threshold next to each option.\nSelect +Add to add additional actions (up to five notify actions total).\nSelect Schedule >> Customize to set a custom interval within which the credit quota will reset. Keep in mind that you cannot change a customized schedule for a resource monitor back to the default. Instead, you must drop the monitor and recreate it.\n ... \nSection Title: ... > Modifying a resource monitor in Snowflake upon creation\nContent:\nOnce you create a resource monitor in Snowflake, you can go in and make the following changes:\nIncrease or decrease the credit quota\nModify the customized schedule (reverting to the default schedule requires dropping the monitor and launching a new one)\nAdd or remove actions\nAdjust thresholds for existing actions\nConvert account monitor to warehouse monitor\nConvert warehouse monitor to account monitor\nAdd or remove warehouses from warehouse monitor\nKeep in mind that making these changes won’t impact the credits used to date for that monitor. They only affect credits used after the changes are saved.\n ... \nSection Title: ... > Modifying a resource monitor in SQL\nContent:\nExecute an ALTER RESOURCE MONITOR statement. For example, change the credit quota with the following command:\n```\nALTER RESOURCE MONITOR control1 SET CREDIT_QUOTA=4000;\n```\n ... \nSection Title: ... > Rigid structure\nContent:\nSnowflake cost monitoring,  as we’ve extensively laid out above, are based on rigid parameters. At best, you set your credit quotas and schedules based on previous performance. At worst, you’re guessing at how many credits you’ll actually need.\nIn either case, data cloud workloads are dynamic, and often rely on factors outside anyone’s control. A growing user base, inefficient query writing, unexpected spikes in requests—these always come up unexpectedly, and they don’t care what your credit quota is.\nThe only solution is to go in and manually adjust quotas based on these changes. But that’s a lot of work, and whatever you’re saving in credits you’re probably spending in the hours spent in manual adjustments.\nSection Title: ... > Obscured performance metrics\nContent:\nSnowflake cost monitoring is based solely on credit usage. A number of factors go into determining credit usage: query volume, execution time, and warehouse size being the most relevant.\nFor example, if you set a NOTIFY command when your credit quota reaches 50%, all you really know is you’ve used half your credits. You don’t have insight into *why* those credits were consumed so quickly and, most importantly, how to fix it. Did you get an influx of users that increased your query volume for a 24-hour period? Did a handful of inexperienced data analysts write inefficient queries that consumed too much compute? Snowflake resource monitors won’t answer those questions—which means you can’t act on the information you receive.\n ... \nSection Title: ... > Author\nContent:\n[Collin David](https://keebo.ai/2024/07/29/controlling-costs-with-resource-monitors-in-snowflake-what-they-can-cant-do/ \"Collin David\")[View all posts](https://keebo.ai/2024/07/29/controlling-costs-with-resource-monitors-in-snowflake-what-they-can-cant-do/ \"View all posts\")"
      ]
    },
    {
      "url": "https://docs.snowflake.com/de/user-guide/resource-monitors",
      "title": "Verwenden von Ressourcenmonitoren - Snowflake Documentation",
      "excerpts": [
        "[DOCUMENTATION](https://docs.snowflake.com)\n/\nErste Schritte\nBenutzerhandbücher\nEntwickler\nReferenz\nVersionshinweise\nTutorials\n[Status](https://status.snowflake.com)\nÜberblick\nSnowflake Horizon Catalog\nAnwendungen und Tools für die Verbindung mit Snowflake\nVirtuelle Warehouses\nDatenbanken, Tabellen und Ansichten\nDatentypen\nDatenintegration\nSnowflake Openflow\nApache Iceberg™\nApache Iceberg™-Tabellen\nSnowflake Open Catalog\nData engineering\nLaden von Daten\nDynamische Tabellen\nStreams und Aufgaben\ndbt-Projekte in Snowflake\nEntladen von Daten\nStorage Lifecycle Policies\nMigrationen\nAbfragen\nFreigabeangebote\nZusammenarbeit\nSnowflake AI & ML\nSnowflake Postgres\nAlerts und Benachrichtigungen\nSicherheit\nData Governance\nDatenschutz\nOrganisationen und Konten\nGeschäftskontinuität und Datenwiederherstellung\nLeistungsoptimierung\nKosten und Abrechnung\nBenutzerhandbücher Kosten und Abrechnung Kontrollieren Ressourcenmonitore\nSection Title: Verwenden von Ressourcenmonitoren ¶\nContent:\nEin *Ressourcenmonitore* bietet Unterstützung bei der Kostenkontrolle und bei der Verhinderung einer unerwarteten Credit-Nutzung durch aktive Warehouses. Ein virtuelles Warehouse verbraucht während seiner Ausführung Snowflake-Credits. Sie können einen Ressourcenmonitor zur Überwachung der Credit-Nutzung durch virtuelle Warehouses und durch die zur Unterstützung dieser Warehouses erforderlichen Clouddienste verwenden. Sie können einen Ressourcenmonitor auch so einrichten, dass ein benutzerverwaltetes virtuelles Warehouse angehalten wird, wenn ein bestimmtes Credit-Limit erreicht ist.\nDie Anzahl der verbrauchten Credits hängt von der Größe des Warehouses und der Ausführungsdauer ab. Weitere Informationen zur Credit-Nutzung von Warehouses finden Sie unter Credit-Nutzung für virtuelle Warehouses .\n ... \nSection Title: Verwenden von Ressourcenmonitoren ¶ > Eigenschaften von Ressourcenmonitoren ¶ > Credit-Kontingent ¶\nContent:\nDas Credit-Kontingent gibt die Anzahl der Snowflake-Credits an, die dem Monitor für das angegebene Frequenzintervall zugewiesen wurden. Es kann eine beliebige Zahl angegeben werden.\nAußerdem verfolgt Snowflake die *verbrauchten Credits/Kontingente* innerhalb des angegebenen Frequenzintervalls von allen dem Monitor zugewiesenen Warehouses. Nach dem angegebenen Intervall wird diese Zahl auf `0` zurückgesetzt.\nDas Credit-Kontingent berücksichtigt Credits, die sowohl von benutzerverwalteten virtuellen Warehouses als auch von virtuellen Warehouses, die von Clouddiensten verwendet werden, verbraucht werden.\nIhr Ressourcenmonitorlimit ist zum Beispiel auf 1.000 Credits eingestellt. Wenn Ihr Warehouse innerhalb eines bestimmten Intervalls oder Zeitraums 300 Credits verbraucht und Clouddienste 700 Credits verbrauchen, wird eine Warnung ausgelöst.\nBemerkung\nSection Title: Verwenden von Ressourcenmonitoren ¶ > Eigenschaften von Ressourcenmonitoren ¶ > Credit-Kontingent ¶\nContent:\nDie Grenzwerte für den Ressourcenmonitor berücksichtigen nicht die tägliche Anpassung von 10 % für Clouddienste. Snowflake verwendet den gesamten Credit-Verbrauch der Clouddiensteschicht, um zu berechnen, ob ein Grenzwert erreicht wurde, auch wenn dieser Verbrauch nie in Rechnung gestellt wird. Weitere Informationen zur Berechnung von Credits und zu Anpassungen für Clouddienste finden Sie unter Erläuterungen zur Abrechnung der Nutzung von Clouddiensten .\nAnweisungen zum Anzeigen der Credit-Nutzung Ihrer Clouddienste finden Sie unter Untersuchen der Computekosten .\n ... \nSection Title: Verwenden von Ressourcenmonitoren ¶ > Eigenschaften von Ressourcenmonitoren ¶ > Zeitplan ¶\nContent:\nDer Standardzeitplan eines Ressourcenmonitors gibt an, dass er sofort mit der Überwachung der Credit-Nutzung beginnt und die verbrauchten Credits zu Beginn jedes Kalendermonats (d. h. zu Beginn des Standardabrechnungszyklus von Snowflake) auf `0` zurücksetzt.\nSie können den Zeitplan für einen Ressourcenmonitor jedoch optional mithilfe der folgenden Eigenschaften anpassen:\nFrequenz :\nDas Intervall, in dem die verwendeten Credits relativ zum angegebenen Startdatum zurückgesetzt werden.\nUnterstützte Werte:\nTäglich\nWöchentlich\nMonatlich\nJährlich\nNie (verbrauchte Credits werden nie zurückgesetzt; zugewiesene Warehouses verwenden weiterhin Credits, bis das Credit-Kontingent erreicht ist)\nStart :\nDatum und Uhrzeit (d. h. Zeitstempel), wenn der Ressourcenmonitor mit der Überwachung der zugewiesenen Warehouses beginnt.\nUnterstützte Werte:\n ... \nSection Title: Verwenden von Ressourcenmonitoren ¶ > Anhalten und Fortsetzen von Warehouses ¶\nContent:\nRessourcenmonitore sind nicht dazu bestimmt, den Verbrauch auf Stundenbasis streng zu kontrollieren. Sie sind dazu bestimmt, die Credit-Nutzung auf Basis eines Intervalls (Tag, Woche, Monat usw.) zu verfolgen und zu kontrollieren. Außerdem sind sie nicht dazu bestimmt, genaue Grenzwerte für die Credit-Nutzung festzulegen (d. h. bis zur Höhe der einzelnen Credits). Wenn beispielsweise die Schwellenwerte für das Credit-Kontingent eines Ressourcenmonitors erreicht sind, kann das Anhalten der zugewiesenen Warehouses, auch bei einer „Sofort anhalten“-Aktion einige Zeit in Anspruch nehmen, wobei zusätzliche Credits verbraucht werden.\nWenn Sie Ihre Vorgabe strikt durchsetzen möchten, empfehlen wir Ihnen Folgendes:\n ... \nSection Title: Verwenden von Ressourcenmonitoren ¶ > Benachrichtigungen von Ressourcenmonitoren ¶\nContent:\nWenn ein Ressourcenmonitor den Schwellenwert für eine Aktion erreicht, generiert er eine Benachrichtigung ähnlich der folgenden Meldung:\n```\nResource Monitor MY_ACCOUNT_MONITOR has reached 50% of its MONTHLY \n quota of 500 credits which has triggered a <action> action.\n```\nDie `<action>` ist eine der folgenden Aktionen:\nNOTIFY\nSUSPEND\nSUSPEND_IMMEDIATE\nDas Benachrichtigungsverhalten hängt vom Typ des Ressourcenmonitors ab und davon, ob die Benachrichtigungen für einen einzelnen Benutzer aktiviert sind oder nicht. Benachrichtigungen werden wie folgt gesendet:\n ... \nSection Title: Verwenden von Ressourcenmonitoren ¶ > Aktivieren des Empfangs von Benachrichtigungen ¶\nContent:\nVerifizieren Sie Ihre E-Mail-Adresse, falls Sie dies noch nicht getan haben. Eine Anleitung zum Verifizieren Ihrer E-Mail-Adresse finden Sie unter E-Mail-Adresse verifizieren .\nWählen Sie Ihren Benutzernamen aus, und wählen Sie dann Profile aus.\nWählen Sie unter Notifications die Option Enable notifications from resource monitors aus.Bemerkung\nDie Option Notifications ist nur verfügbar, wenn Ihre E-Mail-Adresse verifiziert wurde.\nIn Notifications ist die Option Enable notifications from resource monitors nur für Benutzer mit der Rolle ACCOUNTADMIN in folgenden Fällen verfügbar:\nWenn dem Konto ein Ressourcenmonitor zugewiesen ist und der Administrator des Kontos über die Berechtigung OWNERSHIP für den Kontomonitor verfügt.\nWenn in dem Konto Warehouse-Monitore vorhanden sind. Alle Kontoadministratoren können Benachrichtigungen für Warehouse-Monitore erhalten.\nSection Title: Verwenden von Ressourcenmonitoren ¶ > Erstellen von Ressourcenmonitoren ¶\nContent:\nRessourcenmonitore können entweder über die Weboberfläche oder mit SQLerstellt werden. Allerdings können Ressourcenmonitore nur von Kontoadministratoren (d. h, Benutzer mit der Rolle ACCOUNTADMIN) erstellt werden.\nEinem Ressourcenmonitor können nicht mehr als 500 Warehouses zugewiesen werden.\nWichtig\nSie müssen einem Ressourcenmonitor mindestens ein Warehouse zuweisen oder den Monitor auf Kontoebene so einstellen, dass er mit der Überwachung/Verfolgung der Credit-Nutzung beginnt:\nAuf der Weboberfläche müssen Sie dies zum Erstellungszeitpunkt festlegen.\nMit SQL müssen Sie zuerst den Ressourcenmonitor erstellen und ihm dann in einem separaten zusätzlichen Schritt durch Ausführen des Befehls ALTER WAREHOUSE ein oder mehrere Warehouses zuweisen.\nDamit Sie bei Auslösen einer Aktion durch den Ressourcenmonitor Benachrichtigungen erhalten, müssen Sie Benachrichtigungen aktivieren .\nSection Title: ... > Erstellen eines Ressourcenmonitors mit einem Standardzeitplan ¶\nContent:\nSie können einen Ressourcenmonitor erstellen, der den Standardzeitplan über die Weboberfläche oder SQL verwendet.\nBemerkung\nNur Benutzer mit der Rolle ACCOUNTADMIN können Ressourcenmonitore erstellen.\nSnowsight :\n1. Melden Sie sich bei Snowsight an.\n2. Wählen Sie im Navigationsmenü die Option Admin » Cost management aus.\n3. Wählen Sie Resource Monitors und dann + Resource Monitor aus.\n4. Geben Sie unter Name einen Namen für den Ressourcenmonitor ein.\n5. Geben Sie unter Credit Quota die Anzahl der Credits für jedes angegebene Intervall ein.\n6. Wählen Sie den Monitor Type aus. Wählen Sie Account aus, um einen Kontomonitor zu erstellen, oder wählen Sie Warehouse aus, um die Warehouses auszuwählen, die überwacht werden sollen.\n7. Wählen Sie für Actions aus, welche Benachrichtigungen aktiviert werden sollen, indem Sie neben der Option einen Schwellenwert eingeben. Sie müssen mindestens eine Option auswählen.\nSection Title: ... > Erstellen eines Ressourcenmonitors mit einem Standardzeitplan ¶\nContent:\nWählen Sie Add aus, um zusätzliche Benachrichtigungen zu erstellen. Sie können bis zu fünf Benachrichtigungsaktionen angeben.\nSQL :\nMit SQL wird diese Aufgabe in zwei Schritten ausgeführt:\nFühren Sie den Befehl CREATE RESOURCE MONITOR aus, geben Sie jedoch keine Eigenschaften für den Zeitplan an.\nFühren Sie eine ALTER WAREHOUSE -Anweisung aus, um dem Ressourcenmonitor Warehouses zuzuweisen, oder führen Sie eine ALTER ACCOUNT -Anweisung aus, um den Ressourcenmonitor für das Konto festzulegen.\nBeispiel:\n ... \nSection Title: ... > Erstellen eines Ressourcenmonitors mit einem kundenspezifischen Zeitplan ¶\nContent:\nSnowsight :\n1. Melden Sie sich bei Snowsight an.\n2. Wählen Sie im Navigationsmenü die Option Admin » Cost management aus.\n3. Wählen Sie Resource Monitors und dann + Resource Monitor aus.\n4. Geben Sie unter Name einen Namen für den Ressourcenmonitor ein.\n5. Geben Sie unter Credit Quota die Anzahl der Credits für jedes angegebene Intervall ein.\n6. Wählen Sie den Monitor Type aus. Wählen Sie Account aus, um einen Kontomonitor zu erstellen, oder wählen Sie Warehouse aus, um die Warehouses auszuwählen, die überwacht werden sollen.\n7. Wählen Sie Schedule » Customize aus, um einen kundenspezifischen Zeitplan für das angegebene Intervall festzulegen. Sie können diesen Schritt überspringen und den Standardzeitplan verwenden.\nSie können mit Custom Start Date und Custom End Date ein kundenspezifisches Start- und Enddatum festlegen oder über die Registerkarte Range einen Datumsbereich angeben.\nBemerkung\n ... \nSection Title: ... > Erstellen eines Ressourcenmonitors mit einem kundenspezifischen Zeitplan ¶\nContent:\nWählen Sie für Actions aus, welche Benachrichtigungen aktiviert werden sollen, indem Sie neben der Option einen Schwellenwert eingeben. Sie müssen mindestens eine Option auswählen.Wählen Sie Add aus, um zusätzliche Benachrichtigungen zu erstellen. Sie können bis zu fünf Benachrichtigungsaktionen angeben.\nAktivieren Sie unter Actions and Notifications eine bestimmte Aktion oder Benachrichtigung, indem Sie einen Schwellenwert neben der Option eingeben. Sie müssen mindestens eine Option auswählen.Wählen Sie +Add more notification thresholds aus, um zusätzliche Benachrichtigungen zu erstellen. Sie können bis zu fünf Benachrichtigungsaktionen angeben.\nSQL :\nFühren Sie einen Befehl CREATE RESOURCE MONITOR mit einer oder mehreren der folgenden Zeitplaneigenschaften aus:\nFREQUENCY\nSTART_TIMESTAMP\nEND_TIMESTAMP\nBeispiel:"
      ]
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/account-usage",
      "title": "Account Usage - Snowflake Documentation",
      "excerpts": [
        "Section Title: Account Usage ¶\nContent:\nIn the SNOWFLAKE database, the ACCOUNT_USAGE and READER_ACCOUNT_USAGE schemas enable querying object metadata, as well as historical\nusage data, for your account and all reader accounts (if any) associated with the account.\nSection Title: Account Usage ¶ > Overview of Account Usage schemas ¶\nContent:\nACCOUNT_USAGE :\nViews that display object metadata and usage metrics for your account.\nIn general, these views mirror the corresponding views and table functions in the Snowflake Snowflake Information Schema , but\nwith the following differences:\nRecords for dropped objects included in each view.\nLonger retention time for historical usage data.\nData latency.\nFor more details, see Differences Between Account Usage and Information Schema (in this topic). For more details about each\nview, see ACCOUNT_USAGE Views (in this topic).\nREADER_ACCOUNT_USAGE :\nViews that display object metadata and usage metrics for all the reader accounts that have been created for\nyour account (as a Secure Data Sharing provider).\nThese views are a small subset of the ACCOUNT_USAGE views that apply to reader accounts. Also, each view in this schema contains an\nadditional `READER_ACCOUNT_NAME` column for filtering results by reader account.\nSection Title: Account Usage ¶ > Overview of Account Usage schemas ¶\nContent:\nFor more details about each view, see READER_ACCOUNT_USAGE Views (in this topic).\nNote that these views are empty if no reader accounts have been created for your account.\n ... \nSection Title: Account Usage ¶ > ACCOUNT_USAGE views ¶\nContent:\nThe ACCOUNT_USAGE schema contains the following views:\n ... \nSection Title: Account Usage ¶ > ACCOUNT_USAGE views ¶ > Account Usage table functions ¶\nContent:\nCurrently, Snowflake supports one ACCOUNT_USAGE table function:\n ... \nSection Title: Account Usage ¶ > ACCOUNT_USAGE views ¶ > Account Usage table functions ¶\nContent:\nNote\nSimilar to the Account Usage views, please account for latency when calling this table function. The expected latency for this table\nfunction is similar to the latency for the TAG_REFERENCES view.\n ... \nSection Title: Account Usage ¶ > ... > READER_ ACCOUNT_ USAGE schema SNOWFLAKE database roles ¶\nContent:\nThe READER_USAGE_VIEWER SNOWFLAKE database role is granted SELECT privilege on all READER_ACCOUNT_USAGE views.\nAs reader accounts are created by clients, the READER_USAGE_VIEWER role is expected to be granted to those roles used to monitor reader account use.\n ... \nSection Title: Account Usage ¶ > Querying the Account Usage views ¶ > Reconciling cost views ¶\nContent:\nThere are several Account Usage views that contain data related to the cost of compute resources, storage, and data transfers. If you are trying to reconcile these views against a corresponding view in the ORGANIZATION_USAGE schema , you must first set the timezone of the session to UTC.\nFor example, if you are trying to reconcile ACCOUNT_USAGE.WAREHOUSE_METERING_HISTORY to the account’s data in ORGANIZATION_USAGE.WAREHOUSE_METERING_HISTORY, you must run the following command before querying the Account Usage view:\n```\nALTER SESSION SET TIMEZONE = UTC ;\n```\nCopy\nSection Title: Account Usage ¶ > Querying the Account Usage views ¶ > Examples ¶\nContent:\nThe following examples show some typical/useful queries using the views in the ACCOUNT_USAGE schema.\nNote\nThese examples assume the SNOWFLAKE database and the ACCOUNT_USAGE schema are in use for the current session. The examples also\nassume the ACCOUNTADMIN role (or a role granted IMPORTED PRIVILEGES on the database) is in use. If they are not in use, execute\nthe following commands before running the queries in the examples:Copy\n ... \nSection Title: Account Usage ¶ > ... > Examples ¶ > Examples: Warehouse credit usage ¶\nContent:\nCredits used by each warehouse in your account (month-to-date):\nCopy\nCredits used over time by each warehouse in your account (month-to-date):\nCopy\n ... \nSection Title: Account Usage ¶ > Privacy Preference Center > Your Privacy > Strictly Necessary Cookies\nContent:\nAlways Active\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nCookies Details‎\nSection Title: Account Usage ¶ > Privacy Preference Center > Your Privacy > Performance Cookies\nContent:\nPerformance Cookies\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nCookies Details‎"
      ]
    },
    {
      "url": "https://nimbusintelligence.com/2023/09/snowflake-resource-monitor/",
      "title": "Snowflake Resource Monitor - Nimbus Intelligence",
      "publish_date": "2023-09-30",
      "excerpts": [
        "[Snowflake](https://nimbusintelligence.com/category/snowflake/)\nSection Title: Snowflake Resource Monitor\nContent:\nBy [Luca Balduzzi](https://nimbusintelligence.com/author/luca-balduzzinimbusintelligence-com/ \"Posts by Luca Balduzzi\") September 15, 2023 September 30th, 2023 [2 Comments](https://nimbusintelligence.com/2023/09/snowflake-resource-monitor/)\n[Home](https://nimbusintelligence.com/) » [Blogposts](https://nimbusintelligence.com/blogposts/) » Snowflake Resource Monitor\nThe Snowflake **Resource Monitor** can be used to **control warehouse credit usage** , avoiding unexpected behaviors. When executing queries on the Snowflake platform, virtual warehouses are exploited to retrieve answers and, by doing so, Snowflake credits are consumed. Credits are used to pay for the processing time/power used by each *virtual warehouse* . If desired, the *warehouse* can be suspended when it reaches a credit limit.\nLimits can be set for specific intervals or date ranges and when reached, they can trigger various actions such as notifications or warehouse shut down.\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Credit Quota\nContent:\nSpecifies the number of credits allocated to the monitor and can be any (reasonable, if you don’t want to spend billions) number. If a specified interval is given, it resets back to 0 at the end of it.\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Credit Quota > Monitor Level\nContent:\nThis setting specifies if the Resource Monitor should monitor the credit usage of the entire *Account* or a specific set of *virtual warehouses* assigned to it. The Resource Monitor is dormant if this property is not set, so basically this option is required.\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Credit Quota > Schedule\nContent:\nIf this option is not set, the Resource Monitor starts monitoring credit usage right away and credits reset back to 0 at the beginning of the standard Snowflake billing cycle, which is the calendar month.\nScheduling can further be tuned to achieve specific objectives by setting the following properties:\n**Frequency** the interval at which the used credits reset according to the start date. Possible values are:\nDaily\nWeekly\nMonthly\nYearly\n**Start** date and time when the monitoring starts. Supported values are:\nImmediately\nTimestamp\n**End** date and time when Snowflake suspends the warehouses associated with the Resource Monitor, regardless of whether the credits exceeded a threshold. Needs to be a timestamp.\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Credit Quota > Actions\nContent:\nActions (or triggers) are defined using the percentage of the credit quota assigned to the Resource Monitor and are executed upon reaching the specified threshold. Supported actions are:\n**Notify and Suspend** send a notification to all account administrators and suspend all assigned *warehouses* (after all statements being executed by the warehouses have completed). Basically it warns you that credits are ending\n**Notify and Suspend Immediately** send a notification to all account administrators and suspend all assigned *warehouses* immediately, regardless of any statements being executed. That’s the red button: just shut everything down because you don’t want to take out a mortgage to pay Snowflake\n**Notify** send an alert notification to all *account administrators*\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Resource Monitors and Warehouses\nContent:\nA Resource Monitor can be set at the *account* level or at multiple *warehouses* to control credit usage. However, a *warehouse* can only be assigned to a single Resource Monitor below the account level.\nBased on the example in the image above, we can say that:\nThe credit quota for the account is 5000 and it’s controlled by Resource Monitor 1. When this quota is reached all the actions defined for the RM are enforced to all five warehouses\nWarehouse 3 can consume a maximum of 1000 credits and it is assigned to Resource Monitor 2\nWarehouse 4 and 5 can consume a maximum combined total of 2500 credits and are assigned to Resource Monitor 3\nSection Title: Snowflake Resource Monitor > Resource Monitor Properties > Resource Monitors and Warehouses\nContent:\nIt is notable that the actual credits consumed by *warehouses* 3, 4 and 5 may be less than the *account* quota if it is reached first, because RM 1 also monitors *warehouse* 1 and 2, so if the maximum combined total of all *warehouses* is 5000, *warehouses* are shut down.\nSection Title: Snowflake Resource Monitor > ... > Warehouse Suspension and Resumption\nContent:\nUsed credits for a Snowflake Resource Monitor reflects the sum of credits consumed by all assigned *warehouses* within the specified interval, along with the *cloud services* used to support those *warehouses* during the same interval.\nIf a monitor reaches his credit threshold and one of *Suspend* or *Suspend Immediately* actions were set for it, any *warehouse* assigned to the monitor is suspended. Each suspended warehouse can’t be resumed until some conditions happen:\nthe next interval, if any, starts, as dictated by the start date of the monitor\nthe credit quota for the monitor is increased\nthe credit threshold for the suspend action is increased\nthe warehouses are no longer assigned to the monitor\nthe monitor is dropped\n ... \nSection Title: Snowflake Resource Monitor > Overview on Costs > Compute Resources Cost\nContent:\nUsing compute resources within Snowflake consumes credits. The billed cost of using *compute resources* is calculated by multiplying the number of consumed credits by the price of a credit. Credits have different costs, depending on the type of *warehouse* you choose. To learn more about this click [here](https://www.snowflake.com/pricing/pricing-guide/) .\nThere are three types of compute resources that consume credits within Snowflake:\nSection Title: Snowflake Resource Monitor > Overview on Costs > Compute Resources Cost\nContent:\n**Virtual Warehouse Compute** : *Virtual warehouses* are user-managed compute resources that consume credits when performing operations. Because Snowflake utilizes per-second billing, warehouses are billed only for the credits they actually consume when they are actively working. Note that a 60-second minimum period each time the *warehouse* starts is applied. **Serverless Compute** : There are Snowflake features such as *Search Optimization* and *Snowpipe* that use Snowflake-managed compute resources rather than *virtual warehouses* . To minimize cost, these *serverless compute* resources are automatically resized and scaled up or down by Snowflake as required for each workload. **Cloud Services Compute** : The *cloud services* layer of the Snowflake architecture consumes credits as it performs behind-the-scenes tasks.\n ... \nSection Title: Snowflake Resource Monitor > Overview on Costs > Compute Resources Cost > References\nContent:\nSnowflake Documentation: https://docs.snowflake.com/\n[Luca Balduzzi](https://nimbusintelligence.com/author/luca-balduzzinimbusintelligence-com/ \"Luca Balduzzi\") : AuthorEnterprising guy that happens to be also very flexible to the environment, thanks to previous working experiences with clients. I have a background in computer science and currently I am enrolled in Artificial Intelligence and Data Analytics MD at Politecnico di Torino. I am very passionate about data but also about economics and entrepreneurship.[View all posts](https://nimbusintelligence.com/author/luca-balduzzinimbusintelligence-com/ \"View all posts\")\nSection Title: Snowflake Resource Monitor > Overview on Costs > Compute Resources Cost > Tags:\nContent:\n[Resource Monitor](https://nimbusintelligence.com/tag/resource-monitor/) [Snowflake](https://nimbusintelligence.com/tag/snowflake/)"
      ]
    },
    {
      "url": "https://docs.snowflake.com/en/sql-reference/organization-usage/resource_monitors",
      "title": "RESOURCE_MONITORS view - Snowflake Documentation",
      "excerpts": [
        "[DOCUMENTATION](https://docs.snowflake.com)\n/\nGet started\nGuides\nDeveloper\nReference\nRelease notes\nTutorials\n[Status](https://status.snowflake.com)\nReference General reference SNOWFLAKE database Organization Usage RESOURCE_MONITORS\nSchema:\nORGANIZATION_USAGE\nSection Title: RESOURCE_MONITORS view ¶\nContent:\nEnterprise Edition Feature\nAvailable in the organization account, which requires Enterprise Edition or higher. To inquire about upgrading, please contact [Snowflake Support](https://docs.snowflake.com/user-guide/contacting-support) .\nImportant\nThis view is only available in the organization account. For more information, see Premium views in the organization account .\nThis Organization Usage view displays the resource monitors that have been created in the accounts within the organization. It does not\ninclude resource monitors from reader accounts.\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n**Organization-level columns**\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column Name | Data Type | Description |\n| ORGANIZATION_NAME | VARCHAR | Name of the organization. |\n| ACCOUNT_LOCATOR | VARCHAR | System-generated identifier for the account. |\n| ACCOUNT_NAME | VARCHAR | User-defined identifier for the account. |\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n**Additional columns**\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column | Data Type | Description |\n| RESOURCE_MONITOR_ID | NUMBER | System identifier. |\n| NAME | VARCHAR | Name of the resource monitor. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the resource monitor was created. |\n| CREDIT_QUOTA | VARIANT | Monthly credit quota for the resource monitor. |\n| USED_CREDITS | VARIANT | Number of credits used in the current monthly billing cycle by all the warehouses associated with the resource monitor. |\n| REMAINING_CREDITS | FLOAT | Number of credits still available to use in the current monthly billing cycle. |\n| OWNER | VARCHAR | Name of the role that owns the resource monitor. |\n| NOTIFY | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, notifications are sent. |\n| SUSPEND | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, assigned warehouses are suspended but currently running |\n| queries are allowed to complete. |  |  |\nSection Title: RESOURCE_MONITORS view ¶ > Columns ¶\nContent:\n| Column | Data Type | Description |\n| RESOURCE_MONITOR_ID | NUMBER | System identifier. |\n| NAME | VARCHAR | Name of the resource monitor. |\n| CREATED | TIMESTAMP_LTZ | Date and time when the resource monitor was created. |\n| CREDIT_QUOTA | VARIANT | Monthly credit quota for the resource monitor. |\n| SUSPEND_IMMEDIATE | NUMBER | Percentage of the credit quota. When consumption reaches this threshold, all assigned warehouses are suspended immediately, including |\n| those running queries. |  |  |\n| WAREHOUSES | VARCHAR | Names of the warehouses that are associated with the resource monitor. |\nSection Title: RESOURCE_MONITORS view ¶ > Usage notes ¶\nContent:\nLatency for the view may be up to 24 hours.\nThe view only displays objects for which the current role for the session has been granted access privileges.\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\nShare your feedback\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nOn this page\nColumns\nUsage notes\nLanguage: **English**\nEnglish\nFrançais\nDeutsch\n日本語\n한국어\nPortuguês"
      ]
    }
  ],
  "usage": [
    {
      "name": "sku_search",
      "count": 1
    }
  ]
}
