{"extract_id":"extract_8c3bfc262faa44c98136dc7c9c1bf6b9","results":[{"url":"https://docs.snowflake.com/en/user-guide/warehouses-multicluster","title":"Multi-cluster warehouses | Snowflake Documentation","publish_date":null,"excerpts":["Section Title: Multi-cluster warehouses [¶]( \"Link to this heading\")\nContent:\n[](../_images/logo-snowflake-black.png) [Enterprise Edition Feature](intro-editions)\nTo inquire about upgrading to Enterprise Edition (or higher), please contact [Snowflake Support](https://docs.snowflake.com/user-guide/contacting-support) .\nMulti-cluster warehouses enable you to scale compute resources to manage your user and query concurrency needs as they change, such as during\npeak and off hours.\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > What is a multi-cluster warehouse? [¶]( \"Link to this heading\")\nContent:\nBy default, a virtual warehouse consists of a single cluster of compute resources available to the\nwarehouse for executing queries. As queries are submitted to a warehouse, the warehouse allocates resources to each query and begins\nexecuting the queries. If sufficient resources are not available to execute all the queries submitted to the warehouse, Snowflake queues the\nadditional queries until the necessary resources become available.\nWith multi-cluster warehouses, Snowflake supports allocating, either statically or dynamically, additional clusters to make a larger pool\nof compute resources available. A multi-cluster warehouse is defined by specifying the following properties:\nMaximum number of clusters, greater than 1. The highest value you can specify depends on the warehouse size.\nFor the upper limit on the number of clusters for each warehouse size,\nsee [Upper limit on number of clusters for a multi-cluster warehouse]() (in this topic).\nMinimum number of clusters, equal to or less than the maximum.\nAdditionally, multi-cluster warehouses support all the same properties and actions as single-cluster warehouses, including:\n ... \nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > ... > Maximized vs. auto-scale [¶]( \"Link to this heading\")\nContent:\nYou can choose to run a multi-cluster warehouse in either of the following modes:\nMaximized :\nThis mode is enabled by specifying the same value for both maximum and minimum number of clusters (note that the\nspecified value must be larger than 1). In this mode, when the warehouse is started, Snowflake starts all the clusters so\nthat maximum resources are available while the warehouse is running.\nThis mode is effective for statically controlling the available compute resources, particularly if you have large numbers of concurrent\nuser sessions and/or queries and the numbers do not fluctuate significantly.\nAuto-scale :\nThis mode is enabled by specifying different values for maximum and minimum number of clusters. In this mode,\nSnowflake starts and stops clusters as needed to dynamically manage the load on the warehouse:\nAs the number of concurrent user sessions and/or queries for the warehouse increases, and queries start to queue due to\ninsufficient resources, Snowflake automatically starts additional clusters, up to the maximum number defined for the warehouse.\nSimilarly, as the load on the warehouse decreases, Snowflake automatically shuts down clusters to reduce the number of\nrunning clusters and, correspondingly, the number of credits used by the warehouse.\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > ... > Maximized vs. auto-scale [¶]( \"Link to this heading\")\nContent:\nTo help control the usage of credits in Auto-scale mode, Snowflake provides a property, SCALING_POLICY, that determines the scaling policy\nto use when automatically starting or shutting down additional clusters. For more information, see [Setting the scaling policy for a multi-cluster warehouse]() (in\nthis topic).\nTo create a multi-cluster warehouse, see [Creating a multi-cluster warehouse]() (in this topic).\nFor auto-scale mode, the maximum number of clusters must be *greater* than the minimum number of clusters.\nFor maximized mode, the maximum number of clusters must be *equal* to the minimum number of clusters.\nTip\nWhen determining the maximum and minimum number of clusters to use for a multi-cluster warehouse, start with Auto-scale mode and start\nsmall (for example, maximum = 2 or 3, minimum = 1). As you track how your warehouse load fluctuates over time, you can increase the maximum and\nminimum number of clusters until you determine the numbers that best support the upper and lower boundaries of your user/query concurrency.\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > ... > Multi-cluster size and credit usage [¶]( \"Link to this heading\")\nContent:\nThe amount of compute resources in each cluster is determined by the warehouse size:\nThe total number of clusters for the multi-cluster warehouse is calculated by multiplying the warehouse size by the maximum number of\nclusters. This also indicates the maximum number of credits consumed by the warehouse per full hour of usage (i.e. if all clusters run during the hour).For example, the maximum number of credits consumed per hour for a Medium-size multi-cluster warehouse with 3 clusters is 12 credits.\nIf a multi-cluster warehouse is resized, the new size applies to all the clusters for the warehouse, including\nclusters that are currently running and any clusters that are started after the multi-cluster warehouse is resized.\nThe actual number of credits consumed per hour depends on the number of clusters running during each hour that the warehouse\nis running. For more details, see [Examples of multi-cluster credit usage]() (in this topic).\nTip\nIf you use Query Acceleration Service (QAS) for a multi-cluster warehouse, consider adjusting the QAS scale\nfactor higher than for a single-cluster warehouse. That helps to apply the QAS optimizations across all the\nclusters of the warehouse.\nFor more information, see [Adjusting the scale factor](query-acceleration-service.html) .\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > ... > Benefits of multi-cluster warehouses [¶]( \"Link to this heading\")\nContent:\nWith a standard, single-cluster warehouse, if your user/query load increases to the point where you need more compute resources:\nYou must either increase the size of the warehouse or start additional warehouses and explicitly redirect the additional users/queries to\nthese warehouses.\nThen, when the resources are no longer needed, to conserve credits, you must manually downsize the larger warehouse or suspend the additional\nwarehouses.\nIn contrast, a multi-cluster warehouse enables larger numbers of users to connect to the same size warehouse. In addition:\nIn Auto-scale mode, a multi-cluster warehouse eliminates the need for resizing the warehouse or starting and stopping additional\nwarehouses to handle fluctuating workloads. Snowflake automatically starts and stops additional clusters as needed.\nIn Maximized mode, you can control the capacity of the multi-cluster warehouse by increasing or decreasing the number of clusters as\nneeded.\nTip\nMulti-cluster warehouses are best utilized for scaling resources to improve concurrency for users/queries. They are not as beneficial for\nimproving the performance of slow-running queries or data loading. For these types of operations, resizing the warehouse provides\nmore benefits.\n ... \nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Setting the scaling policy for a multi-cluster warehouse [¶]( \"Link to this heading\")\nContent:\nTo help control the credits consumed by a multi-cluster warehouse running in Auto-scale mode, Snowflake provides scaling policies.\nSnowflake uses the scaling policies to determine how to adjust the capacity of your multi-cluster warehouse\nby starting or shutting down individual clusters while the warehouse is running. You can specify a scaling policy\nto make Snowflake prioritize responsiveness and throughput for the queries in that warehouse, or to minimize costs\nfor that warehouse.\nThe scaling policy for a multi-cluster warehouse only applies if it is running in Auto-scale mode.\nIn Maximized mode, all clusters run concurrently, so there is no need to start or shut down individual clusters.\nSnowflake supports the following scaling policies:\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Setting the scaling policy for a multi-cluster warehouse [¶]( \"Link to this heading\")\nContent:\n| Policy | Description | A new cluster starts… | An idle or lightly loaded cluster shuts down… |\n| Standard (default) | Prevents/minimizes queuing by favoring starting additional clusters over conserving credits. | When a query is queued, or if Snowflake estimates the currently running clusters don’t have |  |\n| enough resources to handle any additional queries, Snowflake increases the number of clusters |  |  |  |\n| in the warehouse. |  |  |  |\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Setting the scaling policy for a multi-cluster warehouse [¶]( \"Link to this heading\")\nContent:\nFor warehouses with a MAX_CLUSTER_COUNT of 10 or less, Snowflake starts one additional cluster.\nFor warehouses with a MAX_CLUSTER_COUNT greater than 10, Snowflake starts multiple clusters at once\nto accommodate rapid increases in workload. |After a sustained period of low load, Snowflake shuts down one or more of the least-loaded\nclusters when the queries running on them finish. When the cluster count is higher than 10,\nSnowflake might shut down multiple clusters at a time. When the cluster count is 10 or less,\nSnowflake shuts down the idle clusters one at a time. |\n|Economy |Conserves credits by favoring keeping running clusters fully-loaded rather than starting additional clusters, which may result\nin queries being queued and taking longer to complete. |Only if the system estimates there’s enough query load to keep the cluster busy for at least 6 minutes. |Snowflake marks the least-loaded cluster for shutdown if it estimates the cluster has less\nthan 6 minutes of work left to do. Snowflake shuts down the cluster after finishing any\nqueries that are running on that cluster. When the cluster count is higher than 10,\nSnowflake might shut down multiple clusters at a time. When the cluster count is 10 or less,\nSnowflake shuts down the idle clusters one at a time. |\nNote\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Setting the scaling policy for a multi-cluster warehouse [¶]( \"Link to this heading\")\nContent:\nA third scaling policy, Legacy, was formerly provided for backward compatibility. Legacy has been removed.\nAll warehouses that were using the Legacy policy now use the default Standard policy.\nYou can set the scaling policy for a multi-cluster warehouse when it is created or at any time afterwards,\neither in Snowsight or using SQL:\nSnowsight :\nWhen you select Multi-cluster Warehouse under Advanced Options in the New Warehouse dialog,\nyou can select the scaling policy from the Scaling Policy drop-down list.For an existing multi-cluster warehouse, in the navigation menu, select Compute » Warehouses . Then select Edit under the More menu ( … ).In the Scaling Policy field, select the desired value from the drop-down list.TipYou only see the Scaling Policy drop-down list when the warehouse you selected is a multi-cluster warehouse,\nand the maximum clusters value is higher than the minimum clusters value.\nSQL :\nExecute a [CREATE WAREHOUSE](../sql-reference/sql/create-warehouse) or [ALTER WAREHOUSE](../sql-reference/sql/alter-warehouse) command with `SCALING_POLICY` set to the desired value.\nFor example, in SQL:\nCopy\n ... \nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Increasing or decreasing clusters for a multi-cluster warehouse [¶]( \"Link to this heading\")\nContent:\nMaximized:↑ max & min :\nSpecified number of clusters start immediately.\n↓ max & min :\nSpecified number of clusters shut down when they finish executing statements and the auto-suspend period elapses.\nAuto-scale:↑ max :\nIf `new_max_clusters > running_clusters` , no changes until additional clusters are needed.\n↓ max :\nIf `new_max_clusters < running_clusters` , excess clusters shut down when they finish executing statements and the [scaling policy]() conditions are met.\n↑ min :\nIf `new_min_clusters > running_clusters` , additional clusters immediately started to meet the minimum.\n↓ min :\nIf `new_min_clusters < running_clusters` , excess clusters shut down when they finish executing statements and the [scaling policy]() conditions are met.\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Monitoring multi-cluster warehouses [¶]( \"Link to this heading\")\nContent:\nYou can monitor usage of multi-cluster warehouses through the web interface:\nIn the navigation menu, select Compute » Warehouses .\nSelect a warehouse name.That way, you can monitor one warehouse in precise detail, such as viewing queries that are currently\nrunning or queued.Alternatively, in the navigation menu, select Monitoring » Query History .\nThis page lets you view activity across multiple warehouses in your account.\nTo see the activity only for one warehouse, select Warehouse under the Filters drop-down menu. Then choose a warehouse name from the list.\nWhen you monitor a multi-cluster warehouse, you can see all the queries the warehouse processed.\nFor each query, you can see details such as how long it took, how many bytes\nit scanned, and how many rows it returned. You can also see the cluster used to execute\neach statement that the warehouse processed. To choose which details to view, select\nthe items such as Cluster Number , Duration , Rows , and so on\nunder the Columns drop-down menu.\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\n[Share your feedback](/feedback)\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\nSection Title: Multi-cluster warehouses [¶]( \"Link to this heading\") > Monitoring multi-cluster warehouses [¶]( \"Link to this heading\")\nContent:\n[Privacy Notice](https://www.snowflake.com/privacy-policy/) [Site Terms](https://www.snowflake.com/legal/snowflake-site-terms/) Cookies Settings © 2026 Snowflake, Inc. All Rights Reserved.\nOn this page\n[What is a multi-cluster warehouse?]()\n[Examples of multi-cluster credit usage]()\n[Creating a multi-cluster warehouse]()\n[Setting the scaling policy for a multi-cluster warehouse]()\n[Increasing or decreasing clusters for a multi-cluster warehouse]()\n[Monitoring multi-cluster warehouses]()\nRelated content\n[Understanding compute cost](/user-guide/cost-understanding-compute)\n[Working with resource monitors](/user-guide/resource-monitors)\nLanguage: **English**\n[English](/en/user-guide/warehouses-multicluster)\n[Français](/fr/user-guide/warehouses-multicluster)\n[Deutsch](/de/user-guide/warehouses-multicluster)\n[日本語](/ja/user-guide/warehouses-multicluster)\n[한국어](/ko/user-guide/warehouses-multicluster)\n[Português](/pt/user-guide/warehouses-multicluster)"],"full_content":null},{"url":"https://docs.snowflake.com/en/user-guide/resource-monitors","title":"Working with resource monitors | Snowflake Documentation","publish_date":null,"excerpts":["Section Title: Working with resource monitors [¶]( \"Link to this heading\")\nContent:\nA *resource monitor* can help control costs and avoid unexpected credit usage caused by running warehouses. A [virtual warehouse](warehouses-overview) consumes Snowflake credits while it runs. You can use a resource monitor\nto monitor credit usage by virtual warehouses and the cloud services needed to support those warehouses. You can also set up a resource\nmonitor to suspend a user-managed virtual warehouse when it reaches a credit limit.\nImportant\nResource monitors work for warehouses only. You can’t use a resource monitor to track spending associated with serverless\nfeatures and AI services. To monitor credit consumption by these features, use a [budget](budgets) instead.\nThe number of credits consumed depends on the size of the warehouse and how long it runs. For more information on warehouse credit usage,\nsee [Virtual warehouse credit usage](cost-understanding-compute.html) .\nCredit usage limits can be set for a specified interval or date range. When a limit is reached and/or reaches a specified threshold,\nthe resource monitor can trigger various actions, such as sending alert notifications and/or suspending user-managed warehouses.\nOnly users with the ACCOUNTADMIN role can create a resource monitor, but an account administrator can grant privileges to other roles\nto allow other users to view and modify resource monitors.\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > ... > Monitor type [¶]( \"Link to this heading\")\nContent:\nThis property specifies whether the resource monitor is used to monitor your account or a specific set of individual warehouses:\nAn *account monitor* monitors the credit usage of all the warehouses in the account. An account can only have one account monitor.\nA *warehouse monitor* monitors the credit usage of the warehouses assigned to the resource monitor. An account can have multiple\nwarehouse monitors.A warehouse monitor can have one or more warehouses assigned to it, but each warehouse can only be assigned to one resource monitor.\nIf this property is not set, the resource monitor doesn’t monitor any credit usage. It simply remains dormant.\nFor more information, see [Assignment of resource monitors]() .\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Assignment of resource monitors [¶]( \"Link to this heading\")\nContent:\nA single monitor can be set at the account level to control credit usage for all warehouses in your account.\nIn addition, a one or more warehouses can be assigned to a resource monitor, thereby controlling the credit usage for each assigned\nwarehouse. Note, however, that a warehouse can be assigned to only a single resource monitor below the account level.\nThe following diagram illustrates a scenario in which one resource monitor is set at the account level and individual warehouses are\nassigned to two other resource monitors:\nBased on this diagram:\nThe credit quota for the entire account is 5000 for the interval (month, week, etc.), as controlled by Resource Monitor 1; if this quota\nis reached within the interval, the actions defined for the resource monitor ( **Suspend** , **Suspend Immediate** , etc.) are enforced for\nall five warehouses.\nWarehouse 3 can consume a maximum of 1000 credits within the interval.\nWarehouse 4 and 5 can consume a maximum combined total of 2500 credits within the interval.\nNote that the actual credits consumed by Warehouses 3, 4, and 5 may be less than their quotas if the quota for the account is reached first.\nImportant\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Assignment of resource monitors [¶]( \"Link to this heading\")\nContent:\nAn account-level resource monitor does not override resource monitor assignment for individual warehouses. If either the account\nresource monitor or the warehouse resource monitor reaches its defined threshold and a suspend action has been defined, the warehouse is\nsuspended.\nAn account-level resource monitor does not control credit usage by the Snowflake-provided compute resources for serverless features (for\nexample, Snowpipe, automatic reclustering, and materialized views).\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Warehouse suspension and resumption [¶]( \"Link to this heading\")\nContent:\nThe used credits for a resource monitor reflect the sum of credits consumed by all assigned warehouses within the specified interval,\nalong with the cloud services used to support those warehouses during the same interval. If a monitor has a **Suspend** or **Suspend Immediately** action defined and its used credits reach the threshold for the action, any warehouses assigned to the monitor are suspended\nand cannot be resumed until one of the following conditions is met:\nThe next interval, if any, starts, as dictated by the start date for the monitor.\nThe credit quota for the monitor is increased.\nThe credit threshold for the suspend action is increased.\nThe warehouses are no longer assigned to the monitor.\nThe monitor is dropped.\nA warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. After a virtual warehouse is\nsuspended, subsequent queries run against that warehouse can still result in additional cloud services costs. For more information\nabout credit usage for cloud services, see [Cloud service credit usage](cost-understanding-compute.html) .\nTip\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Warehouse suspension and resumption [¶]( \"Link to this heading\")\nContent:\nResource monitors are not intended for strictly controlling consumption on an hourly basis; they are intended for tracking and\ncontrolling credit consumption per interval (day, week, month, etc.). Also, they are not intended for setting precise limits on credit\nusage (i.e. down to the level of individual credits). For example, when credit quota thresholds are reached for a resource monitor, the\nassigned warehouses may take some time to suspend, even when the action is **Suspend Immediate** , thereby consuming additional credits.\nIf you wish to strictly enforce your quotas, we recommend the following:\nUtilize buffers in the quota thresholds for actions (e.g. set a threshold to 90% instead of 100%).This will help ensure that your credit usage doesn’t exceed the quota.\nTo more strictly control credit usage for individual warehouses, assign only a single warehouse to each resource monitor.When multiple warehouses are assigned to the same resource monitor, they share the same quota thresholds, which may result in credit\nusage for one warehouse impacting the other assigned warehouses.\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Creating resource monitors [¶]( \"Link to this heading\")\nContent:\nResource monitors can be created through either the web interface or SQL; however, only account administrators (i.e. users with the\nACCOUNTADMIN role) can create resource monitors.\nA resource monitor can’t be assigned more than 500 warehouses.\nImportant\nYou must assign at least one warehouse to a resource monitor or set the monitor at the account level for it to begin\nmonitoring/tracking credit usage:\nIn the web interface, you are required to do this at creation time.\nIn SQL, you must create the resource monitor first, then assign one or more warehouses to it by executing [ALTER WAREHOUSE](../sql-reference/sql/alter-warehouse) as a separate,\nadditional step.\nAlso, to receive notifications when resource monitor actions are triggered, you must [enable notifications]() .\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > ... > Creating a resource monitor with a default schedule [¶]( \"Link to this heading\")\nContent:\nTo create a monitor that starts monitoring immediately, resets at the beginning of each month, and suspends the assigned warehouse\nwhen the used credits reach 100% of the credit quota:CopyThe SUSPEND action waits for currently executing queries to finish before suspending the warehouse. A query might start before the\nthreshold is reached and complete after the SUSPEND action is triggered. In this case, the warehouse continues to consume credits\neven after the quota is reached. To create a similar monitor that suspends at 90% and suspends immediately at 100% after the quota has been reached:CopyIn this example, a notification is sent and the assigned warehouses are suspended when 90% of the credit quota is reached. Currently executing queries complete, but the resource monitor prevents the warehouses from executing any new queries. If the assigned warehouses reach 100% of the credit quota, a notification is sent and the warehouses are suspended immediately,\ncanceling all currently executing queries. This prevents all warehouses in the account from consuming credits.\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > ... > Creating a resource monitor with a default schedule [¶]( \"Link to this heading\")\nContent:\nTo create a monitor that is similar to the first example, but lets the assigned warehouse exceed the quota by 10% and also includes two\nnotification actions to alert account administrators as the used credits reach the halfway and three-quarters points for the quota:CopyIn this example:\nWhen 50% and 75% usage is reached, an alert notification is sent to all account administrators who have enabled notifications, but no\nother actions are performed. When 100% usage is reached, the assigned warehouse is suspended. If the warehouse is still running when 110% usage is reached, it is suspended immediately.\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Setting a resource monitor for your account [¶]( \"Link to this heading\")\nContent:\nTo view whether a resource monitor is set for your account, use the web interface or the [SHOW RESOURCE MONITORS](../sql-reference/sql/show-resource-monitors) command. The `LEVEL` column for a resource monitor displays whether it is set for your account or individual warehouses.\nImportant\nAn account-level resource monitor only controls the virtual warehouses explicitly created in your account; it does not control credit\nusage by the Snowflake-provided warehouses for serverless features (for example, [Snowpipe](data-load-snowpipe-intro) , [Automatic Clustering](tables-auto-reclustering) , and [materialized views](views-materialized) ).\nA warehouse-level resource monitor can monitor, but cannot suspend, credit usage by cloud services. The monitor can only\nsuspend the user-managed virtual warehouses created in your account. After a user-managed virtual warehouse is suspended, subsequent\nqueries run against that warehouse can still result in additional cloud services costs. For more information about credit usage for cloud\nservices, see [Cloud service credit usage](cost-understanding-compute.html) .\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Assigning warehouses to a resource monitor [¶]( \"Link to this heading\")\nContent:\nWarehouses can be assigned to an existing resource monitor through the web interface or SQL.\nNote\nOnly users with the ACCOUNTADMIN role can assign warehouses to resource monitors.\nSnowsight :\n1. Sign in to [Snowsight](ui-snowsight-gs.html) .\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors , then select a resource monitor.\n4. Select the More menu ( … ) in top right corner. Select Edit .\n5. If Monitor Type is Account , select Warehouse .\n6. Select Warehouse to choose the warehouses to monitor.\nSQL :\nUse the [ALTER WAREHOUSE](../sql-reference/sql/alter-warehouse) command to assign a warehouse to a resource monitor.\nFor example, to monitor warehouse `my_wh` with the resource monitor `my_rm` , execute the following statement:\nCopy\nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Viewing resource monitors [¶]( \"Link to this heading\")\nContent:\nResource monitors can be viewed through the web interface or SQL.\nSnowsight :\n1. Sign in to [Snowsight](ui-snowsight-gs.html) .\n2. In the navigation menu, select Admin » Cost management .\n3. Select Resource Monitors to see a list of resource monitors for which your role has been granted the MODIFY or MONITOR\nprivilege. Account administrator users can see all resource monitors.\n4. Select a resource monitor to view detailed information about resource monitor settings, current credit usage, and a list of\nroles with privileges on the resource monitor.\n5. Select Account [](../_images/ui-navigation-account-icon.svg) » Resource Monitors .\nSQL :\nUsing the ACCOUNTADMIN role or a role that has been granted the MONITOR or MODIFY privilege on the resource monitor, execute\na [SHOW RESOURCE MONITORS](../sql-reference/sql/show-resource-monitors) statement.\nIn addition, using any role, you can execute a [SHOW WAREHOUSES](../sql-reference/sql/show-warehouses) statement to view the warehouses owned\nby the role (or for which the role has been granted USAGE privilege). The output includes the resource monitor, if any, to which\nthe warehouse is assigned.\nNote\n ... \nSection Title: Working with resource monitors [¶]( \"Link to this heading\") > Replicating resource monitors [¶]( \"Link to this heading\")\nContent:\n[](../_images/logo-snowflake-black.png) [Business Critical Feature](intro-editions)\nResource monitor replication requires Business Critical (or higher). To inquire about upgrading, please contact [Snowflake Support](https://docs.snowflake.com/user-guide/contacting-support) .\nResource monitors can be replicated from a source account to target accounts using a [replication or failover group](account-replication-intro.html) . For more information, see [Resource monitor replication](account-replication-intro.html) .\nWas this page helpful?\nYes No\n[Visit Snowflake](https://www.snowflake.com)\n[Join the conversation](https://community.snowflake.com/s/)\n[Develop with Snowflake](https://developers.snowflake.com)\n[Share your feedback](/feedback)\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n[Get your own certification](https://learn.snowflake.com)\n[Privacy Notice](https://www.snowflake.com/privacy-policy/) [Site Terms](https://www.snowflake.com/legal/snowflake-site-terms/) Cookies Settings © 2026 Snowflake, Inc. All Rights Reserved.\nLanguage: **English**\n[English](/en/user-guide/resource-monitors)\n[Français](/fr/user-guide/resource-monitors)\n[Deutsch](/de/user-guide/resource-monitors)\n[日本語](/ja/user-guide/resource-monitors)\n[한국어](/ko/user-guide/resource-monitors)\n[Português](/pt/user-guide/resource-monitors)"],"full_content":null}],"errors":[],"warnings":null,"usage":[{"name":"sku_extract_excerpts","count":2}]}
