{
  "extract_id": "extract_c9a357ddc2b4436f84acb990f43889fd",
  "results": [
    {
      "url": "https://docs.snowflake.com/en/sql-reference/account-usage/query_history",
      "title": "QUERY_HISTORY view | Snowflake Documentation",
      "publish_date": "2026-01-01",
      "excerpts": [
        "Reference General reference SNOWFLAKE database Account Usage QUERY\\_HISTORY\n\nSchemas:\n    ACCOUNT\\_USAGE , READER\\_ACCOUNT\\_USAGE\n\n# QUERY\\_HISTORY view ¶\n\nThis Account Usage view can be used to query Snowflake query history by various dimensions (time range, session, user, warehouse, and so on) within the last 365 days (1 year).\n\nThe view is available in both the ACCOUNT\\_USAGE and READER\\_ACCOUNT\\_USAGE schemas with the following differences:\n\n* The following columns are available _only_ in the reader account view:\n  \n    + `reader_account_name`\n    + `reader_account_deleted_on`\n\nAlternatively, you can call the Information Schema table function, also named QUERY\\_HISTORY; however, note that the table function restricts\nthe results to activity over the past 7 days, versus 365 days for the Account Usage view. See the description of the QUERY\\_HISTORY function .\n\nSee also:\n\n* QUERY\\_HISTORY , QUERY\\_HISTORY\\_BY\\_\\* (Information Schema table function)\n* Monitor query activity with Query History (Snowsight dashboard)\n* Use the Grouped Query History view in Snowsight\n\n## Columns ¶\n\nThe _Available only in reader account usage views_ column in the following table indicates whether the QUERY\\_HISTORY column is available in the READER\\_ACCOUNT\\_USAGE schema.\n\n|Column Name |Data Type |Description |Available only in reader account usage views |\n| --- | --- | --- | --- |\n|`reader_account_name` |VARCHAR |Name of the reader account in which the SQL statement was executed. |✔ |\n|`query_id` |VARCHAR |Internal/system-generated identifier for the SQL statement. |✔ |\n|`query_text` |VARCHAR |Text of the SQL statement. The limit is 100K characters. Longer SQL statements are truncated. |\n|`database_id` |NUMBER |internal/system-generated identifier for the database that was in use. |✔ |\n|`database_name` |VARCHAR |database that was specified in the context of the query at compilation. |✔ |\n|`schema_id` |NUMBER |Internal/system-generated identifier for the schema that was in use. |✔ |\n|`schema_name` |VARCHAR |Schema that was specified in the context of the query at compilation. |✔ |\n|`query_type` |VARCHAR |DML, query, etc. If the query failed, then the query type may be UNKNOWN. |\n|`session_id` |NUMBER |Session that executed the statement. |✔ |\n|`authn_event_id` |NUMBER |ID for the event for the authentication of the user for this query. This ID corresponds to the value in the `event_id` column in the LOGIN\\_HISTORY view. |\n|`user_name` |VARCHAR |User who issued the query. |\n|`role_name` |VARCHAR |Role that was active in the session at the time of the query. |✔ |\n|`warehouse_id` |NUMBER |Internal/system-generated identifier for the warehouse that was used. |✔ |\n|`warehouse_name` |VARCHAR |Warehouse that the query executed on, if any. |✔ |\n|`warehouse_size` |VARCHAR |Size of the warehouse when this statement executed. |✔ |\n|`warehouse_type` |VARCHAR |Type of the warehouse when this statement executed. |✔ |\n|`cluster_number` |NUMBER |The cluster (in a multi-cluster warehouse) that this statement executed on. |✔ |\n|`query_tag` |VARCHAR |Query tag set for this statement through the QUERY\\_TAG session parameter. |✔ |\n|`execution_status` |VARCHAR |Execution status for the query. Valid values: `success` , `fail` , `incident` . |✔ |\n|`error_code` |NUMBER |Error code, if the query returned an error |✔ |\n|`error_message` |VARCHAR |Error message, if the query returned an error. The limit is 5K characters. Longer error messages are truncated. |✔ |\n|`start_time` |TIMESTAMP\\_LTZ |Statement start time (in the local time zone) |✔ |\n|`end_time` |TIMESTAMP\\_LTZ |Statement end time (in the local time zone). |✔ |\n|`total_elapsed_time` |NUMBER |Elapsed time (in milliseconds). |✔ |\n|`bytes_scanned` |NUMBER |Number of bytes scanned by this statement. |✔ |\n|`percentage_scanned_from_cache` |FLOAT |Percentage of data scanned from the local disk cache. The value ranges from 0.0 to 1.0. Multiply by 100 to get a true percentage. |\n|`bytes_written` |NUMBER |Number of bytes written (e.g. when loading into a table). |\n|`bytes_written_to_result` |NUMBER |Number of bytes written to a result object. For example, `SELECT * FROM ...` would produce a set of results in tabular format representing each field in the selection. . . In general, the results object represents whatever is produced as a result of the query, and `bytes_written_to_result` represents the size of the returned result. |\n|`bytes_read_from_result` |NUMBER |Number of bytes read from a result object. |\n|`rows_produced` |NUMBER |The number of rows produced by this statement. The `rows_produced` column will be deprecated in a future release. The value in the `rows_produced` column doesn’t always reflect the logical number of rows affected by a query. Snowflake recommends using the `rows_inserted` , `rows_updated` , `rows_written_to_result` , or `rows_deleted` columns instead. |✔ |\n|`rows_inserted` |NUMBER |Number of rows inserted by the query. |\n|`rows_updated` |NUMBER |Number of rows updated by the query. |\n|`rows_deleted` |NUMBER |Number of rows deleted by the query. |\n|`rows_unloaded` |NUMBER |Number of rows unloaded during data export. |\n|`bytes_deleted` |NUMBER |Number of bytes deleted by the query. |\n|`partitions_scanned` |NUMBER |Number of micro-partitions scanned. |\n|`partitions_total` |NUMBER |Total micro-partitions of all tables included in this query. |\n|`bytes_spilled_to_local_storage` |NUMBER |Volume of data spilled to local disk. |\n|`bytes_spilled_to_remote_storage` |NUMBER |Volume of data spilled to remote disk. |\n|`bytes_sent_over_the_network` |NUMBER |Volume of data sent over the network. |\n|`compilation_time` |NUMBER |Compilation time (in milliseconds) |✔ |\n|`execution_time` |NUMBER |Execution time (in milliseconds) |✔ |\n|`queued_provisioning_time` |NUMBER |Time (in milliseconds) spent in the warehouse queue, waiting for the warehouse compute resources to provision, due to warehouse creation, resume, or resize. |✔ |\n|`queued_repair_time` |NUMBER |Time (in milliseconds) spent in the warehouse queue, waiting for compute resources in the warehouse to be repaired. |✔ |\n|`queued_overload_time` |NUMBER |Time (in milliseconds) spent in the warehouse queue, due to the warehouse being overloaded by the current query workload. |✔ |\n|`transaction_blocked_time` |NUMBER |Time (in milliseconds) spent blocked by a concurrent DML. |✔ |\n|`outbound_data_transfer_cloud` |VARCHAR |Target cloud provider for statements that unload data to another region and/or cloud. |✔ |\n|`outbound_data_transfer_region` |VARCHAR |Target region for statements that unload data to another region and/or cloud. |✔ |\n|`outbound_data_transfer_bytes` |NUMBER |Number of bytes transferred in statements that unload data from Snowflake tables. |✔ |\n|`inbound_data_transfer_cloud` |VARCHAR |Source cloud provider for statements that load data from another region and/or cloud. |✔ |\n|`inbound_data_transfer_region` |VARCHAR |Source region for statements that load data from another region and/or cloud. |✔ |\n|`inbound_data_transfer_bytes` |NUMBER |Number of bytes transferred in a replication operation from another account. The source account could be in the same region or a different region than the current account. |✔ |\n|`list_external_files_time` |NUMBER |Time (in milliseconds) spent listing external files. |\n|`credits_used_cloud_services` |NUMBER |Number of credits used for cloud services. This value does not take into account the adjustment for cloud services , and may therefore be greater than the credits that are billed. To determine how many credits were actually billed, run queries against the METERING\\_DAILY\\_HISTORY view . |✔ |\n|`reader_account_deleted_on` |TIMESTAMP\\_LTZ |Time and date (in the UTC time zone) when the reader account is deleted. |✔ |\n|`release_version` |VARCHAR |Release version in the format of `_major_release_ . _minor_release_ . _patch_release_` . |\n|`external_function_total_invocations` |NUMBER |The aggregate number of times that this query called remote services. For important details, see the Usage Notes. |\n|`external_function_total_sent_rows` |NUMBER |The total number of rows that this query sent in all calls to all remote services. |\n|`external_function_total_received_rows` |NUMBER |The total number of rows that this query received from all calls to all remote services. |\n|`external_function_total_sent_bytes` |NUMBER |The total number of bytes that this query sent in all calls to all remote services. |\n|`external_function_total_received_bytes` |NUMBER |The total number of bytes that this query received from all calls to all remote services. |\n|`query_load_percent` |NUMBER |The approximate percentage of active compute resources in the warehouse for this query execution. |\n|`is_client_generated_statement` |BOOLEAN |Indicates whether the query was client-generated. |\n|`query_acceleration_bytes_scanned` |NUMBER |Number of bytes scanned by the query acceleration service . |\n|`query_acceleration_partitions_scanned` |NUMBER |Number of partitions scanned by the query acceleration service. |\n|`query_acceleration_upper_limit_scale_factor` |NUMBER |Upper limit scale factor that a query would have benefited from . |\n|`transaction_id` |NUMBER |ID of the transaction that contains the statement or 0 if the statement is not executed within a transaction. |\n|`child_queries_wait_time` |NUMBER |Time (in milliseconds) to complete the cached lookup when calling a memoizable function . |\n|`role_type` |VARCHAR |Specifies whether an APPLICATION, DATABASE\\_ROLE, or ROLE executed the query. |\n|`query_hash` |VARCHAR |The hash value computed based on the canonicalized SQL text. |\n|`query_hash_version` |NUMBER |The version of the logic used to compute `QUERY_HASH` . |\n|`query_parameterized_hash` |VARCHAR |The hash value computed based on the parameterized query. |\n|`query_parameterized_hash_version` |NUMBER |The version of the logic used to compute `QUERY_PARAMETERIZED_HASH` . |\n|`secondary_role_stats` |VARCHAR |A JSON-formatted string that contains three fields regarding secondary roles that were evaluated in the query: a list of secondary roles or `ALL` depending on the session, a count of the number of secondary roles, and the internal/system-generated ID for each secondary role. The count and number of IDs have a maximum of 50. |\n|`rows_written_to_result` |NUMBER |Number of rows written to a result object. For CREATE TABLE AS SELECT (CTAS) and all DML operations, this result is `1` . |\n|`query_retry_time` |NUMBER |Total execution time (in milliseconds) for query retries caused by actionable errors. For more information, see Query retry columns . |\n|`query_retry_cause` |VARCHAR |Error that caused the query to retry. If there is no query retry, the field is NULL. For more information, see Query retry columns . |\n|`fault_handling_time` |NUMBER |Total execution time (in milliseconds) for query retries caused by errors that are _not_ actionable. For more information, see Query retry columns . |\n|`user_type` |VARCHAR |The type of the user executing the query. It’s the same as the `type` column in the USERS view . If a Snowpark Container Services service executes the query, the user type is SNOWFLAKE\\_SERVICE. |\n|`user_database_name` |VARCHAR |When the value in the `user_type` column is SNOWFLAKE\\_SERVICE, it specifies the service’s database name; otherwise, it’s NULL. |\n|`user_database_id` |VARCHAR |When the value in the `user_type` column is SNOWFLAKE\\_SERVICE, it specifies the internal, Snowflake-generated identifier for the service’s database; otherwise, it’s NULL |\n|`user_schema_name` |VARCHAR |When the value in the `user_type` column is SNOWFLAKE\\_SERVICE, it specifies the service’s schema name; otherwise, it’s NULL. |\n|`user_schema_id` |VARCHAR |When the value in the `user_type` column is SNOWFLAKE\\_SERVICE, it specifies the internal, Snowflake-generated identifier for the service’s schema; otherwise, it’s NULL. |\n|`bind_values` |ARRAY |Bind values in serialized form. If the query contains no bind values, then this column contains an empty array. If the array is too large or the ALLOW\\_BIND\\_VALUES\\_ACCESS parameter is set to `FALSE` , this column contains NULL. For more information, see Retrieve bind variable values . |\n\n## Usage notes ¶\n\n### General ¶\n\n* Latency for the view may be up to 45 minutes.\n\n* The values for the columns `external_function_total_invocations` , `external_function_total_sent_rows` , `external_function_total_received_rows` , `external_function_total_sent_bytes` , and `external_function_total_received_bytes` are affected by many factors, including:\n  \n    + The number of external functions in the SQL statement.\n    + The number of rows per batch sent to each remote service.\n    + The number of retries due to transient errors (for example, because a response was not received within the expected time).\n* If you want to filter on client-generated query statements, use QUERY\\_HISTORY (an Information Schema table function).\n* Canceled queries are identified by their `error_message` text ( `SQL execution canceled` ), not by their `execution_status` value.\n\n### Query retry columns ¶\n\nA query might need to be retried one or more times in order to successfully complete. There can be multiple causes that result in a query\nretry. Some of these causes are _actionable_ , that is, a user can make changes to reduce or eliminate query retries for a specific query.\nFor example, if a query is retried due to an out of memory error, modifying warehouse settings might resolve the issue.\n\nSome query retries are caused by a fault that is not actionable. That is, there is no change a user can make to prevent the\nquery retry. For example, a network outage might result in a query retry. In this case, there is no change to the query or to the\nwarehouse that executes it that can prevent the query retry.\n\nThe QUERY\\_RETRY\\_TIME, QUERY\\_RETRY\\_CAUSE, and FAULT\\_HANDLING\\_TIME columns can help you optimize queries that are retried and better\nunderstand fluctuations in query performance.\n\n### Query history for hybrid tables ¶\n\nThe following notes explain when records are logged in the QUERY\\_HISTORY view for queries against hybrid tables:\n\n* Short-running queries that operate exclusively against hybrid tables do not generate a record in this\n  view or QUERY\\_HISTORY (Information\n  Schema table function). To monitor such queries, use the AGGREGATE\\_QUERY\\_HISTORY view.\n  This view allows you to more easily monitor high-throughput operational\n  workloads for trends and issues.\n* Short-running queries that operate exclusively against hybrid tables do not provide a query profile\n  that you can inspect in Snowsight.\n* Queries against hybrid tables do generate both a record in the QUERY\\_HISTORY view and a query profile if any of the\n  following conditions are met:\n  \n    + A query is executed against any table type other than the hybrid table type. This\n        condition ensures that there is no behavior change for any existing\n        non-Unistore workloads.\n    + A query fails with an EXECUTION\\_STATUS of `failed_with_incident` (see QUERY\\_HISTORY ). This\n        condition ensures that you can investigate and report the specific failed\n        query to receive assistance.\n    + A query is running longer than approximately 500 milliseconds. This\n        condition ensures that you can investigate performance issues for slow queries.\n    + Query result size is too large.\n    + A query is associated with a Snowflake transaction.\n    + A query contains a system function with side effects.\n    + A query is not one of the following statement types: SELECT, INSERT,\n        DELETE, UPDATE, MERGE.\n    + A query is executed from SnowSQL, Snowsight, or Classic Console. This\n        condition ensures that you can manually generate a full query profile to\n        investigate performance issues for any specific query even if it is not\n        categorized as long-running.\n    + Even if a query does not meet any of these criteria, queries can be\n        periodically sampled to generate a record in the QUERY\\_HISTORY view and a\n        query profile to help your investigation.\n\n### PUT and GET commands ¶\n\nFor the PUT and GET commands,\nan EXECUTION\\_STATUS of `success` in the QUERY\\_HISTORY does _not_ mean that data files were successfully uploaded or downloaded.\nInstead, the status indicates that Snowflake received authorization to proceed with the file transfer.\n\nWas this page helpful?\n\nYes No\n\n[Visit Snowflake](https://www.snowflake.com)\n\n[Join the conversation](https://community.snowflake.com/s/)\n\n[Develop with Snowflake](https://developers.snowflake.com)\n\nShare your feedback\n\n[Read the latest on our blog](https://www.snowflake.com/blog/)\n\n[Get your own certification](https://learn.snowflake.com)\n\nOn this page\n\n1. Columns\n2. Usage notes\n\n## Snowflake's Use of Cookies\n\n## Privacy Preference Center\n\nYour Opt Out Preference Signal is Honored\n\n* ### Your Privacy\n* ### Strictly Necessary Cookies\n* ### Performance Cookies\n* ### Functional Cookies\n* ### Targeting Cookies\n\n#### Your Privacy\n\nWhen you visit any website, it may store or retrieve information on your browser, mostly in the form of cookies. This information might be about you, your preferences or your device and is mostly used to make the site work as you expect it to. The information does not usually directly identify you, but it can give you a more personalized web experience. Because we respect your right to privacy, you can choose not to allow some types of cookies. Click on the different category headings to find out more and change our default settings. However, blocking some types of cookies may impact your experience of the site and the services we are able to offer.  \n[More information](https://cookiepedia.co.uk/giving-consent-to-cookies)\n\n#### Strictly Necessary Cookies\n\nAlways Active\n\nThese cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\n\nCookies Details‎\n\n#### Performance Cookies\n\nPerformance Cookies\n\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.    All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nCookies Details‎\n\n#### Functional Cookies\n\nFunctional Cookies\n\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages.    If you do not allow these cookies then some or all of these services may not function properly.\n\nCookies Details‎\n\n#### Targeting Cookies\n\nTargeting Cookies\n\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly identifiable personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\n\nCookies Details‎\n\n### Cookie List\n\nConsent Leg.Interest\n\ncheckbox label label\n\ncheckbox label label\n\ncheckbox label label\n\nClear\n\ncheckbox label label\n\nApply Cancel\n\nConfirm My Choices\n\nAllow All\n\n[](https://www.onetrust.com/products/cookie-consent/)"
      ],
      "full_content": null
    }
  ],
  "errors": [],
  "warnings": [
    {
      "type": "warning",
      "message": "Neither objective nor search_queries were provided, provide at least one to increase the relevance of excerpts.",
      "detail": null
    }
  ],
  "usage": [
    {
      "name": "sku_extract_excerpts",
      "count": 1
    }
  ]
}
